[{"productId":2,"resume":"When Kousei Matsumoto finds a a man apparently suffering from heatstroke alone out on the street, he takes him despite his better judgement. The young man is a mystery with a scar he won't explain, and the only clue to his past is the whispered name “Mori.” Despite this, Kousei finds his heart becoming entangled, and the pair forge a fragile relationship. When the past literally comes knocking at his door and the truth of the young man's true identity comes out, Kousei comes to a decision that literally tears the pair apart. But is it the right choice, and can the lonely, waif-like stray face his past and forge a future that includes Kousei?\n(Source Digital Manga)","productName":"Boku no Mune ga Itakutemo - Glass","img":"https:\/\/media.kitsu.io\/manga\/2\/poster_image\/large-d3fd8ae93e6621deb2f46dc66aaec749.jpeg","chapterNumber":4},{"productId":4,"resume":"Dr. Kenzo Tenma is a renowned young brain surgeon of Japanese descent working in Europe. Highly lauded by his peers as one of the great young minds that will revolutionize the field, he is blessed with a beautiful fiancé and is on the cusp of a high promotion in the hospital he works at. However, all of that is about to change with one critical decision that Dr. Tenma faces one night – whether to save the life of a young child or that of the town's mayor. Despite being pressured by his superiors to perform surgery on the mayor, his morals force him to perform the surgery on the young child, saving his life and forfeiting the mayor’s. All of a sudden, Dr. Tenma’s world is turned upside down by his decision leading to the loss of everything he previously had. A doctor is taught to believe that all life is equal; however, when a series of murders occur in the vicinity of Dr. Tenma, all of the evidence pointing to the young child who he saved, Tenma’s beliefs are shaken.\nNaoki Urasawa’s Monster is a tale full of mystery, suspense and intrigue as Dr. Tenma journeys to find out the true identity of the young child. In turn, the fate of the world may depend on it.\n\n(Source: MAL Rewrite)","productName":"Monster","img":"https:\/\/media.kitsu.io\/manga\/4\/poster_image\/large-ca2d8f80461b9fd198fafbe419526d46.jpeg","chapterNumber":162},{"productId":6,"resume":"Collection of oneshots:\n1) Pink Sweets\n2) Story of Bishounen Love\n3) Cats &amp; Aprons\n5) Strawberry on the Shortcake","productName":"Renai Soukanzu","img":"https:\/\/media.kitsu.io\/manga\/6\/poster_image\/large-136b19305c8f19dc64d9c9213f5b0943.jpeg","chapterNumber":7},{"productId":9,"resume":"Collection of 5 one shots:\n- Anata e no Tsuki (Moon for You)\n- Kataomoi no Sono Saki (Beyond A One-Sided Love)\n- 7-ho-me no Mirai\n- Kare ga Kanojo ni Nozomu Mono (What He Expects of Her)\n- Spring.","productName":"Anata e no Tsuki","img":"https:\/\/media.kitsu.io\/manga\/9\/poster_image\/large-e4865bfdec71cd3a0db5c26bc8329e0b.jpeg","chapterNumber":5},{"productId":12,"resume":"Humanity, having faced extinction at the end of the 20th century, would not have entered the new millennium if it weren't for them. In 1969, during their youth, they created a symbol. In 1997, as the coming disaster slowly starts to unfold, that symbol returns. This is the story of a group of boys who try to save the world.\n\nFor Kenji, a simple convenience store manager who once dreamed of becoming a rock 'n' roll musician, a host of memories from his past come rushing back when one of his childhood friends mysteriously commits suicide. Could this new death be related to the rise of a bizarre new cult that's been implicated in several other murders and disappearances? Determined to dig deeper, Kenji reunites with some of his old buddies in the hope of learning the truth behind it all.\n\n(Source: Viz)","productName":"20th Century Boys","img":"pas d'image","chapterNumber":249},{"productId":15,"resume":"In a school where after school activities are mandatory among all students, Hajime and her friend Sayo come across a new club that they have never seen before. The club is called \"The Cultural Activity Preservation Club.\" The two enter the room to find all kinds of analog jobs and activities, such as handcrafting mats and toothpicks. This is a unique cultural manga mixed with comedy so as not to bore you, this is Double J!\n(Source: Mangahelpers)","productName":"Double-J","img":"https:\/\/media.kitsu.io\/manga\/15\/poster_image\/large-13c4926a75f7a0adf943a5ef37254355.jpeg","chapterNumber":106},{"productId":16,"resume":"A 4koma spin-off comic of Umineko no Naku Koro ni following the witches, where Lambdadelta decides to move in with Beatrice and Battler.","productName":"Umineko no Naku Party ni: Tea Party of the Witches","img":"https:\/\/media.kitsu.io\/manga\/16\/poster_image\/large-be594094ec3411ed2eaffa405752d6fc.jpeg","chapterNumber":3},{"productId":17,"resume":"Set in a post-apocalyptic Japan of the near future where the sea level has risen and flooded much of the coastal areas and Mt. Fuji has erupted within living memory. The population has been considerably reduced and political and technological institutions have broken-down. Local communities have become nations and telephone and television no longer exist (although coffee vending machines and streetlights stubbornly continue to work). There are strange new animals and plants (like flying fish and glowing streetlight trees). The remaining people have adopted a slower-paced, simpler way of life and rely more on each other. Along with the human population are some intelligent, humanoid robots. One of the robots, a female named Alpha, runs a cafe by the same name in the country outside of what remains of Yokohama. With her trusty motorscooter and her camera she travels around the area making friends with the humans and robots, having new experiences and observing the passage of time.\n\nNote: Includes the epilogue, Touge, published with the 10 volume re-issue. Chapter count also includes 'Chapter 0' from volume 1.","productName":"Yokohama Kaidashi Kikou","img":"https:\/\/media.kitsu.io\/manga\/17\/poster_image\/large-0f16e69ae6d408f61bb23214340fbb6a.jpeg","chapterNumber":142},{"productId":18,"resume":"Shinichi works as a mangaka's assistant while trying to get published himself, but his determination falters when his father gets remarried…to a teacher Shinichi had a crush on years ago and who was the inspiration for his first manga. If he gives up on his hopeless crush, will he still find inspiration for drawing?","productName":"Fushou no Musuko","img":"https:\/\/media.kitsu.io\/manga\/18\/poster_image\/large-538ad339fbf883aca26eeb777d7193e2.jpeg","chapterNumber":1},{"productId":19,"resume":"The \"Fuji-san,\" Mount Fuji, is a national symbol for the Japanese: the volcanic mountain snowfall is a symbol of strength and wisdom. Akira Saso relate by a collection of short stories linked by a common theme: the emergence of this giant majestic systematic, disrupting the lives of characters stuck in random existences.","productName":"Fujisan","img":"https:\/\/media.kitsu.io\/manga\/19\/poster_image\/large-6969f551bb9f5f69b5539bc6820361e1.jpeg","chapterNumber":7},{"productId":22,"resume":"Kei is a high-school student bullied daily and none of his fellow classmates care. Worn down by those endless humiliations, he accepts the strange proposal of his childhood friend Akira : Suicide together to end this nightmare. But that day, Kei survives and Akira doesn't.\nMonths later, the young man is shocked when he discovers on the net a website about street fighting. On several videos put online, a barely recognizable Akira gives a major beatdown to his opponents! What really happened? To discover the truth, Kei has only one solution: registering on that site and go from fight to fight to find the truth about Akira... \n(Source: SRoMU)","productName":"Gekiryuuchi","img":"https:\/\/media.kitsu.io\/manga\/22\/poster_image\/large-e13cdcd1f8f4ec48d7ec5d6a6aa9ac56.jpeg","chapterNumber":25},{"productId":24,"resume":"12-year-old Mitsuki wants to be a singer because of a promise she made with her childhood love, however a form of throat cancer is holding her back. One day she find two strange characters in her room, Takuto and Meroko, who are gods of death. She finds out she only has a certain amount of time to live, and wants nothing more in that time then to become a singer. The two shinigami show sympathy for her, and decide to help her reach her goal by transforming her into a 16-year-old girl. \n(Source: ANN)Included one-shot:\nVolume 2: Ginyuu Meika","productName":"Full Moon wo Sagashite","img":"https:\/\/media.kitsu.io\/manga\/24\/poster_image\/large-12ff76b999e63f065b9bc4220d3b8c19.jpeg","chapterNumber":30},{"productId":29,"resume":"A childhood dream has led Ha Min to work as a conductor for Pidgeon-ho, a slow-train in a backwater country. But the life of the slow-train is unexpectedly ending and Ha Min must transfer to another train in the city. People in the new railroad are different and he soon realizes that there are some things in the slow-train to be missed. On a closer look though, Ha Min discovers that not all is bad, and maybe his dream is nearer than he thinks...\nThe train is carrying people’s dreams of leaving. Being the conductor of the Galaxy Railway 999 was Hamin’s dream. When he made it, he received the first speed of 70km per hour local train. There, There they go slow as the slow speed time to train people is to appreciate. Hamin finally gets to move up with new colleagues that have weird personalities like the horror mania conductor, Young-Ji Jo and even the food mania, Jo Seung-woo.","productName":"Railroad","img":"https:\/\/media.kitsu.io\/manga\/29\/poster_image\/large-dc74f454e818ef0b2d1c2facb8553f22.jpeg","chapterNumber":14},{"productId":30,"resume":"Noel Christonbel is Santa Claus no. 29. He and his reindeer, Rudolf (in human form) visit children on Christmas day and give them presents - whatever they ask for. However, what happens when one of the children they meet doesn't want anything... and instead feels he should die? \n(Source: MangaUpdates)","productName":"Noel la Neige","img":"https:\/\/media.kitsu.io\/manga\/30\/poster_image\/large-bdd8e705f0741d723a690de1fbc115f6.jpeg","chapterNumber":1},{"productId":31,"resume":"A young man called Ryu wakes up in a space ship and discovers that the hostile planet inhabited by monsters he has landed upon is actually Earth.\nThis manga is about him traveling in order to find civilization.","productName":"Ryuu no Michi","img":"https:\/\/media.kitsu.io\/manga\/31\/poster_image\/large-35243eb5830950d96538343a44a8c728.jpeg","chapterNumber":28},{"productId":37,"resume":"Ichigo Kurosaki has always been able to see ghosts, but this ability doesn't change his life nearly as much as his close encounter with Rukia Kuchiki, a Soul Reaper and member of the mysterious Soul Society. While fighting a Hollow, an evil spirit that preys on humans who display psychic energy, Rukia attempts to lend Ichigo some of her powers so that he can save his family; but much to her surprise, Ichigo absorbs every last drop of her energy. Now a full-fledged Soul Reaper himself, Ichigo quickly learns that the world he inhabits is one full of dangerous spirits and, along with Rukia—who is slowly regaining her powers—it's Ichigo's job to protect the innocent from Hollows and help the spirits themselves find peace.\n\n(Source: ANN)\n\nNote: Chapter count includes the following 19 extra chapters.\n\nVolume 10 contains chapter 88.5 \"Karakura Super Heroes.\" --not included in the count.\nVolume 12 contains chapter 0.8 \"A Wonderful Error.\"\nVolume 15 contains chapter -17 \"Soreyuku Hoshiboshi no Tame no Zensoukyoku\" (逸れゆく星々の為の前奏曲, Prelude for the Straying Stars).\nVolume 20 contains chapter -12.5 \"Blooming Under a Cold Moon.\"\nVolume 23 contains the two-part chapter 0 \"Side-A The Sand\" and \"Side-B The Rotator.\"\nVolume 32 contains chapter -16 \"Hyougen ni Shisu\" (氷原に死す, Dying in the Ice Fields).\nVolume 36 consists of chapters -108 to -100 \"Turn Back the Pendulum.\"\nVolume 37 contains chapters -99 to -97 \"Turn Back the Pendulum\" and \"Let Stop the Pendulum.\"\nVolume 70 contains chapter 520.5 \"Walk Under Two Letters\" (520.5 WALK UNDER TWO LETTERS).\n\nTotal chapter count is 705.","productName":"Bleach","img":"https:\/\/media.kitsu.io\/manga\/37\/poster_image\/large-4f4237a25573f67e17c7b69e33767ed2.jpeg","chapterNumber":705},{"productId":40,"resume":"The Continent of Song is in chaos. The sinister secret society known as Demon Card is using the power of Dark Bring to destroy everything in their path. The only things capable of stopping Dark Bring are the Rave stones. Unfortunately, the Rave Stones were scattered around the globe in an explosion 50 years ago, so now they must be collected by the Rave Master in order to stop Dark Bring once and for all. This new task has been given to Haru Glory; a sixteen-year-old boy from Garage Island. The World's fate now rests on the new, young Rave Master. (Source: Tokyopop)Note: The total chapter count includes the original 296 chapters for the actual manga, plus 2 additional chapters: a special chapter entitled RAVE007 and an epilogue chapter, totaling 298.  Please do not change the chapter count.","productName":"Rave","img":"https:\/\/media.kitsu.io\/manga\/40\/poster_image\/large-bcf33e19d54c25eac27f94ba8db7bf9b.jpeg","chapterNumber":298},{"productId":42,"resume":"This volume includes one longer story and two shorter stories.","productName":"Hisureba Shitsuji","img":"https:\/\/media.kitsu.io\/manga\/42\/poster_image\/large-5d44318321d7d015bbaa07280ed93d43.jpeg","chapterNumber":8},{"productId":44,"resume":"Negi Springfield, a 10-year-old wizard who recently graduated from Merdiana Magic Academy in Wales, hopes to achieve two things—to find his missing father, who was once known as the Thousand Master, and to become a Magister Magi, someone who helps the everyday world through magic. To reach his latter goal, he is assigned one last task: to teach English at a middle school in Japan.\n\nMuch to his surprise and dismay, he not only discovers that his homeroom class consists of 31 girls, but also ends up revealing his true identity as a magician to Asuna Kagurazaka, one of his new students. Negi must now negotiate with the girl and face his most difficult challenge yet—to keep his identity a secret as he tackles magical threats both from within and outside of Mahora Academy, all the while keeping a watchful eye out for his lost father.\n\n[Written by MAL Rewrite]","productName":"Mahou Sensei Negima!","img":"https:\/\/media.kitsu.io\/manga\/44\/poster_image\/large-cf932fec94b1bf832e3a8bdc9f0803d5.jpeg","chapterNumber":355},{"productId":47,"resume":"Keitaro has had great difficulty getting into the university of his choice and no luck in meeting women. In a desperate effort to go into seclusion and study for his entrance exams, he volunteers to take over running his grandmother's hotel. His plans are ruined when he discovers that the \"hotel\" is actually an all-girls dormitory ... and some serious distractions ensue.\n(Source: Tokyopop)","productName":"Love Hina","img":"https:\/\/media.kitsu.io\/manga\/47\/poster_image\/large-4d6784a9c9264d954e1a0a26ae5f18bd.jpeg","chapterNumber":120},{"productId":48,"resume":"Side story from Gosick.","productName":"Gosick W","img":"https:\/\/media.kitsu.io\/manga\/48\/poster_image\/large-44d173565cb03e19916f128c48af76bd.jpeg","chapterNumber":12},{"productId":49,"resume":"Kanda Takashi immediately falls for his beautiful superior, Tokishima Azusa, the moment he lays eyes on him. Although he is undeniably infatuated, Kanda refuses to hope that his impossible crush will be reciprocated. Intending to drown his sorrows, Kanda organizes a night out with a friend and somehow stumbles upon an incredible secret being kept by Tokishima.\n(Source: Blissful Sin)","productName":"Hot Closet","img":"https:\/\/media.kitsu.io\/manga\/49\/poster_image\/large-da825594ce57f78c7515510884bfa5ac.jpeg","chapterNumber":1},{"productId":50,"resume":"Yukino Miyazawa is the perfect model student. Pretty, kind, good at sports, always at the top of her class. But she's not all that she seems. It's all an act of deception; she is really the self-confessed 'queen of vanity,' and her only goal in life is winning the praise and admiration of everyone around her.\nWhen she enters high school, she finally meets her match: Souichirou Arima, a handsome, athletic, popular, and very intelligent young boy. Ever since he stole the top seat in the class from her, Yukino has hated him, and has been plotting on how to take back her former place as the object of all other students' admiration.\nWhat she wasn't expecting, however, was that Souichirou, the very boy she hated, would confess his love for her. Or that he would find out about her deception - and use it to blackmail her!\nTogether, they discover that they have more in common than they knew, and they slowly begin to bring out each other's inner selves.\nAlso included are the following short stories:\nVol.1: The Tiger and the Chameleon - A Promise for One Week\nVol.4: Ashita Mata Mori de Aou ne (Meet Me Again Tomorrow in the Forest)\nAlways an outcast because of her black hair the heroine of the story finds a strange man in the forest - a man from Earth - and he has black hair, too!\n(Source: MU)","productName":"Kareshi Kanojo no Jijou","img":"https:\/\/media.kitsu.io\/manga\/50\/poster_image\/large-b3e7d0a0c0724804a2b6fc72606ac307.jpeg","chapterNumber":103},{"productId":51,"resume":"Twenty-nine-year-old Mikita Ryuuji has been hiding his love for his friend Koya for so long that he can't take it anymore. At his wit's end, he spends one night with Sudo, a man he met at a bar. It was supposed to be a one-night stand, an event he'd forget about the next day with someone he'd never see again. But when Sudo does show up again, this time determined to stay for good, Mikita's life starts to fall apart...\n(Source: Storm in Heaven)","productName":"Illumination","img":"https:\/\/media.kitsu.io\/manga\/51\/poster_image\/large-f33538b508306f77290f2494aa56a2e4.jpeg","chapterNumber":7},{"productId":52,"resume":"Sana Kurata, a child actress, faces many problems in her classroom, including a major one - her bullying classmate, Akito Hayama. Sana's outgoing and friendly nature leads her to work towards correcting all of the problems around her. Her 'meddling' irritates Hayama but at the same time captivates him, just as Hayama's gloomy nature irritates Sana and compels her to change him. As these two opposites attract each other, they face many hardships which bring them closer to a mutual understanding. (Source: ANN)","productName":"Kodomo no Omocha","img":"https:\/\/media.kitsu.io\/manga\/52\/poster_image\/large-1ecd6f38110cbc81dc7a25d75b8c59bf.jpeg","chapterNumber":54},{"productId":53,"resume":"Blonde, hip, pragmatic and cool, Ginji Amano has the power to generate currents with his body like an electric eel. Brunette, equally hip, bespectacled and rambunctious, Ban Mido has the mystically mysterious 'Evil Eye,' the power to create illusions in the minds of his foes. Together, they are the GetBackers, the best retrieval team in the world. They can get back anything taken from clients, and their success rate is (almost) 100%! However, first they have to get some clients--and soon--or this spry detective duo will starve on the streets!\n(Source: Tokyopop)","productName":"GetBackers","img":"https:\/\/media.kitsu.io\/manga\/53\/poster_image\/large-49f752b8224fa0d73af9c43074a31f20.jpeg","chapterNumber":344},{"productId":56,"resume":"After stumbling across a haunted Go board, irresponsible Hikaru Shindo discovers that the spirit of a master player has taken up residence in his consciousness. In his pursuit of the \"Divine Move,\" Fujiwara-no-Sai awakens in Hikaru an untapped interest and genius for the game, and soon the schoolboy is chasing his own dream--defeating the famed Go prodigy Akira Toya!\n(Source: Viz)Note: There are 197 chapters total in the original release.","productName":"Hikaru no Go","img":"https:\/\/media.kitsu.io\/manga\/56\/poster_image\/large-11e2524290d1e20221f75d501706d9c5.jpeg","chapterNumber":197},{"productId":57,"resume":"Light Yagami is a brilliant 17-year-old student, one of the top scorers on his exams in all of Japan. One day as he leaves school, he finds a mysterious black notebook on the ground with \"Death Note\" written on it. The first thing written inside: \"The human whose name is written in the notebook shall die.\" Light decides to use this to cleanse the world of evil by killing all the criminals. On the scene comes L, ace detective, who's determined to find Light—who the world now calls \"Kira\"—and track him down, thus bringing us an epic psychological thrill ride.","productName":"Death Note","img":"https:\/\/media.kitsu.io\/manga\/57\/poster_image\/large-c45932b7d7e5981ad4afb466befd7434.jpeg","chapterNumber":108},{"productId":58,"resume":"Mankind is near extinct due to the rebellion of a slave species that they created. This story follows one of the last humans, Yakumo, as she travels to find Center, hoping to unite the humans living there in peace with the Matrixer.","productName":"Mushrambo","img":"https:\/\/media.kitsu.io\/manga\/58\/poster_image\/large-ca095778a1529b571d98f318d4e9a272.jpeg","chapterNumber":8},{"productId":61,"resume":"No synopsis has been added for this manga yet.Click here to update this information.","productName":"Get!","img":"https:\/\/media.kitsu.io\/manga\/61\/poster_image\/large-1c6771e2fcd0780a0733c46663fa9985.jpeg","chapterNumber":9},{"productId":62,"resume":"In China, there lies a famous training springs, a place where martial artists can hone their skills to great levels. Unfortunately, the springs are also cursed! Teenage martial artist Ranma falls into the \"spring of drowned girl\" and now changes into a woman every time he's splashed with cold water. That doesn't stop his father from engaging him to Akane, the daughter of an old friend and a tough girl who has better thing to do than worry about boys. But Akane isn't the only girl who has a chance for Ranma's affections -- two other girls have also been betrothed to him. But Ranma has better things to do than worry about his love life -- such as making a plethora of crazy rivals and even more suitors!","productName":"Ranma ½","img":"https:\/\/media.kitsu.io\/manga\/62\/poster_image\/large-16d211398bdb5644b0c94f34a4ec8275.jpeg","chapterNumber":407},{"productId":66,"resume":"In an alchemical ritual gone wrong, Edward Elric lost his arm and his leg, and his brother Alphonse became nothing but a soul in a suit of armor. Equipped with mechanical \"auto-mail\" limbs, Edward becomes a state alchemist, seeking the one thing that can restore his brother and himself... the legendary Philosopher's Stone.\n\nWon the 49th Shogakukan Manga Award in the Shounen category.\nWon the 15th Tezuka Osamu Cultural Award New Artist Prize.\nWon the Eagle Award's \"Favourite Manga\" in 2010\/2011.\nWon the Seiun Award for best science fiction comic in 2011.","productName":"Fullmetal Alchemist","img":"https:\/\/media.kitsu.io\/manga\/66\/poster_image\/large-1dbec771ad51716858f0388bfc6018ac.jpeg","chapterNumber":116},{"productId":67,"resume":"A collection of 4 Short Stories from the author Aoi Makino featuring adolescent trouble such as mobbing for instance.","productName":"Saishuu Loop","img":"https:\/\/media.kitsu.io\/manga\/67\/poster_image\/large-a51d1880cc2e326d631d0fd4f95d13ef.jpeg","chapterNumber":4},{"productId":69,"resume":"Strawberry, Melon, Yuzu, Cream, Banana, Pumpkin, Potato, Coffee, Onion, Blueberry, Eggplant, Apple, Warabi, Cacao, Broccoli &amp; Cauliflower.\nOkama shall teach you the nutritious value of girls and food! Welcome to Food Girls worlds!","productName":"Food Girls","img":"https:\/\/media.kitsu.io\/manga\/69\/poster_image\/large-bf2696b8dca7090ec7f3cfb28c503bcd.jpeg","chapterNumber":15},{"productId":71,"resume":"Kamui Shiro is a young man who was born with the power to decide the fate of the Earth itself--a destiny he can barely bring himself to believe. But as other players in the prophesy begin to gather around him--the \"Seven Seals,\" with the power to protect the Earth, and the \"Seven Harbingers,\" who are fated to destroy it--he has no choice but to come to terms with his fate. (Source: Viz)","productName":"X","img":"https:\/\/media.kitsu.io\/manga\/71\/poster_image\/large-8c7ba39c1d29b6b71006af3d11f8ce44.jpeg","chapterNumber":158},{"productId":74,"resume":"Nana Komatsu is a young woman who's endured an unending string of boyfriend problems. Moving to Tokyo, she's hoping to take control of her life and put all those messy misadventures behind her. She's looking for love and she's hoping to find it in the big city.\nNana Osaki, on the other hand, is cool, confident and focused. She swaggers into town and proceeds to kick down the doors to Tokyo's underground punk scene. She's got a dream and won't give up until she becomes Japan's No. 1 rock'n'roll superstar.\nThis is the story of two 20-year-old women who share the same name. Even though they come from completely different backgrounds, they somehow meet and become best friends. The world of Nana is a world exploding with sex, music, fashion, gossip and all-night parties.\n(Source: Viz Media)","productName":"Nana","img":"https:\/\/media.kitsu.io\/manga\/74\/poster_image\/large-fd4b0d80876a2024cc70ae71d87bfadb.jpeg","chapterNumber":84},{"productId":76,"resume":"Yukari wants nothing more than to make her parents happy by studying hard and getting into a good college. One afternoon, however, she is kidnapped by a group of self-styled fashionistas calling themselves \"Paradise Kiss.\" Yukari suddenly finds herself flung into the roller-coaster life of the fashion world, guided by George, art-snob extraordinaire. In a glamorous makeover of body, mind and soul, she is turned from a hapless bookworm into her friends 22 own exclusive clothing model.\n\n(Source: Tokyopop)","productName":"Paradise Kiss","img":"https:\/\/media.kitsu.io\/manga\/76\/poster_image\/large-e0fa6cd2da3e081d10405db98d54cb31.jpeg","chapterNumber":48},{"productId":78,"resume":"Haruhi sticks out like a sore thumb as a poor, smart girl who got into the hoity-toity Ouran High School on talent alone. When she mistakenly wanders into the meeting room of the host club and breaks a valuable vase, she's recruited to join the club. Realistic and sarcastic, Haruhi isn't used to being around crazy people like the princely Tamaki, scheming Kyouya, silent Mori, immature Hunny, and devilish Hikaru and Kaoru, but she's got no choice if she ever wants to pay earn what she owes. Too bad the club is made for girls to come and be entertained by gorgeous guys -- and Haruhi's been mistaken for a boy!\nIncludes chapters of the story \"Romantic Egoist\" in various volumes, starring a pair of twins who play matchmaker with their fellow students, teachers and the like.\n(Source: MAL)Note: The final volume contains a special bonus chapter where the group travels to Spain.","productName":"Ouran Koukou Host Club","img":"https:\/\/media.kitsu.io\/manga\/78\/poster_image\/large-29cc5e6f63e4fc29d164bdbd48728f7f.jpeg","chapterNumber":87},{"productId":80,"resume":"Shinichirou decides to look for a job in order to pay his rent, and his teacher suggests that he work for someone at their house,doing housekeeping. However, the person who hired him was Sakuya, a girl who is the 37th head of the Shimazu family, and her job is to exorcise and eliminate unwanted creatures. Shinichirou accidentally releases one of the creatures that Sakuya captures and they cooperate to catch it. A story of comedic creature hunting begins! \n(Source: MU)\n\nNote: Volumes 4–8 contain side stories.","productName":"Isuca","img":"https:\/\/media.kitsu.io\/manga\/80\/poster_image\/large-bc8608b2bdabb4dd61f38716f50473ba.jpeg","chapterNumber":66},{"productId":81,"resume":"Risa and Otani are in a similar predicament. Neither is dating anyone, they are both continually being laughed at as a comedy duo (courtesy of their loving sensei), and they both have height problems! Risa is taller than the average girl, and Otani is shorter than the average guy! \nDetermined to be in a relationship, they both decide to cheer each other on in the war of love. However, along the way, Risa begins to develop feelings for Otani... Are these feelings mutual? Can love win, no matter what the height? \n(Source: MU) \nIncluded one-shots:\nVolume 12: Hoshi ni Nattemo Aishiteru\nVolume 16: Bokura no Ibasho","productName":"Lovely★Complex","img":"https:\/\/media.kitsu.io\/manga\/81\/poster_image\/large-50de96bbcf8984e0ff72a74e14a93a95.jpeg","chapterNumber":66},{"productId":82,"resume":"A funny collection of short stories about two girls: Nanami and Misuzu.","productName":"Nanami to Misuzu","img":"https:\/\/media.kitsu.io\/manga\/82\/poster_image\/large-936109e3a1e638de38cbd713c15c50fd.jpeg","chapterNumber":28},{"productId":83,"resume":"In the not too distant future, mankind battles over O-Parts, relics from an ancient civilization. It takes a special kind of person to unlock the full potential of these remnants from the past, and a unique breed of humans known as O.P.T.s (or O-Parts Tacticians) become a force to be reckoned with. Unfortunately, O-Parts can be used for good or evil purposes.\nJio is a young boy with a tragic past who only trusts one thing in the world: money. Little does he suspect that he is actually a very powerful O.P.T., and inside him sleeps a demon of incredible ferocity. He meets up with a girl named Ruby, and together they decide to embark on a dangerous quest to discover as many O-Parts as they can. Will Jio help Ruby realize her dream of becoming a world famous treasure hunter? More importantly, will Ruby help Jio realize his dream of--world domination?!\n(Source: Viz Media)\nIncluded one-shots:\nVolume 6: Trigger","productName":"666 Satan","img":"https:\/\/media.kitsu.io\/manga\/83\/poster_image\/large-3e15b695ac1316ebb69cbd42bf3ba6c8.jpeg","chapterNumber":76},{"productId":84,"resume":"1. Kamisama no Sonata\n2. Mahoroba no Yobigoe\n3. Ipaasha\n4. Taiyou mo Wasure Sasete","productName":"Kamisama no Sonata","img":"https:\/\/media.kitsu.io\/manga\/84\/poster_image\/large-535e3fb73ef92bf61bd6c6a4890be24b.jpeg","chapterNumber":4},{"productId":85,"resume":"Far in the future, humankind has evacuated the Earth in order to preserve it. Humans now reside in a gigantic structure that forms a ring around the Earth, thirty-five kilometers up in the sky. The society of the ring is highly stratified: the higher the floor, the greater the status. Mitsu, the lowly son of a window washer, has just graduated junior high. When his father disappears and is assumed dead, Mitsu must take on his father's occupation. As he struggles with the transition to working life, Mitsu's job treats him to an outsider's view into the various living-room dioramas of the Saturn Apartments.\n(Source: Viz)","productName":"Dosei Mansion","img":"https:\/\/media.kitsu.io\/manga\/85\/poster_image\/large-445ff4ebc67b954bbeb4f0e8a358a7bf.jpeg","chapterNumber":64},{"productId":86,"resume":"When you're a sadist and the boy you love is a masochist, picking on him is a pleasure.\nPain doesn't affect Yoshie... no, that's not quite right; it feels good! Sensei's forceful massages at the Seitai Clinic are the best. But Sensei's solemn and bone-obsessed son, Mikawa, is secretly listening to Yoshie's breathless moans! Is it only a passion for bones that excites Mikawa? Yoshie soon realizes that pain in your heart isn't the same as pain in your body.\nExtra story: A young man loves the pâtissier who works at his dad's café, but with their age gap, will his love ever be taken seriously?\n(Source: DMG)","productName":"Yamashii Karada","img":"https:\/\/media.kitsu.io\/manga\/86\/poster_image\/large-f1c9a921f0d1d42abe244cc33105e62c.jpeg","chapterNumber":18},{"productId":87,"resume":"History repeats itself... Or does it? St. Kleio Academy is a very exclusive school: all of the students are clones of famous historical figures such as Beethoven, Queen Elizabeth I, Napoleon, Mozart, and Freud. All of them, that is, except for Shiro Kamiya. As Shiro struggles to adapt to this unusual campus, St. Kleio's first graduate, a clone of John F. Kennedy, is killed. Are the clones doomed to repeat the fate of their genetic progenitors, or can they create their own destinies? And how does a normal boy like Shiro fit in? \n(Source: Viz)","productName":"Houkago no Charisma","img":"https:\/\/media.kitsu.io\/manga\/87\/poster_image\/large-ae83da36e16ba86bfe3df8c17fdb7763.jpeg","chapterNumber":72},{"productId":88,"resume":"Misha has just moved in next door to Kotarou Higuchi and swears she will protect him at all costs. Unfortunately, she's not too familiar with the ordinary world, as she is an angel who has lived in Heaven until recently. She has no idea how things work on earth and ends up causing more trouble.\n(Source: Tokyopop)","productName":"Pita-Ten","img":"https:\/\/media.kitsu.io\/manga\/88\/poster_image\/large-489c08cfd049f95dae673abf140c599b.jpeg","chapterNumber":47},{"productId":91,"resume":"On planet Di Gi Charat, little Digiko was a pampered princess. Now living on Earth, the green-haired moppet is working for minimum wage at a hobby shop in Japan. Who ever said it was easy being cute? Based on the popular anime series, Di Gi Charat also features bratty Usada, shy boy Minagawa, and Digiko's wacky companions Puchiko and Gemo! \n(Source: Viz)","productName":"Di Gi Charat: Koushiki Comic Anthology","img":"https:\/\/media.kitsu.io\/manga\/91\/poster_image\/large-f27256c5e2bf8e76419f68af26e9c80f.jpeg","chapterNumber":72},{"productId":92,"resume":"When the Isshiki family runs into monetary trouble, their last option is to turn to the god of fortune that resides in their home. However, instead of helping them, he rather see their entire family destroyed! It's up to Tarou to find out Kami-san's past and why their God of fortune has turned into one of misfortune!\n(Source: Bliss Scanlations)","productName":"Tsumi to Bachi","img":"https:\/\/media.kitsu.io\/manga\/92\/poster_image\/large-10e3fc557f559d3c5e2e8444b90d3539.jpeg","chapterNumber":15},{"productId":94,"resume":"No synopsis has been added for this manga yet.Click here to update this information.","productName":"Akai Sora Shiroi Umi","img":"https:\/\/media.kitsu.io\/manga\/94\/poster_image\/large-ed431f8208e512b801d48492bb7bb1de.jpeg","chapterNumber":18},{"productId":95,"resume":"Karin is an average girl...at best. She's not good at sports and gets terrible grades. Plus, her parents are dead and her beloved cat Shii-chan just died, too. She is miserable...but everything is about to change. Because little does Karin know that her mother's ring has the power to make her a goddess! Soon she and Kazune, a brusque but cute boy with godlike powers of his own, will have to fight to protect Karin's ring and Kazune's cousin Himeka from the evil forces of Kirio Karasuma...who has divine designs of his own.\n(Source: Tokyopop)","productName":"Kamichama Karin","img":"https:\/\/media.kitsu.io\/manga\/95\/poster_image\/large-00bcc963df10ec4eb227304e887d094b.jpeg","chapterNumber":32},{"productId":97,"resume":"By day, Kusakabe Maron is an ordinary high school girl with more than her share of problems. But by night, she is Kamikaze Kaito Jeanne, the reincarnation of Joan of Arc! Her mission: to hunt down demon-possessed paintings and exorcise the evil spirits! Too bad accomplishing this mission puts her into conflict with the authorities, who view her as a mysterious stranger vandalizing works of art. With only the help of angel-in-training Finn, she must survive high school during the day and battle evil by night!\n(Source: CMX)","productName":"Kamikaze Kaitou Jeanne","img":"https:\/\/media.kitsu.io\/manga\/97\/poster_image\/large-10a0af8dbfedc5f7c58cd4ac049650d4.jpeg","chapterNumber":33},{"productId":99,"resume":"No synopsis has been added for this manga yet.Click here to update this information.","productName":"Mirai Chonaikai","img":"https:\/\/media.kitsu.io\/manga\/99\/poster_image\/large-ddf1d69ac3fc84cb36af7bd6edb7ee9a.jpeg","chapterNumber":1},{"productId":100,"resume":"No synopsis has been added for this manga yet.Click here to update this information.","productName":"Nyan Cafe e Youkoso!","img":"https:\/\/media.kitsu.io\/manga\/100\/poster_image\/large-30b5b400df314d29463b4559a24c83fc.jpeg","chapterNumber":17},{"productId":101,"resume":"In return for a business loan of 50 million yen, the prestigious Kamiya family gave their daughter Haine away to the Otomiya family. Haine, now an Otomiya, is appointed to the student council of the exclusive Imperial Academy, a private school for the aristocracy. Even though Haine is of proper lineage to be on the council, she finds herself struggling to find her place among the many secrets of its elite members, especially those of the president who holds her heart--Shizumasa Togu, aka \"the Emperor.\"\n(Source: Viz)Included one-shots","productName":"Shinshi Doumei Cross","img":"https:\/\/media.kitsu.io\/manga\/101\/poster_image\/large-9c2fcf2c2758a61a545ec079c267f0ce.jpeg","chapterNumber":59},{"productId":103,"resume":"Minori no Hibi is a cute short manga about a girl that goes to live with her wacky grandfather. Her grandfather, an inventor of strange items, likes to try them out on Minori. Many escapades then ensue as Minori learns to cope with these situations day by day.\nNo, this is not the sister manga of a certain series about a guy with a doll on his hand. All similarities in title are unintentional.","productName":"Minori no Hibi","img":"https:\/\/media.kitsu.io\/manga\/103\/poster_image\/large-47c5201b5be29047cb76c551ea17afed.jpeg","chapterNumber":42},{"productId":104,"resume":"Beings who possess animal-like powers walk among humans in this alternate universe. These mysterious mutants, the +Anima, are shunned by society. Four outcasts in particular--Cooro, a boy with crow-like powers; Husky, a fish-boy; Senri, a bear +Anima; and a girl named Nana, who wields the power of the bat--search for others like themselves while trying to gain acceptance in a world cruel to anyone or anything that is different.\n\n(Source: Tokyopop)","productName":"+Anima","img":"https:\/\/media.kitsu.io\/manga\/104\/poster_image\/large-f9a875c8b30a93b6c5c3cc1d37ce546c.jpeg","chapterNumber":59},{"productId":105,"resume":"Compilation of 5 stories:\n1. Kataomoi no Mukougawa\nAzusa knew the boy in the library was already in love... So what can she do when she starts to fall for him?\n(Source: Which Scanlations)\n2. Ano Kado o Magareba\n3. Tenshi ga Kuretamono\n4. Bitou na Koi\nA boyish girl who hates coffee and a quiet guy who likes girly girls, or does he?\n(Source: Aerandria Scans)\n5. Kimi to Natsu no Aizu","productName":"Kataomoi no Mukougawa","img":"https:\/\/media.kitsu.io\/manga\/105\/poster_image\/large-6f0aca0c04c9b106e8bbcb0034f11ad9.jpeg","chapterNumber":5},{"productId":106,"resume":"Somewhere in the desert lies the world's greatest treasure: the 12 Rings of the Dead, the only source of the mysterious substance Zombie Powder, which can raise the dead and grant eternal life. Into this world stalks Gamma Akutabi, a man with a metal arm and a six-foot chainsaw, cybernetically enhanced master of the legendary martial art . But it takes more than one man to find the ultimate prize. You need a team: super-gunman C.T. Smith, knife-slinging teenager Elwood, and brilliant (and impossibly big-breasted) journalist Wolfgangina. Against an army of crooks and killers, against runaway trains and superpowered madmen, they'll need all their skills... but the most dangerous thing in the west might be the Rings themselves... \n(Source: Viz)","productName":"Zombie Powder.","img":"https:\/\/media.kitsu.io\/manga\/106\/poster_image\/large-09b8cd6c41d74c4fc5070d0631ae02f0.jpeg","chapterNumber":30},{"productId":107,"resume":"Train Heartnet, also known as \"Black Cat,\" was an infamous assassin for a secret organization called Chronos...until he abandoned that cold-blooded existence to live on his own terms as an easygoing bounty hunter. But is Train's past as far behind him as he thinks?\n(Source: Viz)","productName":"Black Cat","img":"https:\/\/media.kitsu.io\/manga\/107\/poster_image\/large-2f03d7daa2a44542169302e8e29bbf8a.jpeg","chapterNumber":187},{"productId":109,"resume":"Aoba is dating the sweet, puppy-like Youhei, but he's also dating the possessive and domineering Yoichi, the elegant and refined Yoko, and the easy-going Yoji, because Youhei has a multiple personality disorder! Aoba is trying to convince Youhei that he loves only him, but Youhei lacks confidence and with Yoichi constantly interfering will the message ever get across? (Source: Baka-Updates)","productName":"Kokoro Logic","img":"https:\/\/media.kitsu.io\/manga\/109\/poster_image\/large-f3d23e04cfc51b27250ab2bb10480b38.jpeg","chapterNumber":1},{"productId":110,"resume":"Buso Renkin is the story of teenager Kazuki Muto, who dies trying to save a girl who was being attacked by an eerie monster. The next morning, however, Kazuki is left wondering whether it was all a dream. Lo and behold, the girl, the monster, and his death are all real! The girl, Tokiko Tsumura, was actually trying to slay the homunculus (a beast that can take the form of humans, but whose main source of food is people), but Kazuki got in her way. To revive Kazuki, Tokiko replaces his heart with a \"kakugane,\" an alchemic device that allows him to summon a lance with which to fight the monsters. It turns out that Tokiko is a member of Renkin Kenshi (Alchemist Soldiers), an organization sworn to protect the world from the diabolical creatures. Soon, Kazuki joins Tokiko in her quest to terminate the sinister being that creates and controls the homunculus.\n(Source: Viz)","productName":"Busou Renkin","img":"https:\/\/media.kitsu.io\/manga\/110\/poster_image\/large-17e0267a6ce4a7d86eb62fd0c856cde3.jpeg","chapterNumber":83},{"productId":111,"resume":"Dragon Ball follows the adventures of Son Goku from his childhood through adulthood as he trains in martial arts and explores the world in search of the seven mystical orbs known as the Dragon Balls, which can summon a wish-granting dragon when gathered. Along his journey, Goku makes several friends and battles a wide variety of villains, many of whom also seek the Dragon Balls for their own desires. Along the way becoming the strongest warrior in the universe.\nPart II of Dragon Ball is also known as 'Dragon Ball Z' in North America.\nVolumes 17-42 were published in North America under the name Dragon Ball Z.\n(Source: Wikipedia)","productName":"Dragon Ball","img":"https:\/\/media.kitsu.io\/manga\/111\/poster_image\/large-5957036139f7bdb269cf851dceddc892.jpeg","chapterNumber":520},{"productId":112,"resume":"No synopsis has been added for this manga yet.Click here to update this information.","productName":"Waga Itoshi no Doctor","img":"https:\/\/media.kitsu.io\/manga\/112\/poster_image\/large-1d076939fb21fa402ce4b3af1db91986.jpeg","chapterNumber":6},{"productId":113,"resume":"Wimpy Sena Kobayakawa has been running away from bullies all his life. But when the football gear comes on, things change—Sena's speed and uncanny ability to elude big bullies just might give him what it takes to become a great high school football hero! Enjoy all the bone-crushing action and slapstick comedy that this heartwarming coming-of-age story has to offer. \n(Source: Viz)","productName":"Eyeshield 21","img":"https:\/\/media.kitsu.io\/manga\/113\/poster_image\/large-4ef159197fc9d6e980bbc06fcd0b6021.jpeg","chapterNumber":333},{"productId":116,"resume":"The samurai didn't stand a chance. First, the aliens invaded Japan. Next, they took all the jobs. And then they confiscated everyone's swords. So what does a hotheaded former samurai like Sakata \"Gin\" Gintoki do to make ends meet? Take any odd job that comes his way, even if it means losing his dignity.\n\n(Source: VIZ Media)\n\nIncluded one-shots:\nVolume 1: Dandelion\nVolume 2: Shirokuro\nVolume 24: 13\nVolume 38: Bankara-san ga Tooru\nVolume 41: Special Lesson.","productName":"Gintama","img":"https:\/\/media.kitsu.io\/manga\/116\/poster_image\/large-73e331420769c2f9c1252ba0cf6f2108.jpeg","chapterNumber":709},{"productId":118,"resume":"Collection of 6 oneshots:\n1) Leave Me Alone With First Love!\nLove triangle between a teacher, his student\/cousin, and the cousin's best friend.\n2) Reward of a Smile\nTwo highschool students set up an arrangement for paid rendevous, but the motivation for one isn't just sexual.\n(Also published in Gorgeous Heart)\n5) Love Rhapsody\nA photographer works on \"intensity\" with his new model.\n(Also published in Gorgeous Heart)\n6) Knight Gold\nSumiyoshi's got a problem keeping it up... so his partner tries to spice things up with a threesome.\n(Also published in Gorgeous Heart)\n(from M-U)","productName":"Love Drug","img":"https:\/\/media.kitsu.io\/manga\/118\/poster_image\/large-39cc65bd9431a3eca9d2de17d09d9311.jpeg","chapterNumber":6},{"productId":119,"resume":"Junpei Manaka sneaks up to the roof to see the sunset. When he opens the door, he startles a mysterious beauty. She panics and runs away, but before not Junpei has caught sight of her adorable strawberry print panties... in EXTREME close-up. With that vision forever burned into his memory, Junpei embarks on a quest to find the girl, and the panties, of his dreams! \n\n(Source: Viz)","productName":"Ichigo 100%","img":"https:\/\/media.kitsu.io\/manga\/119\/poster_image\/large-f5526f7f16a9c89f18e73fedd174c47e.jpeg","chapterNumber":167},{"productId":120,"resume":"Latest manga series by Moriki Takeshi.","productName":"GLIAs World's End","img":"https:\/\/media.kitsu.io\/manga\/120\/poster_image\/large-1fb7dd247ef52ac451e9678b45553042.jpeg","chapterNumber":6},{"productId":121,"resume":"According to legend, a war between the \"Kagijin\", beings of fearsome power, laid waste to the world and buried it in sand. Time moved on… and now, Chiruda Portman, a female soldier of the Gabbia Empire, has been ordered to exterminate a certain man.\nThe name of the boy is \"Tsubame\"!\nThe two meet by chance, but Chiruda senses something strange about Tsubame, who loves freedom and reading books... what is the big secret he holds!? A new-age fantasy of their adventures set in a breathtaking world!! \"\nSource: Official site of Shounen Jump","productName":"Kagijin","img":"https:\/\/media.kitsu.io\/manga\/121\/poster_image\/large-ecac26fb7a8a1c83f0617c167ffefb3e.jpeg","chapterNumber":17},{"productId":122,"resume":"Akito Hayama is the infamous God Hand, an art thief who steals only masterpieces. But these arn't your ordinary art pieces, they're actually copies made by Akito's missing mother. Akito is caught by an underground art broker and consequently learns the reason for the disappearance of his mother. In a attempt to save himself, a new found ability 'Kannade' emerges within Akito, as well as the quest to find certain art pieces by Akito's mother and what Kannade's fate really is.","productName":"Kannade","img":"https:\/\/media.kitsu.io\/manga\/122\/poster_image\/large-8c5c85988904239bea02197d3f5e52b4.jpeg","chapterNumber":15},{"productId":123,"resume":"Other series by Moriki Takeshi.","productName":"Onegai Kamisama!","img":"https:\/\/media.kitsu.io\/manga\/123\/poster_image\/large-1f14a9af94b28e796f3d78722ccf5630.jpeg","chapterNumber":30},{"productId":125,"resume":"Sawada Tsunayoshi is regular boy who has never excelled in sports, school or social life, thus being named \"No Good Tsuna\". Everyday, he leads just a normal life, living with his mother, while his father is away for work. But the thing Tsunayoshi doesn't know is that his family is actual lineage of the great Mafia Boss, the first head of Vongola, Giotto.\nBecause of the Sawada history, Tsuna has been chosen to become tenth head of the Vongola family, an infamous Italian mafia family which rules the Mafia world. To become worthy of the title, Tsuna is being aided by professional hitman and infant, Reborn, who takes the role of Tsunayoshi's mafia tutor.\n[Written by Katekyo Hitman Reborn! FC]","productName":"Katekyo Hitman Reborn!","img":"https:\/\/media.kitsu.io\/manga\/125\/poster_image\/large-95fd8b59115899df097802c9a4c9f437.jpeg","chapterNumber":409},{"productId":127,"resume":"Due to a terrible bus accident, Randoh (the main character) wakes up one day to discover he has the face of an attractive girl thanks to a rather perverted plastic surgeon. But not just any girl's face--it's the same girl that he has a crush on. To make matters even worse, he runs into the girl and she thinks it's her long-lost twin sister. When Randoh moves in with her (quite willingly) he is torn between helping out this girl by pretending to be her sister, and wanting his old face back.\n(Source: Akatsuki-Manga)","productName":"Pretty Face","img":"https:\/\/media.kitsu.io\/manga\/127\/poster_image\/large-75e551e92c9fd514dea71cd36ffbed20.jpeg","chapterNumber":53},{"productId":128,"resume":"Ryoma Echizen just joined the Seishun Academy's tennis team, which is known for being one of the most competitive teams in Japan. Its members are incredibly talented, gifted, and athletic. With rigorous and extremely intense practices, the upperclassmen of the team expect the very best from themselves and they expect even more from the new members of the team. While most of the freshmen are on pins and needles hoping they won't get cut from the team, Ryoma Echizen is confident, cool, and collected. Some might even say he's cocky, but at least he's got the skills to back up his attitude. With his virtually unreturnable \"twist serve,\" Ryoma is sure to make the starting team. Join Ryoma and the other first years, as they train hard, make friends, and try to find a place for themselves on the team. And meet Ryoma's cute but chronically shy classmate Sakuno Ryuzaki. She's got a big crush on Ryoma, but will he ever notice her? Ryoma Echizen is the Prince of Tennis. He may be ready for the Seishun Academy tennis team, but are THEY ready for HIM? \n(Source: Viz)Note: The total chapter count includes 379 chapters for the original manga and 1 chapter entitled \"Chapter 0.\"  This totals 380.  Please do not change the chapter count.","productName":"Tennis no Ouji-sama","img":"https:\/\/media.kitsu.io\/manga\/128\/poster_image\/large-ba5e68ef694ad6f7042c25ae4d298b4e.jpeg","chapterNumber":380},{"productId":129,"resume":"In ancient times, minds and spirits dwelled in all the materials on earth. At the end of a battle these minds dwelling in matter conquered the hostile matter of the enemy and mutiplied. Sacred wars gave birth to the elementalors. Fierce battles between the elementalors raged continuously in the struggle to create a new utopia.\nKagura is an elementalor reincarnated in the present. After a billion nights, the battles of the elementalors have returned... but only one can rule. Kagura's long, fiery trial is about to begin. Now! \n(Source: M-U)","productName":"Shouryou Tsukai Elementalors","img":"https:\/\/media.kitsu.io\/manga\/129\/poster_image\/large-04182b142b251d5660e575e8bb1a305e.jpeg","chapterNumber":1},{"productId":132,"resume":"Yusami, and Kurumi are in a love triangle with Sena. Yusami has been best friends with Sena for a year, and Kurumi is actually Sena's little sister.","productName":"Love Cubic","img":"https:\/\/media.kitsu.io\/manga\/132\/poster_image\/large-41a3652fde45be4460f4d9121fd36570.jpeg","chapterNumber":6},{"productId":133,"resume":"Winning isn't everything in the game of basketball, but who wants to come in second? It takes dedication and discipline to be the best, and the Shohoku High hoops team wants to be just that. They have one last year to make their captain's dream of reaching the finals come true--will they do it? Takehiko Inoue's legendary beloved basketball manga is finally here and the tale of a lifetime is in your hands.\n\nHanamichi Sakuragi's got no game with girls--none at all! It doesn't help that he's known for throwing down at a moment's notice and always coming out on top. A hopeless bruiser, he's been rejected by 50 girls in a row! All that changes when he meets the girl of his dreams, Haruko, and she's actually not afraid of him! When she introduces him to the game of basketball, his life is changed forever...\n\n(Source: VIZ)\n\nIncluded one-shot: \nVolume 31: Slam Dunk: 10 Days After","productName":"Slam Dunk","img":"https:\/\/media.kitsu.io\/manga\/133\/poster_image\/large-fa2598149a79fadd9326e681a96fc0b6.jpeg","chapterNumber":276},{"productId":134,"resume":"A rumor goes around school about an abandoned amusement park and a magician who lives there that can make someone disappear for good. Yoon Ah-ee, a girl struggling to feed her sister and herself everyday will experience her life change as she meets a mysterious magician.\n\n(Source: MU)","productName":"Annarasumanara","img":"https:\/\/media.kitsu.io\/manga\/134\/poster_image\/large-6c4989725f87a07d23c7d5a026fef950.jpeg","chapterNumber":27},{"productId":135,"resume":"Everybody has a dream, and for Sho Kazamatsuri, that dream is simple: he wants to be the best soccer player he can possibly be. He's the spirited leader of the Josui Junior High team and everyone looks up to him. In turn, he tries to keep the team together at any cost! (Source: Viz)","productName":"Whistle!","img":"https:\/\/media.kitsu.io\/manga\/135\/poster_image\/large-5409ee93c645ac78b88ac32601e9f325.jpeg","chapterNumber":216},{"productId":136,"resume":"No synopsis has been added for this manga yet.Click here to update this information.","productName":"Vaelber Saga","img":"https:\/\/media.kitsu.io\/manga\/136\/poster_image\/large-bdbe2a7978aee1c861a01d37e3adf425.jpeg","chapterNumber":33},{"productId":138,"resume":"Yusuke Urameshi was a tough teen delinquent until one selfless act changed his life...by ending it. When he died saving a little kid from a speeding car, the afterlife didn't know what to do with him, so it gave him a second chance at life. Now, Yusuke is a ghost with a mission, performing good deeds at the behest of Botan, the ferrywoman of the River Styx, and Koenma, the pacifier-sucking judge of the dead.\n(Source: Viz)","productName":"Yuu☆Yuu☆Hakusho","img":"https:\/\/media.kitsu.io\/manga\/138\/poster_image\/large-6d03d7c070357ef62fb4001db54b951e.jpeg","chapterNumber":175},{"productId":140,"resume":"10th grader Yugi spent most of his time alone playing games--until he solved the Millennium Puzzle, a mysterious Egyptian artifact! Possessed by the puzzle, Yugi becomes Yu-Gi-Oh, the King of Games, and challenges evil-doers to the Shadow Games--weird games with high stakes and high risks! These graphic novels contain new stories not seen in the anime, including the origin of Yugi and his friends!\n(Source: Viz)","productName":"Yu☆Gi☆Oh!","img":"https:\/\/media.kitsu.io\/manga\/140\/poster_image\/large-958008b55ba38845c602989cd51cf601.jpeg","chapterNumber":343},{"productId":142,"resume":"Kippei Katakura is a 17-year-old playboy who spends his time chasing girls, careless of their feelings. But when his 5-year-old cousin Yuzuyu comes to live with his family after her mother's sudden disappearance, Kippei is put in charge of taking care of her. As Kippei gets to know Yuzuyu and starts to understand how she feels, he also begins to realize that all girls were like Yuzuyu once... (Source: Viz)","productName":"Aishiteruze Baby★★","img":"https:\/\/media.kitsu.io\/manga\/142\/poster_image\/large-d43a942750525bffa67644b98e6e7d98.jpeg","chapterNumber":33},{"productId":143,"resume":"Midori moves from Tokyo to start her senior year of high school in Sendai. She saved her childhood friend Aa-chan from teasing, but the class boss, Erena, stirs up a revolt and makes her the new target. Midori can’t bear the never-ending torment and personally takes her own life. Midori gets a second chance at life, choices and revenge though. This is Momochi Reiko’s first challenge at a time warp story!\n(Source: Forbidden Garden Scans)","productName":"Tomodachi Gokko","img":"https:\/\/media.kitsu.io\/manga\/143\/poster_image\/large-326ac16babbd7528f0952b9c69847a0c.jpeg","chapterNumber":13},{"productId":144,"resume":"Hana loves the school, caramel and...drawing manga! Her speciality: Drawing romance stories! In real life, her heart beats for the cool Taro, but she's too shy to tell him...unfortunately, Marie, her rival, has decided to steal him!\n(Source: M.N.M.)","productName":"Caramel Diary","img":"https:\/\/media.kitsu.io\/manga\/144\/poster_image\/large-cafe55cf9210a0c7cf2bdf078247d1b4.jpeg","chapterNumber":5},{"productId":146,"resume":"No synopsis has been added for this manga yet.Click here to update this information.","productName":"Kaitai","img":"https:\/\/media.kitsu.io\/manga\/146\/poster_image\/large-1f41b729115048ccbbc29f51cfefe20d.jpeg","chapterNumber":3},{"productId":147,"resume":"Japanese-American track-and-field star Mizuki has gotten herself to transfer to a high school in Japan...but not just any school! To be close to her idol, high jumper Izumi Sano, she's going to an all-guys' high school...and disguising herself as a boy! But as fate would have it, they're more than classmates...they're roommates! Now, Mizuki must keep her secret in the classroom, the locker room, and her own bedroom. And her classmates—and the school nurse—must cope with a new transfer student who may make them question their own orientation...\n\n(Source: VIZ Media)\n\nIncluded one-shots:\nVolume 1: Natsu no Ori (The Cage of Summer)\nVolume 4: Kawaki no Tsuki (The Thirsty Moon)","productName":"Hanazakari no Kimitachi e","img":"https:\/\/media.kitsu.io\/manga\/147\/poster_image\/large-2e276803141baaca8816555bdc3e6b5e.jpeg","chapterNumber":148},{"productId":148,"resume":"Yuika Aoi has a recurring nightmare in which she isn’t able to save a mysterious, green-eyed man called Rei. Her elderly grandmother, who was born in the Taisho era, lives very traditionally, and at times seems to have magical powers. Apart from all this, she is a normal high school girl until she falls off a roof and into the Taisho era, in the middle of a battle between Rei and a fairy. Will she be able to save him this time?\n(Source: Doko Demo Doa Manga Scanlations)","productName":"Seirei Gakusha Kidan Reikyou Kaden","img":"https:\/\/media.kitsu.io\/manga\/148\/poster_image\/large-521b64b12719d3e9bb8da76cb776fd03.jpeg","chapterNumber":9},{"productId":149,"resume":"A young lady about to make her debut into society is devastated to learn that her tutor will be dismissed at the same time.\n(Source: MU)","productName":"Koi Otome no Nandai Shitsumon","img":"https:\/\/media.kitsu.io\/manga\/149\/poster_image\/large-798cb3b4ceb5dbab2d1c945a9c4599ef.jpeg","chapterNumber":1},{"productId":150,"resume":"Makoto Amano wants to become an actor, but his stern father has decreed that the only way Makoto can pursue his dream is to spend the last two years of high school as a girl! He quickly makes friends with popular tomboy Ito Miura, another drama enthusiast at this new high school and the only student to find out his secret--but are they more than pals?\n(Source: Viz)","productName":"W-Juliet","img":"https:\/\/media.kitsu.io\/manga\/150\/poster_image\/large-179a10a139319b6cd7665a18118c5ddd.jpeg","chapterNumber":79},{"productId":152,"resume":"A world where mankind has become an endangered species.  On a planet well known as \"Flickle\" resides a single human girl, Minii, who lives among the world of robots. One day she encounters a human prince and his guardian who falls from the sky.","productName":"Ascribe to Heaven","img":"https:\/\/media.kitsu.io\/manga\/152\/poster_image\/large-22470bfb787f4776dd801ca58100d600.jpeg","chapterNumber":3},{"productId":153,"resume":"One day, as Suzuri was walking past a river, she suddenly saw a HUGE peach slowly flowing! Due to the fact she has not eaten since the start of her journey, she decided to just conclude the huge peach was a god sent and did the most logical thing anyone would have done - eat it. However, just as she had her first bite, a young male jumps out of the peach! And before Suzuri knows it, she’s the 18th master to Momo who could do anything that Suzuri commands! What kind of danger would they encounter on their journey as they face a god that goes by the name Kyuui? And what dark secret does Momo have!?\n(Source: Sakura-Crisis)","productName":"√W.P.B.","img":"https:\/\/media.kitsu.io\/manga\/153\/poster_image\/large-0eb12b24e240077cd9994a6cdcea1ed8.jpeg","chapterNumber":12},{"productId":154,"resume":"Taki Kanon and Nakamori Ryou met through a piano in their first year of high school. Nakamori played video game songs beautifully, while Taki's talent lay in piano tuning. They were in the same class, and they spent a lot of time together at a piano. But shyness and misunderstanding plagued the formation of a more serious relationship. Over the years, will they be able to find a way to make the paths of their lives finally converge? [tethysdust].\n(Source: Mangahelpers)","productName":"Zettai Donkan","img":"https:\/\/media.kitsu.io\/manga\/154\/poster_image\/large-9faa0e1b6c9f1f803d48609f0c77d43d.jpeg","chapterNumber":3},{"productId":156,"resume":"A spin-off manga with Minko Tsurugi as the main character.","productName":"Hanasaku Iroha: Green Girls Graffiti","img":"https:\/\/media.kitsu.io\/manga\/156\/poster_image\/large-724b8139858ead874e11b293a4545843.jpeg","chapterNumber":11},{"productId":157,"resume":"Jiggy and Maggy, a single soul for two bodies, when the one wakes up the other one falls asleep but they remain bound by their five senses.\nThey live then surprising experiences and disturbing emotions...\n(source : Taifu comics)","productName":"½","img":"https:\/\/media.kitsu.io\/manga\/157\/poster_image\/large-826b16efe0df58e29b4d12bc4af4d802.jpeg","chapterNumber":19},{"productId":158,"resume":"π is the ratio of a circle's circumference to the diameter of the oppai (breast) which contains the word pai, the romanized form of pi in Japanese. It's a story of a man obsessed with breasts. (Source: B-U Manga)","productName":"π","img":"https:\/\/media.kitsu.io\/manga\/158\/poster_image\/large-7dd90e307f4fdac224f972d82c8a13cd.jpeg","chapterNumber":101},{"productId":159,"resume":"1-2. Student's Request Teacher's Duty\n3, Sakase! Takae no Hana\n4. Honey Happy Baby\n5. Voice Box\n6. Scandal Kiss\n7. The View Through the Lens","productName":"Seito no Shucho Kyoushi no Honbun","img":"https:\/\/media.kitsu.io\/manga\/159\/poster_image\/large-6c47cdcae1c21b4e1f3dd4317539c887.jpeg","chapterNumber":7},{"productId":160,"resume":"A short shoujo story about a girl who wants to continue the family tradition of her family...that is, get married at 16 and have a girl child at 17. A very crazy story about a very crazy girl named Ren who falls in love with one of the most popular boys in school, Juuya, at first sight... (Source: ANN)","productName":"± Junkie","img":"https:\/\/media.kitsu.io\/manga\/160\/poster_image\/large-1ccb1533ae8578d15d3e1d0e31db1acd.jpeg","chapterNumber":4},{"productId":161,"resume":"Aruto Kashiwayama is a budding pianist. She lodges at a famous conductor's house. Aruto's relationships with the conductor's son Hokuto and her first love Masaru are revealed. (Source: MU)","productName":"\"Aruto\" no \"A\"","img":"https:\/\/media.kitsu.io\/manga\/161\/poster_image\/large-4eb276eec909ed90d489f4fdbad9edec.jpeg","chapterNumber":2},{"productId":162,"resume":"Ema is obsessed with ghosts, and is even part of her school's occult club. She'll do anything that has to do with some crazy superstition about ghosts or spirits, and make sure that she goes out of her way to do it. Ema is known for this at school, and the series follows her pursues to find ghosts. Ema, unfortunately, cannot see the things that she loves, unlike a few of her friends...\n(Source: StarryHeaven) Included one-shots:\nVolume 1: Shuugaku Ryoko no Susume\nVolume 3: Time Capsule and Happy End no Tsukurikata","productName":"13 Nichi wa Kinyoubi?","img":"https:\/\/media.kitsu.io\/manga\/162\/poster_image\/large-dfe77a89d8cab0c0f8762d6ef4ad1e93.jpeg","chapterNumber":15},{"productId":165,"resume":"A collection of short stories revolving around a girl's first time!\n1. A Boy's Suggestion, by Shinjo Mayu\n2. Virgin Beast, by Minami Kanan\n3. Become Daring, by Ayukawa Mio\n4. When I'm with You, I Won't Be Home 'til Morning!, by Kousaka Yuuka\n5. The Awakening of Love, by Sakurai Miya\n6. Smooch Smooch Smooch, by Masuzaki Yoshino\n7. Sweet Desires, by Shigano Iori","productName":"17-sai: Hajimete no H","img":"https:\/\/media.kitsu.io\/manga\/165\/poster_image\/large-82c990953dcbaf69d0f3b611d9b575cf.jpeg","chapterNumber":7},{"productId":167,"resume":"Shinobu is the only girl that goes to the secret Ninja Academy, which is presided over by a strange, yellow, ball-organism, Onsokumaru. While he knows nothing about being a ninja master, he loses no opportunity to exploit the dim but cute Shinobu. On a mission to steal all the panties from area high school girls, Shinobu meets Kaede who gets drawn into the surreal, ecchi, but fun world of Shinobu.\n(Source: ANN)","productName":"Ninin ga Shinobuden","img":"https:\/\/media.kitsu.io\/manga\/167\/poster_image\/large-6ee363d089481fc2090fe0de29ead8aa.jpeg","chapterNumber":68},{"productId":170,"resume":"A collection of short stories that look to mankind's exploration of space, and examine the possibilities that we could face when we decide to take those first fateful steps into the unknown.\n(Source: MU)","productName":"2001-ya Monogatari","img":"https:\/\/media.kitsu.io\/manga\/170\/poster_image\/large-f7d9e66eed01ff14610a3091851a7c60.jpeg","chapterNumber":20},{"productId":171,"resume":"A novel series that tells the story of a Long Arm named Carl, of what happened to Sora after he was trapped in The World by Morganna, and of Tsukasa's real life after being able to log out from The World.","productName":".hack\/\/Zero","img":"https:\/\/media.kitsu.io\/manga\/171\/poster_image\/large-3f710705f2386ff1b54cbcb3cd1cce72.jpeg","chapterNumber":2},{"productId":173,"resume":"By all the usual measures, he could be considered a pretty useless guy: a scholastic failure, an athletic disaster, and a chronic loser... But Fukuda Shinichi has one passion: cheering for others! The 18-year-old captain of North Kanto Southern High's Cheerleading squad decides to make the most of his summer by attending cram school in Tokyo, only to find out that the whole trip was a sham! Things are looking up when he and his friend meet up with two cute Tokyo girls; too bad the girls brought them to a rip-off bar and took off! Ditched by his one remaining friend and stuck with an impossibly high bar bill, Fuku-kun's life couldn't get any worse! But just then he gets saved by Ume, his role model and former cheerleading squad captain! What is he doing in Tokyo... and why does everyone around seem to know and respect him? Without anywhere else to go, Fuku-kun decides follow Ume to his job, only to discover that... he's a host?!? Fukuda's summer of cheering others on has begun... and the streets of Tokyo's red-light district will never be the same!\n\n(Source: Mangadex)","productName":"3.3.7 Byooshi!!","img":"https:\/\/media.kitsu.io\/manga\/173\/poster_image\/large-8b330c28b3414386f64c7b15faf38e87.jpeg","chapterNumber":86},{"productId":174,"resume":"Ever wonder what Yaoi-Con is like from a mangaka's point of view? In 2011, BL mangaka Fusanosuke Inariya attended Yaoi-Con as a guest of honor. Read this manga style report about her personal experiences on what she saw and how she felt. There's plenty of fun as East meets West in this fujoshi fueled article!\n(Source: DMG)","productName":"Yaoi-Con 2011 Report","img":"https:\/\/media.kitsu.io\/manga\/174\/poster_image\/large-8fbcdabf95a0b1b6a37aed73466ad18f.jpeg","chapterNumber":1},{"productId":175,"resume":"It is the 10th Century.\nthe story is laid in so many ghost spirit and supernatural being\"mononoke\" was wander a ancient capital \"Heian-kyo\".\nThere were two men in the Heian-kyo. the Great Onmyoji \"Abe Seimei\". and nobleman \"Minamoto Hiromasa\"blest by the Spirit of Music.\ntwo protagonist meets .....","productName":"Onmyouji","img":"https:\/\/media.kitsu.io\/manga\/175\/poster_image\/large-aae0359abac28a8ea93199b14549c64d.jpeg","chapterNumber":112},{"productId":176,"resume":"Shiina has 2 secrets. She loves her brother Kiri a lot, and Kiri doesn't know that they are not blood related. She doesn't know what to do, she's been hiding it for a long time, and no one knows she loves him.\n(Source: MangaFox)","productName":"\"Suki\" to Ienai.","img":"https:\/\/media.kitsu.io\/manga\/176\/poster_image\/large-09aab763249d2a0d9edeab1e520d86cf.jpeg","chapterNumber":1},{"productId":177,"resume":"No synopsis has been added for this manga yet.Click here to update this information.","productName":"Pocho Mukin","img":"https:\/\/media.kitsu.io\/manga\/177\/poster_image\/large-3a2983d32d641db58ae0c9b081df59db.jpeg","chapterNumber":28},{"productId":178,"resume":"Rumors stir throughout the land: when the wielder of the black sword draws his dark blade, all who stand in its path are torn asunder…! Köinzell, the mysterious young boy who carries the black sword, undeniably wields it with exceptional skill, but can he truly be responsible for the bloody rumors? Pursued by the Traitorous Lances, four powerful warriors who were thought to have been defeated by the Seven Heroes, the strength of the young swordsman will be tested to its limit. At battle’s end, only the shocking truth of Köinzell’s quest will stand above the corpses of his enemies…\n\nAn epic fantasy on the grandest of scales!\n\n(Source: Yen Press)","productName":"Übel Blatt","img":"https:\/\/media.kitsu.io\/manga\/178\/poster_image\/large-0269e3f843e63d652237ba695ddb5070.jpeg","chapterNumber":167},{"productId":180,"resume":"The story revolves around the main character Higasa Sachi. She's the ideal student who puts on a refined and dignified persona while excelling at sports and academics. She is respected and admired by her peers and teachers alike. \nSachi who cares about appearance can not stand Alice Toyozaki who is a hard core otaku that makes no effort in hiding her love for it. Sachi (who is secretly a budding manga artist) can not understand why Alice puts much effort into drawing manga herself when she has no talent for it, but one day after Alice is picked on by a bully...","productName":"Manken.","img":"https:\/\/media.kitsu.io\/manga\/180\/poster_image\/large-37ef55154ced33d0100a706bfd9a90d3.jpeg","chapterNumber":42},{"productId":181,"resume":"Rejected way too many times by good-looking (and unattainable) guys, shy Riiko Izawa goes online and signs up for a free trial of a mysterious Nightly Lover \"figure.\" The very next day a cute naked guy is delivered to her door, and he wants to be her boyfriend! Has Riiko died and gone to heaven? The cute guy turns out to be sweet, smart, a great cook, and lots more. And he looks like a million bucks, which is what he's going to cost Riiko if she doesn't return him in time... \n(Source: Viz) Included one-shots:\nVolume 6: I Won't Let You Become a Star! and Aromatic Boy","productName":"Zettai Kareshi.","img":"https:\/\/media.kitsu.io\/manga\/181\/poster_image\/large-7de582c6d04a1a4f0fd22824f8805b6b.jpeg","chapterNumber":35},{"productId":182,"resume":"No synopsis has been added for this manga yet.Click here to update this information.","productName":"Ame-iro no Ibasho","img":"https:\/\/media.kitsu.io\/manga\/182\/poster_image\/large-35da4897c12a19e7629f25de840e73ea.jpeg","chapterNumber":1}]