[{"productId":2,"resume":"When Kousei Matsumoto finds a a man apparently suffering from heatstroke alone out on the street, he takes him despite his better judgement. The young man is a mystery with a scar he won't explain, and the only clue to his past is the whispered name “Mori.” Despite this, Kousei finds his heart becoming entangled, and the pair forge a fragile relationship. When the past literally comes knocking at his door and the truth of the young man's true identity comes out, Kousei comes to a decision that literally tears the pair apart. But is it the right choice, and can the lonely, waif-like stray face his past and forge a future that includes Kousei?\n(Source Digital Manga)","productName":"Boku no Mune ga Itakutemo - Glass","img":"https:\/\/media.kitsu.io\/manga\/2\/poster_image\/large-d3fd8ae93e6621deb2f46dc66aaec749.jpeg","chapterNumber":4},{"productId":4,"resume":"Dr. Kenzo Tenma is a renowned young brain surgeon of Japanese descent working in Europe. Highly lauded by his peers as one of the great young minds that will revolutionize the field, he is blessed with a beautiful fiancé and is on the cusp of a high promotion in the hospital he works at. However, all of that is about to change with one critical decision that Dr. Tenma faces one night – whether to save the life of a young child or that of the town's mayor. Despite being pressured by his superiors to perform surgery on the mayor, his morals force him to perform the surgery on the young child, saving his life and forfeiting the mayor’s. All of a sudden, Dr. Tenma’s world is turned upside down by his decision leading to the loss of everything he previously had. A doctor is taught to believe that all life is equal; however, when a series of murders occur in the vicinity of Dr. Tenma, all of the evidence pointing to the young child who he saved, Tenma’s beliefs are shaken.\nNaoki Urasawa’s Monster is a tale full of mystery, suspense and intrigue as Dr. Tenma journeys to find out the true identity of the young child. In turn, the fate of the world may depend on it.\n\n(Source: MAL Rewrite)","productName":"Monster","img":"https:\/\/media.kitsu.io\/manga\/4\/poster_image\/large-3f0e9ec4311eaee738694f741d40730b.jpeg","chapterNumber":162},{"productId":6,"resume":"Collection of oneshots:\n1) Pink Sweets\n2) Story of Bishounen Love\n3) Cats &amp; Aprons\n5) Strawberry on the Shortcake","productName":"Renai Soukanzu","img":"https:\/\/media.kitsu.io\/manga\/6\/poster_image\/large-136b19305c8f19dc64d9c9213f5b0943.jpeg","chapterNumber":7},{"productId":9,"resume":"Collection of 5 one shots:\n- Anata e no Tsuki (Moon for You)\n- Kataomoi no Sono Saki (Beyond A One-Sided Love)\n- 7-ho-me no Mirai\n- Kare ga Kanojo ni Nozomu Mono (What He Expects of Her)\n- Spring.","productName":"Anata e no Tsuki","img":"https:\/\/media.kitsu.io\/manga\/9\/poster_image\/large-e4865bfdec71cd3a0db5c26bc8329e0b.jpeg","chapterNumber":5},{"productId":12,"resume":"Humanity, having faced extinction at the end of the 20th century, would not have entered the new millennium if it weren't for them. In 1969, during their youth, they created a symbol. In 1997, as the coming disaster slowly starts to unfold, that symbol returns. This is the story of a group of boys who try to save the world.\n\nFor Kenji, a simple convenience store manager who once dreamed of becoming a rock 'n' roll musician, a host of memories from his past come rushing back when one of his childhood friends mysteriously commits suicide. Could this new death be related to the rise of a bizarre new cult that's been implicated in several other murders and disappearances? Determined to dig deeper, Kenji reunites with some of his old buddies in the hope of learning the truth behind it all.\n\n(Source: Viz)","productName":"20th Century Boys","img":"pas d'image","chapterNumber":249},{"productId":15,"resume":"In a school where after school activities are mandatory among all students, Hajime and her friend Sayo come across a new club that they have never seen before. The club is called \"The Cultural Activity Preservation Club.\" The two enter the room to find all kinds of analog jobs and activities, such as handcrafting mats and toothpicks. This is a unique cultural manga mixed with comedy so as not to bore you, this is Double J!\n(Source: Mangahelpers)","productName":"Double-J","img":"https:\/\/media.kitsu.io\/manga\/15\/poster_image\/large-13c4926a75f7a0adf943a5ef37254355.jpeg","chapterNumber":106},{"productId":16,"resume":"A 4koma spin-off comic of Umineko no Naku Koro ni following the witches, where Lambdadelta decides to move in with Beatrice and Battler.","productName":"Umineko no Naku Party ni: Tea Party of the Witches","img":"https:\/\/media.kitsu.io\/manga\/16\/poster_image\/large-be594094ec3411ed2eaffa405752d6fc.jpeg","chapterNumber":3},{"productId":17,"resume":"Set in a post-apocalyptic Japan of the near future where the sea level has risen and flooded much of the coastal areas and Mt. Fuji has erupted within living memory. The population has been considerably reduced and political and technological institutions have broken-down. Local communities have become nations and telephone and television no longer exist (although coffee vending machines and streetlights stubbornly continue to work). There are strange new animals and plants (like flying fish and glowing streetlight trees). The remaining people have adopted a slower-paced, simpler way of life and rely more on each other. Along with the human population are some intelligent, humanoid robots. One of the robots, a female named Alpha, runs a cafe by the same name in the country outside of what remains of Yokohama. With her trusty motorscooter and her camera she travels around the area making friends with the humans and robots, having new experiences and observing the passage of time.\n\nNote: Includes the epilogue, Touge, published with the 10 volume re-issue. Chapter count also includes 'Chapter 0' from volume 1.","productName":"Yokohama Kaidashi Kikou","img":"https:\/\/media.kitsu.io\/manga\/17\/poster_image\/large-0f16e69ae6d408f61bb23214340fbb6a.jpeg","chapterNumber":142},{"productId":18,"resume":"Shinichi works as a mangaka's assistant while trying to get published himself, but his determination falters when his father gets remarried…to a teacher Shinichi had a crush on years ago and who was the inspiration for his first manga. If he gives up on his hopeless crush, will he still find inspiration for drawing?","productName":"Fushou no Musuko","img":"https:\/\/media.kitsu.io\/manga\/18\/poster_image\/large-538ad339fbf883aca26eeb777d7193e2.jpeg","chapterNumber":1},{"productId":19,"resume":"The \"Fuji-san,\" Mount Fuji, is a national symbol for the Japanese: the volcanic mountain snowfall is a symbol of strength and wisdom. Akira Saso relate by a collection of short stories linked by a common theme: the emergence of this giant majestic systematic, disrupting the lives of characters stuck in random existences.","productName":"Fujisan","img":"https:\/\/media.kitsu.io\/manga\/19\/poster_image\/large-6969f551bb9f5f69b5539bc6820361e1.jpeg","chapterNumber":7},{"productId":22,"resume":"Kei is a high-school student bullied daily and none of his fellow classmates care. Worn down by those endless humiliations, he accepts the strange proposal of his childhood friend Akira : Suicide together to end this nightmare. But that day, Kei survives and Akira doesn't.\nMonths later, the young man is shocked when he discovers on the net a website about street fighting. On several videos put online, a barely recognizable Akira gives a major beatdown to his opponents! What really happened? To discover the truth, Kei has only one solution: registering on that site and go from fight to fight to find the truth about Akira... \n(Source: SRoMU)","productName":"Gekiryuuchi","img":"https:\/\/media.kitsu.io\/manga\/22\/poster_image\/large-e13cdcd1f8f4ec48d7ec5d6a6aa9ac56.jpeg","chapterNumber":25},{"productId":24,"resume":"12-year-old Mitsuki wants to be a singer because of a promise she made with her childhood love, however a form of throat cancer is holding her back. One day she find two strange characters in her room, Takuto and Meroko, who are gods of death. She finds out she only has a certain amount of time to live, and wants nothing more in that time then to become a singer. The two shinigami show sympathy for her, and decide to help her reach her goal by transforming her into a 16-year-old girl. \n(Source: ANN)Included one-shot:\nVolume 2: Ginyuu Meika","productName":"Full Moon wo Sagashite","img":"https:\/\/media.kitsu.io\/manga\/24\/poster_image\/large-12ff76b999e63f065b9bc4220d3b8c19.jpeg","chapterNumber":30},{"productId":29,"resume":"A childhood dream has led Ha Min to work as a conductor for Pidgeon-ho, a slow-train in a backwater country. But the life of the slow-train is unexpectedly ending and Ha Min must transfer to another train in the city. People in the new railroad are different and he soon realizes that there are some things in the slow-train to be missed. On a closer look though, Ha Min discovers that not all is bad, and maybe his dream is nearer than he thinks...\nThe train is carrying people’s dreams of leaving. Being the conductor of the Galaxy Railway 999 was Hamin’s dream. When he made it, he received the first speed of 70km per hour local train. There, There they go slow as the slow speed time to train people is to appreciate. Hamin finally gets to move up with new colleagues that have weird personalities like the horror mania conductor, Young-Ji Jo and even the food mania, Jo Seung-woo.","productName":"Railroad","img":"https:\/\/media.kitsu.io\/manga\/29\/poster_image\/large-dc74f454e818ef0b2d1c2facb8553f22.jpeg","chapterNumber":14},{"productId":30,"resume":"Noel Christonbel is Santa Claus no. 29. He and his reindeer, Rudolf (in human form) visit children on Christmas day and give them presents - whatever they ask for. However, what happens when one of the children they meet doesn't want anything... and instead feels he should die? \n(Source: MangaUpdates)","productName":"Noel la Neige","img":"https:\/\/media.kitsu.io\/manga\/30\/poster_image\/large-bdd8e705f0741d723a690de1fbc115f6.jpeg","chapterNumber":1},{"productId":31,"resume":"A young man called Ryu wakes up in a space ship and discovers that the hostile planet inhabited by monsters he has landed upon is actually Earth.\nThis manga is about him traveling in order to find civilization.","productName":"Ryuu no Michi","img":"https:\/\/media.kitsu.io\/manga\/31\/poster_image\/large-35243eb5830950d96538343a44a8c728.jpeg","chapterNumber":28},{"productId":37,"resume":"Ichigo Kurosaki has always been able to see ghosts, but this ability doesn't change his life nearly as much as his close encounter with Rukia Kuchiki, a Soul Reaper and member of the mysterious Soul Society. While fighting a Hollow, an evil spirit that preys on humans who display psychic energy, Rukia attempts to lend Ichigo some of her powers so that he can save his family; but much to her surprise, Ichigo absorbs every last drop of her energy. Now a full-fledged Soul Reaper himself, Ichigo quickly learns that the world he inhabits is one full of dangerous spirits and, along with Rukia—who is slowly regaining her powers—it's Ichigo's job to protect the innocent from Hollows and help the spirits themselves find peace.\n\n(Source: ANN)\n\nNote: Chapter count includes the following 19 extra chapters.\n\nVolume 10 contains chapter 88.5 \"Karakura Super Heroes.\" --not included in the count.\nVolume 12 contains chapter 0.8 \"A Wonderful Error.\"\nVolume 15 contains chapter -17 \"Soreyuku Hoshiboshi no Tame no Zensoukyoku\" (逸れゆく星々の為の前奏曲, Prelude for the Straying Stars).\nVolume 20 contains chapter -12.5 \"Blooming Under a Cold Moon.\"\nVolume 23 contains the two-part chapter 0 \"Side-A The Sand\" and \"Side-B The Rotator.\"\nVolume 32 contains chapter -16 \"Hyougen ni Shisu\" (氷原に死す, Dying in the Ice Fields).\nVolume 36 consists of chapters -108 to -100 \"Turn Back the Pendulum.\"\nVolume 37 contains chapters -99 to -97 \"Turn Back the Pendulum\" and \"Let Stop the Pendulum.\"\nVolume 70 contains chapter 520.5 \"Walk Under Two Letters\" (520.5 WALK UNDER TWO LETTERS).\n\nTotal chapter count is 705.","productName":"Bleach","img":"https:\/\/media.kitsu.io\/manga\/37\/poster_image\/large-4f4237a25573f67e17c7b69e33767ed2.jpeg","chapterNumber":705},{"productId":40,"resume":"The Continent of Song is in chaos. The sinister secret society known as Demon Card is using the power of Dark Bring to destroy everything in their path. The only things capable of stopping Dark Bring are the Rave stones. Unfortunately, the Rave Stones were scattered around the globe in an explosion 50 years ago, so now they must be collected by the Rave Master in order to stop Dark Bring once and for all. This new task has been given to Haru Glory; a sixteen-year-old boy from Garage Island. The World's fate now rests on the new, young Rave Master. (Source: Tokyopop)Note: The total chapter count includes the original 296 chapters for the actual manga, plus 2 additional chapters: a special chapter entitled RAVE007 and an epilogue chapter, totaling 298.  Please do not change the chapter count.","productName":"Rave","img":"https:\/\/media.kitsu.io\/manga\/40\/poster_image\/large-bcf33e19d54c25eac27f94ba8db7bf9b.jpeg","chapterNumber":298},{"productId":42,"resume":"This volume includes one longer story and two shorter stories.","productName":"Hisureba Shitsuji","img":"https:\/\/media.kitsu.io\/manga\/42\/poster_image\/large-5d44318321d7d015bbaa07280ed93d43.jpeg","chapterNumber":8},{"productId":44,"resume":"Negi Springfield, a 10-year-old wizard who recently graduated from Merdiana Magic Academy in Wales, hopes to achieve two things—to find his missing father, who was once known as the Thousand Master, and to become a Magister Magi, someone who helps the everyday world through magic. To reach his latter goal, he is assigned one last task: to teach English at a middle school in Japan.\n\nMuch to his surprise and dismay, he not only discovers that his homeroom class consists of 31 girls, but also ends up revealing his true identity as a magician to Asuna Kagurazaka, one of his new students. Negi must now negotiate with the girl and face his most difficult challenge yet—to keep his identity a secret as he tackles magical threats both from within and outside of Mahora Academy, all the while keeping a watchful eye out for his lost father.\n\n[Written by MAL Rewrite]","productName":"Mahou Sensei Negima!","img":"https:\/\/media.kitsu.io\/manga\/44\/poster_image\/large-cf932fec94b1bf832e3a8bdc9f0803d5.jpeg","chapterNumber":355},{"productId":47,"resume":"Keitaro has had great difficulty getting into the university of his choice and no luck in meeting women. In a desperate effort to go into seclusion and study for his entrance exams, he volunteers to take over running his grandmother's hotel. His plans are ruined when he discovers that the \"hotel\" is actually an all-girls dormitory ... and some serious distractions ensue.\n(Source: Tokyopop)","productName":"Love Hina","img":"https:\/\/media.kitsu.io\/manga\/47\/poster_image\/large-4d6784a9c9264d954e1a0a26ae5f18bd.jpeg","chapterNumber":120},{"productId":48,"resume":"Side story from Gosick.","productName":"Gosick W","img":"https:\/\/media.kitsu.io\/manga\/48\/poster_image\/large-44d173565cb03e19916f128c48af76bd.jpeg","chapterNumber":12},{"productId":49,"resume":"Kanda Takashi immediately falls for his beautiful superior, Tokishima Azusa, the moment he lays eyes on him. Although he is undeniably infatuated, Kanda refuses to hope that his impossible crush will be reciprocated. Intending to drown his sorrows, Kanda organizes a night out with a friend and somehow stumbles upon an incredible secret being kept by Tokishima.\n(Source: Blissful Sin)","productName":"Hot Closet","img":"https:\/\/media.kitsu.io\/manga\/49\/poster_image\/large-da825594ce57f78c7515510884bfa5ac.jpeg","chapterNumber":1},{"productId":50,"resume":"Yukino Miyazawa is the perfect model student. Pretty, kind, good at sports, always at the top of her class. But she's not all that she seems. It's all an act of deception; she is really the self-confessed 'queen of vanity,' and her only goal in life is winning the praise and admiration of everyone around her.\nWhen she enters high school, she finally meets her match: Souichirou Arima, a handsome, athletic, popular, and very intelligent young boy. Ever since he stole the top seat in the class from her, Yukino has hated him, and has been plotting on how to take back her former place as the object of all other students' admiration.\nWhat she wasn't expecting, however, was that Souichirou, the very boy she hated, would confess his love for her. Or that he would find out about her deception - and use it to blackmail her!\nTogether, they discover that they have more in common than they knew, and they slowly begin to bring out each other's inner selves.\nAlso included are the following short stories:\nVol.1: The Tiger and the Chameleon - A Promise for One Week\nVol.4: Ashita Mata Mori de Aou ne (Meet Me Again Tomorrow in the Forest)\nAlways an outcast because of her black hair the heroine of the story finds a strange man in the forest - a man from Earth - and he has black hair, too!\n(Source: MU)","productName":"Kareshi Kanojo no Jijou","img":"https:\/\/media.kitsu.io\/manga\/50\/poster_image\/large-b3e7d0a0c0724804a2b6fc72606ac307.jpeg","chapterNumber":103},{"productId":51,"resume":"Twenty-nine-year-old Mikita Ryuuji has been hiding his love for his friend Koya for so long that he can't take it anymore. At his wit's end, he spends one night with Sudo, a man he met at a bar. It was supposed to be a one-night stand, an event he'd forget about the next day with someone he'd never see again. But when Sudo does show up again, this time determined to stay for good, Mikita's life starts to fall apart...\n(Source: Storm in Heaven)","productName":"Illumination","img":"https:\/\/media.kitsu.io\/manga\/51\/poster_image\/large-f33538b508306f77290f2494aa56a2e4.jpeg","chapterNumber":7},{"productId":52,"resume":"Sana Kurata, a child actress, faces many problems in her classroom, including a major one - her bullying classmate, Akito Hayama. Sana's outgoing and friendly nature leads her to work towards correcting all of the problems around her. Her 'meddling' irritates Hayama but at the same time captivates him, just as Hayama's gloomy nature irritates Sana and compels her to change him. As these two opposites attract each other, they face many hardships which bring them closer to a mutual understanding. (Source: ANN)","productName":"Kodomo no Omocha","img":"https:\/\/media.kitsu.io\/manga\/52\/poster_image\/large-1ecd6f38110cbc81dc7a25d75b8c59bf.jpeg","chapterNumber":54},{"productId":53,"resume":"Blonde, hip, pragmatic and cool, Ginji Amano has the power to generate currents with his body like an electric eel. Brunette, equally hip, bespectacled and rambunctious, Ban Mido has the mystically mysterious 'Evil Eye,' the power to create illusions in the minds of his foes. Together, they are the GetBackers, the best retrieval team in the world. They can get back anything taken from clients, and their success rate is (almost) 100%! However, first they have to get some clients--and soon--or this spry detective duo will starve on the streets!\n(Source: Tokyopop)","productName":"GetBackers","img":"https:\/\/media.kitsu.io\/manga\/53\/poster_image\/large-49f752b8224fa0d73af9c43074a31f20.jpeg","chapterNumber":344},{"productId":56,"resume":"After stumbling across a haunted Go board, irresponsible Hikaru Shindo discovers that the spirit of a master player has taken up residence in his consciousness. In his pursuit of the \"Divine Move,\" Fujiwara-no-Sai awakens in Hikaru an untapped interest and genius for the game, and soon the schoolboy is chasing his own dream--defeating the famed Go prodigy Akira Toya!\n(Source: Viz)Note: There are 197 chapters total in the original release.","productName":"Hikaru no Go","img":"https:\/\/media.kitsu.io\/manga\/56\/poster_image\/large-11e2524290d1e20221f75d501706d9c5.jpeg","chapterNumber":197},{"productId":57,"resume":"Light Yagami is a brilliant 17-year-old student, one of the top scorers on his exams in all of Japan. One day as he leaves school, he finds a mysterious black notebook on the ground with \"Death Note\" written on it. The first thing written inside: \"The human whose name is written in the notebook shall die.\" Light decides to use this to cleanse the world of evil by killing all the criminals. On the scene comes L, ace detective, who's determined to find Light—who the world now calls \"Kira\"—and track him down, thus bringing us an epic psychological thrill ride.","productName":"Death Note","img":"https:\/\/media.kitsu.io\/manga\/57\/poster_image\/large-c45932b7d7e5981ad4afb466befd7434.jpeg","chapterNumber":108},{"productId":58,"resume":"Mankind is near extinct due to the rebellion of a slave species that they created. This story follows one of the last humans, Yakumo, as she travels to find Center, hoping to unite the humans living there in peace with the Matrixer.","productName":"Mushrambo","img":"https:\/\/media.kitsu.io\/manga\/58\/poster_image\/large-ca095778a1529b571d98f318d4e9a272.jpeg","chapterNumber":8},{"productId":61,"resume":"No synopsis has been added for this manga yet.Click here to update this information.","productName":"Get!","img":"https:\/\/media.kitsu.io\/manga\/61\/poster_image\/large-1c6771e2fcd0780a0733c46663fa9985.jpeg","chapterNumber":9},{"productId":62,"resume":"In China, there lies a famous training springs, a place where martial artists can hone their skills to great levels. Unfortunately, the springs are also cursed! Teenage martial artist Ranma falls into the \"spring of drowned girl\" and now changes into a woman every time he's splashed with cold water. That doesn't stop his father from engaging him to Akane, the daughter of an old friend and a tough girl who has better thing to do than worry about boys. But Akane isn't the only girl who has a chance for Ranma's affections -- two other girls have also been betrothed to him. But Ranma has better things to do than worry about his love life -- such as making a plethora of crazy rivals and even more suitors!","productName":"Ranma ½","img":"https:\/\/media.kitsu.io\/manga\/62\/poster_image\/large-16d211398bdb5644b0c94f34a4ec8275.jpeg","chapterNumber":407},{"productId":66,"resume":"In an alchemical ritual gone wrong, Edward Elric lost his arm and his leg, and his brother Alphonse became nothing but a soul in a suit of armor. Equipped with mechanical \"auto-mail\" limbs, Edward becomes a state alchemist, seeking the one thing that can restore his brother and himself... the legendary Philosopher's Stone.\n\nWon the 49th Shogakukan Manga Award in the Shounen category.\nWon the 15th Tezuka Osamu Cultural Award New Artist Prize.\nWon the Eagle Award's \"Favourite Manga\" in 2010\/2011.\nWon the Seiun Award for best science fiction comic in 2011.","productName":"Fullmetal Alchemist","img":"https:\/\/media.kitsu.io\/manga\/66\/poster_image\/large-1dbec771ad51716858f0388bfc6018ac.jpeg","chapterNumber":116},{"productId":67,"resume":"A collection of 4 Short Stories from the author Aoi Makino featuring adolescent trouble such as mobbing for instance.","productName":"Saishuu Loop","img":"https:\/\/media.kitsu.io\/manga\/67\/poster_image\/large-a51d1880cc2e326d631d0fd4f95d13ef.jpeg","chapterNumber":4},{"productId":69,"resume":"Strawberry, Melon, Yuzu, Cream, Banana, Pumpkin, Potato, Coffee, Onion, Blueberry, Eggplant, Apple, Warabi, Cacao, Broccoli &amp; Cauliflower.\nOkama shall teach you the nutritious value of girls and food! Welcome to Food Girls worlds!","productName":"Food Girls","img":"https:\/\/media.kitsu.io\/manga\/69\/poster_image\/large-bf2696b8dca7090ec7f3cfb28c503bcd.jpeg","chapterNumber":15},{"productId":71,"resume":"Kamui Shiro is a young man who was born with the power to decide the fate of the Earth itself--a destiny he can barely bring himself to believe. But as other players in the prophesy begin to gather around him--the \"Seven Seals,\" with the power to protect the Earth, and the \"Seven Harbingers,\" who are fated to destroy it--he has no choice but to come to terms with his fate. (Source: Viz)","productName":"X","img":"https:\/\/media.kitsu.io\/manga\/71\/poster_image\/large-8c7ba39c1d29b6b71006af3d11f8ce44.jpeg","chapterNumber":158},{"productId":74,"resume":"Nana Komatsu is a young woman who's endured an unending string of boyfriend problems. Moving to Tokyo, she's hoping to take control of her life and put all those messy misadventures behind her. She's looking for love and she's hoping to find it in the big city.\nNana Osaki, on the other hand, is cool, confident and focused. She swaggers into town and proceeds to kick down the doors to Tokyo's underground punk scene. She's got a dream and won't give up until she becomes Japan's No. 1 rock'n'roll superstar.\nThis is the story of two 20-year-old women who share the same name. Even though they come from completely different backgrounds, they somehow meet and become best friends. The world of Nana is a world exploding with sex, music, fashion, gossip and all-night parties.\n(Source: Viz Media)","productName":"Nana","img":"https:\/\/media.kitsu.io\/manga\/74\/poster_image\/large-fd4b0d80876a2024cc70ae71d87bfadb.jpeg","chapterNumber":84},{"productId":76,"resume":"Yukari wants nothing more than to make her parents happy by studying hard and getting into a good college. One afternoon, however, she is kidnapped by a group of self-styled fashionistas calling themselves \"Paradise Kiss.\" Yukari suddenly finds herself flung into the roller-coaster life of the fashion world, guided by George, art-snob extraordinaire. In a glamorous makeover of body, mind and soul, she is turned from a hapless bookworm into her friends 22 own exclusive clothing model.\n\n(Source: Tokyopop)","productName":"Paradise Kiss","img":"https:\/\/media.kitsu.io\/manga\/76\/poster_image\/large-e0fa6cd2da3e081d10405db98d54cb31.jpeg","chapterNumber":48},{"productId":78,"resume":"Haruhi sticks out like a sore thumb as a poor, smart girl who got into the hoity-toity Ouran High School on talent alone. When she mistakenly wanders into the meeting room of the host club and breaks a valuable vase, she's recruited to join the club. Realistic and sarcastic, Haruhi isn't used to being around crazy people like the princely Tamaki, scheming Kyouya, silent Mori, immature Hunny, and devilish Hikaru and Kaoru, but she's got no choice if she ever wants to pay earn what she owes. Too bad the club is made for girls to come and be entertained by gorgeous guys -- and Haruhi's been mistaken for a boy!\nIncludes chapters of the story \"Romantic Egoist\" in various volumes, starring a pair of twins who play matchmaker with their fellow students, teachers and the like.\n(Source: MAL)Note: The final volume contains a special bonus chapter where the group travels to Spain.","productName":"Ouran Koukou Host Club","img":"https:\/\/media.kitsu.io\/manga\/78\/poster_image\/large-29cc5e6f63e4fc29d164bdbd48728f7f.jpeg","chapterNumber":87},{"productId":80,"resume":"Shinichirou decides to look for a job in order to pay his rent, and his teacher suggests that he work for someone at their house,doing housekeeping. However, the person who hired him was Sakuya, a girl who is the 37th head of the Shimazu family, and her job is to exorcise and eliminate unwanted creatures. Shinichirou accidentally releases one of the creatures that Sakuya captures and they cooperate to catch it. A story of comedic creature hunting begins! \n(Source: MU)\n\nNote: Volumes 4–8 contain side stories.","productName":"Isuca","img":"https:\/\/media.kitsu.io\/manga\/80\/poster_image\/large-bc8608b2bdabb4dd61f38716f50473ba.jpeg","chapterNumber":66},{"productId":81,"resume":"Risa and Otani are in a similar predicament. Neither is dating anyone, they are both continually being laughed at as a comedy duo (courtesy of their loving sensei), and they both have height problems! Risa is taller than the average girl, and Otani is shorter than the average guy! \nDetermined to be in a relationship, they both decide to cheer each other on in the war of love. However, along the way, Risa begins to develop feelings for Otani... Are these feelings mutual? Can love win, no matter what the height? \n(Source: MU) \nIncluded one-shots:\nVolume 12: Hoshi ni Nattemo Aishiteru\nVolume 16: Bokura no Ibasho","productName":"Lovely★Complex","img":"https:\/\/media.kitsu.io\/manga\/81\/poster_image\/large-50de96bbcf8984e0ff72a74e14a93a95.jpeg","chapterNumber":66},{"productId":82,"resume":"A funny collection of short stories about two girls: Nanami and Misuzu.","productName":"Nanami to Misuzu","img":"https:\/\/media.kitsu.io\/manga\/82\/poster_image\/large-936109e3a1e638de38cbd713c15c50fd.jpeg","chapterNumber":28},{"productId":83,"resume":"In the not too distant future, mankind battles over O-Parts, relics from an ancient civilization. It takes a special kind of person to unlock the full potential of these remnants from the past, and a unique breed of humans known as O.P.T.s (or O-Parts Tacticians) become a force to be reckoned with. Unfortunately, O-Parts can be used for good or evil purposes.\nJio is a young boy with a tragic past who only trusts one thing in the world: money. Little does he suspect that he is actually a very powerful O.P.T., and inside him sleeps a demon of incredible ferocity. He meets up with a girl named Ruby, and together they decide to embark on a dangerous quest to discover as many O-Parts as they can. Will Jio help Ruby realize her dream of becoming a world famous treasure hunter? More importantly, will Ruby help Jio realize his dream of--world domination?!\n(Source: Viz Media)\nIncluded one-shots:\nVolume 6: Trigger","productName":"666 Satan","img":"https:\/\/media.kitsu.io\/manga\/83\/poster_image\/large-3e15b695ac1316ebb69cbd42bf3ba6c8.jpeg","chapterNumber":76},{"productId":84,"resume":"1. Kamisama no Sonata\n2. Mahoroba no Yobigoe\n3. Ipaasha\n4. Taiyou mo Wasure Sasete","productName":"Kamisama no Sonata","img":"https:\/\/media.kitsu.io\/manga\/84\/poster_image\/large-535e3fb73ef92bf61bd6c6a4890be24b.jpeg","chapterNumber":4},{"productId":85,"resume":"Far in the future, humankind has evacuated the Earth in order to preserve it. Humans now reside in a gigantic structure that forms a ring around the Earth, thirty-five kilometers up in the sky. The society of the ring is highly stratified: the higher the floor, the greater the status. Mitsu, the lowly son of a window washer, has just graduated junior high. When his father disappears and is assumed dead, Mitsu must take on his father's occupation. As he struggles with the transition to working life, Mitsu's job treats him to an outsider's view into the various living-room dioramas of the Saturn Apartments.\n(Source: Viz)","productName":"Dosei Mansion","img":"https:\/\/media.kitsu.io\/manga\/85\/poster_image\/large-445ff4ebc67b954bbeb4f0e8a358a7bf.jpeg","chapterNumber":64},{"productId":86,"resume":"When you're a sadist and the boy you love is a masochist, picking on him is a pleasure.\nPain doesn't affect Yoshie... no, that's not quite right; it feels good! Sensei's forceful massages at the Seitai Clinic are the best. But Sensei's solemn and bone-obsessed son, Mikawa, is secretly listening to Yoshie's breathless moans! Is it only a passion for bones that excites Mikawa? Yoshie soon realizes that pain in your heart isn't the same as pain in your body.\nExtra story: A young man loves the pâtissier who works at his dad's café, but with their age gap, will his love ever be taken seriously?\n(Source: DMG)","productName":"Yamashii Karada","img":"https:\/\/media.kitsu.io\/manga\/86\/poster_image\/large-f1c9a921f0d1d42abe244cc33105e62c.jpeg","chapterNumber":18},{"productId":87,"resume":"History repeats itself... Or does it? St. Kleio Academy is a very exclusive school: all of the students are clones of famous historical figures such as Beethoven, Queen Elizabeth I, Napoleon, Mozart, and Freud. All of them, that is, except for Shiro Kamiya. As Shiro struggles to adapt to this unusual campus, St. Kleio's first graduate, a clone of John F. Kennedy, is killed. Are the clones doomed to repeat the fate of their genetic progenitors, or can they create their own destinies? And how does a normal boy like Shiro fit in? \n(Source: Viz)","productName":"Houkago no Charisma","img":"https:\/\/media.kitsu.io\/manga\/87\/poster_image\/large-ae83da36e16ba86bfe3df8c17fdb7763.jpeg","chapterNumber":72},{"productId":88,"resume":"Misha has just moved in next door to Kotarou Higuchi and swears she will protect him at all costs. Unfortunately, she's not too familiar with the ordinary world, as she is an angel who has lived in Heaven until recently. She has no idea how things work on earth and ends up causing more trouble.\n(Source: Tokyopop)","productName":"Pita-Ten","img":"https:\/\/media.kitsu.io\/manga\/88\/poster_image\/large-489c08cfd049f95dae673abf140c599b.jpeg","chapterNumber":47},{"productId":91,"resume":"On planet Di Gi Charat, little Digiko was a pampered princess. Now living on Earth, the green-haired moppet is working for minimum wage at a hobby shop in Japan. Who ever said it was easy being cute? Based on the popular anime series, Di Gi Charat also features bratty Usada, shy boy Minagawa, and Digiko's wacky companions Puchiko and Gemo! \n(Source: Viz)","productName":"Di Gi Charat: Koushiki Comic Anthology","img":"https:\/\/media.kitsu.io\/manga\/91\/poster_image\/large-f27256c5e2bf8e76419f68af26e9c80f.jpeg","chapterNumber":72},{"productId":92,"resume":"When the Isshiki family runs into monetary trouble, their last option is to turn to the god of fortune that resides in their home. However, instead of helping them, he rather see their entire family destroyed! It's up to Tarou to find out Kami-san's past and why their God of fortune has turned into one of misfortune!\n(Source: Bliss Scanlations)","productName":"Tsumi to Bachi","img":"https:\/\/media.kitsu.io\/manga\/92\/poster_image\/large-10e3fc557f559d3c5e2e8444b90d3539.jpeg","chapterNumber":15},{"productId":94,"resume":"No synopsis has been added for this manga yet.Click here to update this information.","productName":"Akai Sora Shiroi Umi","img":"https:\/\/media.kitsu.io\/manga\/94\/poster_image\/large-ed431f8208e512b801d48492bb7bb1de.jpeg","chapterNumber":18},{"productId":95,"resume":"Karin is an average girl...at best. She's not good at sports and gets terrible grades. Plus, her parents are dead and her beloved cat Shii-chan just died, too. She is miserable...but everything is about to change. Because little does Karin know that her mother's ring has the power to make her a goddess! Soon she and Kazune, a brusque but cute boy with godlike powers of his own, will have to fight to protect Karin's ring and Kazune's cousin Himeka from the evil forces of Kirio Karasuma...who has divine designs of his own.\n(Source: Tokyopop)","productName":"Kamichama Karin","img":"https:\/\/media.kitsu.io\/manga\/95\/poster_image\/large-00bcc963df10ec4eb227304e887d094b.jpeg","chapterNumber":32},{"productId":97,"resume":"By day, Kusakabe Maron is an ordinary high school girl with more than her share of problems. But by night, she is Kamikaze Kaito Jeanne, the reincarnation of Joan of Arc! Her mission: to hunt down demon-possessed paintings and exorcise the evil spirits! Too bad accomplishing this mission puts her into conflict with the authorities, who view her as a mysterious stranger vandalizing works of art. With only the help of angel-in-training Finn, she must survive high school during the day and battle evil by night!\n(Source: CMX)","productName":"Kamikaze Kaitou Jeanne","img":"https:\/\/media.kitsu.io\/manga\/97\/poster_image\/large-10a0af8dbfedc5f7c58cd4ac049650d4.jpeg","chapterNumber":33},{"productId":99,"resume":"No synopsis has been added for this manga yet.Click here to update this information.","productName":"Mirai Chonaikai","img":"https:\/\/media.kitsu.io\/manga\/99\/poster_image\/large-ddf1d69ac3fc84cb36af7bd6edb7ee9a.jpeg","chapterNumber":1},{"productId":100,"resume":"No synopsis has been added for this manga yet.Click here to update this information.","productName":"Nyan Cafe e Youkoso!","img":"https:\/\/media.kitsu.io\/manga\/100\/poster_image\/large-30b5b400df314d29463b4559a24c83fc.jpeg","chapterNumber":17},{"productId":101,"resume":"In return for a business loan of 50 million yen, the prestigious Kamiya family gave their daughter Haine away to the Otomiya family. Haine, now an Otomiya, is appointed to the student council of the exclusive Imperial Academy, a private school for the aristocracy. Even though Haine is of proper lineage to be on the council, she finds herself struggling to find her place among the many secrets of its elite members, especially those of the president who holds her heart--Shizumasa Togu, aka \"the Emperor.\"\n(Source: Viz)Included one-shots","productName":"Shinshi Doumei Cross","img":"https:\/\/media.kitsu.io\/manga\/101\/poster_image\/large-9c2fcf2c2758a61a545ec079c267f0ce.jpeg","chapterNumber":59},{"productId":103,"resume":"Minori no Hibi is a cute short manga about a girl that goes to live with her wacky grandfather. Her grandfather, an inventor of strange items, likes to try them out on Minori. Many escapades then ensue as Minori learns to cope with these situations day by day.\nNo, this is not the sister manga of a certain series about a guy with a doll on his hand. All similarities in title are unintentional.","productName":"Minori no Hibi","img":"https:\/\/media.kitsu.io\/manga\/103\/poster_image\/large-47c5201b5be29047cb76c551ea17afed.jpeg","chapterNumber":42},{"productId":104,"resume":"Beings who possess animal-like powers walk among humans in this alternate universe. These mysterious mutants, the +Anima, are shunned by society. Four outcasts in particular--Cooro, a boy with crow-like powers; Husky, a fish-boy; Senri, a bear +Anima; and a girl named Nana, who wields the power of the bat--search for others like themselves while trying to gain acceptance in a world cruel to anyone or anything that is different.\n\n(Source: Tokyopop)","productName":"+Anima","img":"https:\/\/media.kitsu.io\/manga\/104\/poster_image\/large-f9a875c8b30a93b6c5c3cc1d37ce546c.jpeg","chapterNumber":59},{"productId":105,"resume":"Compilation of 5 stories:\n1. Kataomoi no Mukougawa\nAzusa knew the boy in the library was already in love... So what can she do when she starts to fall for him?\n(Source: Which Scanlations)\n2. Ano Kado o Magareba\n3. Tenshi ga Kuretamono\n4. Bitou na Koi\nA boyish girl who hates coffee and a quiet guy who likes girly girls, or does he?\n(Source: Aerandria Scans)\n5. Kimi to Natsu no Aizu","productName":"Kataomoi no Mukougawa","img":"https:\/\/media.kitsu.io\/manga\/105\/poster_image\/large-6f0aca0c04c9b106e8bbcb0034f11ad9.jpeg","chapterNumber":5},{"productId":106,"resume":"Somewhere in the desert lies the world's greatest treasure: the 12 Rings of the Dead, the only source of the mysterious substance Zombie Powder, which can raise the dead and grant eternal life. Into this world stalks Gamma Akutabi, a man with a metal arm and a six-foot chainsaw, cybernetically enhanced master of the legendary martial art . But it takes more than one man to find the ultimate prize. You need a team: super-gunman C.T. Smith, knife-slinging teenager Elwood, and brilliant (and impossibly big-breasted) journalist Wolfgangina. Against an army of crooks and killers, against runaway trains and superpowered madmen, they'll need all their skills... but the most dangerous thing in the west might be the Rings themselves... \n(Source: Viz)","productName":"Zombie Powder.","img":"https:\/\/media.kitsu.io\/manga\/106\/poster_image\/large-09b8cd6c41d74c4fc5070d0631ae02f0.jpeg","chapterNumber":30},{"productId":107,"resume":"Train Heartnet, also known as \"Black Cat,\" was an infamous assassin for a secret organization called Chronos...until he abandoned that cold-blooded existence to live on his own terms as an easygoing bounty hunter. But is Train's past as far behind him as he thinks?\n(Source: Viz)","productName":"Black Cat","img":"https:\/\/media.kitsu.io\/manga\/107\/poster_image\/large-2f03d7daa2a44542169302e8e29bbf8a.jpeg","chapterNumber":187},{"productId":109,"resume":"Aoba is dating the sweet, puppy-like Youhei, but he's also dating the possessive and domineering Yoichi, the elegant and refined Yoko, and the easy-going Yoji, because Youhei has a multiple personality disorder! Aoba is trying to convince Youhei that he loves only him, but Youhei lacks confidence and with Yoichi constantly interfering will the message ever get across? (Source: Baka-Updates)","productName":"Kokoro Logic","img":"https:\/\/media.kitsu.io\/manga\/109\/poster_image\/large-f3d23e04cfc51b27250ab2bb10480b38.jpeg","chapterNumber":1},{"productId":110,"resume":"Buso Renkin is the story of teenager Kazuki Muto, who dies trying to save a girl who was being attacked by an eerie monster. The next morning, however, Kazuki is left wondering whether it was all a dream. Lo and behold, the girl, the monster, and his death are all real! The girl, Tokiko Tsumura, was actually trying to slay the homunculus (a beast that can take the form of humans, but whose main source of food is people), but Kazuki got in her way. To revive Kazuki, Tokiko replaces his heart with a \"kakugane,\" an alchemic device that allows him to summon a lance with which to fight the monsters. It turns out that Tokiko is a member of Renkin Kenshi (Alchemist Soldiers), an organization sworn to protect the world from the diabolical creatures. Soon, Kazuki joins Tokiko in her quest to terminate the sinister being that creates and controls the homunculus.\n(Source: Viz)","productName":"Busou Renkin","img":"https:\/\/media.kitsu.io\/manga\/110\/poster_image\/large-17e0267a6ce4a7d86eb62fd0c856cde3.jpeg","chapterNumber":83},{"productId":111,"resume":"Dragon Ball follows the adventures of Son Goku from his childhood through adulthood as he trains in martial arts and explores the world in search of the seven mystical orbs known as the Dragon Balls, which can summon a wish-granting dragon when gathered. Along his journey, Goku makes several friends and battles a wide variety of villains, many of whom also seek the Dragon Balls for their own desires. Along the way becoming the strongest warrior in the universe.\nPart II of Dragon Ball is also known as 'Dragon Ball Z' in North America.\nVolumes 17-42 were published in North America under the name Dragon Ball Z.\n(Source: Wikipedia)","productName":"Dragon Ball","img":"https:\/\/media.kitsu.io\/manga\/111\/poster_image\/large-5957036139f7bdb269cf851dceddc892.jpeg","chapterNumber":520},{"productId":112,"resume":"No synopsis has been added for this manga yet.Click here to update this information.","productName":"Waga Itoshi no Doctor","img":"https:\/\/media.kitsu.io\/manga\/112\/poster_image\/large-1d076939fb21fa402ce4b3af1db91986.jpeg","chapterNumber":6},{"productId":113,"resume":"Wimpy Sena Kobayakawa has been running away from bullies all his life. But when the football gear comes on, things change—Sena's speed and uncanny ability to elude big bullies just might give him what it takes to become a great high school football hero! Enjoy all the bone-crushing action and slapstick comedy that this heartwarming coming-of-age story has to offer. \n(Source: Viz)","productName":"Eyeshield 21","img":"https:\/\/media.kitsu.io\/manga\/113\/poster_image\/large-4ef159197fc9d6e980bbc06fcd0b6021.jpeg","chapterNumber":333},{"productId":116,"resume":"The samurai didn't stand a chance. First, the aliens invaded Japan. Next, they took all the jobs. And then they confiscated everyone's swords. So what does a hotheaded former samurai like Sakata \"Gin\" Gintoki do to make ends meet? Take any odd job that comes his way, even if it means losing his dignity.\n\n(Source: VIZ Media)\n\nIncluded one-shots:\nVolume 1: Dandelion\nVolume 2: Shirokuro\nVolume 24: 13\nVolume 38: Bankara-san ga Tooru\nVolume 41: Special Lesson.","productName":"Gintama","img":"https:\/\/media.kitsu.io\/manga\/116\/poster_image\/large-73e331420769c2f9c1252ba0cf6f2108.jpeg","chapterNumber":709},{"productId":118,"resume":"Collection of 6 oneshots:\n1) Leave Me Alone With First Love!\nLove triangle between a teacher, his student\/cousin, and the cousin's best friend.\n2) Reward of a Smile\nTwo highschool students set up an arrangement for paid rendevous, but the motivation for one isn't just sexual.\n(Also published in Gorgeous Heart)\n5) Love Rhapsody\nA photographer works on \"intensity\" with his new model.\n(Also published in Gorgeous Heart)\n6) Knight Gold\nSumiyoshi's got a problem keeping it up... so his partner tries to spice things up with a threesome.\n(Also published in Gorgeous Heart)\n(from M-U)","productName":"Love Drug","img":"https:\/\/media.kitsu.io\/manga\/118\/poster_image\/large-39cc65bd9431a3eca9d2de17d09d9311.jpeg","chapterNumber":6},{"productId":119,"resume":"Junpei Manaka sneaks up to the roof to see the sunset. When he opens the door, he startles a mysterious beauty. She panics and runs away, but before not Junpei has caught sight of her adorable strawberry print panties... in EXTREME close-up. With that vision forever burned into his memory, Junpei embarks on a quest to find the girl, and the panties, of his dreams! \n\n(Source: Viz)","productName":"Ichigo 100%","img":"https:\/\/media.kitsu.io\/manga\/119\/poster_image\/large-f5526f7f16a9c89f18e73fedd174c47e.jpeg","chapterNumber":167},{"productId":120,"resume":"Latest manga series by Moriki Takeshi.","productName":"GLIAs World's End","img":"https:\/\/media.kitsu.io\/manga\/120\/poster_image\/large-1fb7dd247ef52ac451e9678b45553042.jpeg","chapterNumber":6},{"productId":121,"resume":"According to legend, a war between the \"Kagijin\", beings of fearsome power, laid waste to the world and buried it in sand. Time moved on… and now, Chiruda Portman, a female soldier of the Gabbia Empire, has been ordered to exterminate a certain man.\nThe name of the boy is \"Tsubame\"!\nThe two meet by chance, but Chiruda senses something strange about Tsubame, who loves freedom and reading books... what is the big secret he holds!? A new-age fantasy of their adventures set in a breathtaking world!! \"\nSource: Official site of Shounen Jump","productName":"Kagijin","img":"https:\/\/media.kitsu.io\/manga\/121\/poster_image\/large-ecac26fb7a8a1c83f0617c167ffefb3e.jpeg","chapterNumber":17},{"productId":122,"resume":"Akito Hayama is the infamous God Hand, an art thief who steals only masterpieces. But these arn't your ordinary art pieces, they're actually copies made by Akito's missing mother. Akito is caught by an underground art broker and consequently learns the reason for the disappearance of his mother. In a attempt to save himself, a new found ability 'Kannade' emerges within Akito, as well as the quest to find certain art pieces by Akito's mother and what Kannade's fate really is.","productName":"Kannade","img":"https:\/\/media.kitsu.io\/manga\/122\/poster_image\/large-8c5c85988904239bea02197d3f5e52b4.jpeg","chapterNumber":15},{"productId":123,"resume":"Other series by Moriki Takeshi.","productName":"Onegai Kamisama!","img":"https:\/\/media.kitsu.io\/manga\/123\/poster_image\/large-1f14a9af94b28e796f3d78722ccf5630.jpeg","chapterNumber":30},{"productId":125,"resume":"Sawada Tsunayoshi is regular boy who has never excelled in sports, school or social life, thus being named \"No Good Tsuna\". Everyday, he leads just a normal life, living with his mother, while his father is away for work. But the thing Tsunayoshi doesn't know is that his family is actual lineage of the great Mafia Boss, the first head of Vongola, Giotto.\nBecause of the Sawada history, Tsuna has been chosen to become tenth head of the Vongola family, an infamous Italian mafia family which rules the Mafia world. To become worthy of the title, Tsuna is being aided by professional hitman and infant, Reborn, who takes the role of Tsunayoshi's mafia tutor.\n[Written by Katekyo Hitman Reborn! FC]","productName":"Katekyo Hitman Reborn!","img":"https:\/\/media.kitsu.io\/manga\/125\/poster_image\/large-95fd8b59115899df097802c9a4c9f437.jpeg","chapterNumber":409},{"productId":127,"resume":"Due to a terrible bus accident, Randoh (the main character) wakes up one day to discover he has the face of an attractive girl thanks to a rather perverted plastic surgeon. But not just any girl's face--it's the same girl that he has a crush on. To make matters even worse, he runs into the girl and she thinks it's her long-lost twin sister. When Randoh moves in with her (quite willingly) he is torn between helping out this girl by pretending to be her sister, and wanting his old face back.\n(Source: Akatsuki-Manga)","productName":"Pretty Face","img":"https:\/\/media.kitsu.io\/manga\/127\/poster_image\/large-75e551e92c9fd514dea71cd36ffbed20.jpeg","chapterNumber":53},{"productId":128,"resume":"Ryoma Echizen just joined the Seishun Academy's tennis team, which is known for being one of the most competitive teams in Japan. Its members are incredibly talented, gifted, and athletic. With rigorous and extremely intense practices, the upperclassmen of the team expect the very best from themselves and they expect even more from the new members of the team. While most of the freshmen are on pins and needles hoping they won't get cut from the team, Ryoma Echizen is confident, cool, and collected. Some might even say he's cocky, but at least he's got the skills to back up his attitude. With his virtually unreturnable \"twist serve,\" Ryoma is sure to make the starting team. Join Ryoma and the other first years, as they train hard, make friends, and try to find a place for themselves on the team. And meet Ryoma's cute but chronically shy classmate Sakuno Ryuzaki. She's got a big crush on Ryoma, but will he ever notice her? Ryoma Echizen is the Prince of Tennis. He may be ready for the Seishun Academy tennis team, but are THEY ready for HIM? \n(Source: Viz)Note: The total chapter count includes 379 chapters for the original manga and 1 chapter entitled \"Chapter 0.\"  This totals 380.  Please do not change the chapter count.","productName":"Tennis no Ouji-sama","img":"https:\/\/media.kitsu.io\/manga\/128\/poster_image\/large-ba5e68ef694ad6f7042c25ae4d298b4e.jpeg","chapterNumber":380},{"productId":129,"resume":"In ancient times, minds and spirits dwelled in all the materials on earth. At the end of a battle these minds dwelling in matter conquered the hostile matter of the enemy and mutiplied. Sacred wars gave birth to the elementalors. Fierce battles between the elementalors raged continuously in the struggle to create a new utopia.\nKagura is an elementalor reincarnated in the present. After a billion nights, the battles of the elementalors have returned... but only one can rule. Kagura's long, fiery trial is about to begin. Now! \n(Source: M-U)","productName":"Shouryou Tsukai Elementalors","img":"https:\/\/media.kitsu.io\/manga\/129\/poster_image\/large-04182b142b251d5660e575e8bb1a305e.jpeg","chapterNumber":1},{"productId":132,"resume":"Yusami, and Kurumi are in a love triangle with Sena. Yusami has been best friends with Sena for a year, and Kurumi is actually Sena's little sister.","productName":"Love Cubic","img":"https:\/\/media.kitsu.io\/manga\/132\/poster_image\/large-41a3652fde45be4460f4d9121fd36570.jpeg","chapterNumber":6},{"productId":133,"resume":"Winning isn't everything in the game of basketball, but who wants to come in second? It takes dedication and discipline to be the best, and the Shohoku High hoops team wants to be just that. They have one last year to make their captain's dream of reaching the finals come true--will they do it? Takehiko Inoue's legendary beloved basketball manga is finally here and the tale of a lifetime is in your hands.\n\nHanamichi Sakuragi's got no game with girls--none at all! It doesn't help that he's known for throwing down at a moment's notice and always coming out on top. A hopeless bruiser, he's been rejected by 50 girls in a row! All that changes when he meets the girl of his dreams, Haruko, and she's actually not afraid of him! When she introduces him to the game of basketball, his life is changed forever...\n\n(Source: VIZ)\n\nIncluded one-shot: \nVolume 31: Slam Dunk: 10 Days After","productName":"Slam Dunk","img":"https:\/\/media.kitsu.io\/manga\/133\/poster_image\/large-fa2598149a79fadd9326e681a96fc0b6.jpeg","chapterNumber":276},{"productId":134,"resume":"A rumor goes around school about an abandoned amusement park and a magician who lives there that can make someone disappear for good. Yoon Ah-ee, a girl struggling to feed her sister and herself everyday will experience her life change as she meets a mysterious magician.\n\n(Source: MU)","productName":"Annarasumanara","img":"https:\/\/media.kitsu.io\/manga\/134\/poster_image\/large-6c4989725f87a07d23c7d5a026fef950.jpeg","chapterNumber":27},{"productId":135,"resume":"Everybody has a dream, and for Sho Kazamatsuri, that dream is simple: he wants to be the best soccer player he can possibly be. He's the spirited leader of the Josui Junior High team and everyone looks up to him. In turn, he tries to keep the team together at any cost! (Source: Viz)","productName":"Whistle!","img":"https:\/\/media.kitsu.io\/manga\/135\/poster_image\/large-5409ee93c645ac78b88ac32601e9f325.jpeg","chapterNumber":216},{"productId":136,"resume":"No synopsis has been added for this manga yet.Click here to update this information.","productName":"Vaelber Saga","img":"https:\/\/media.kitsu.io\/manga\/136\/poster_image\/large-bdbe2a7978aee1c861a01d37e3adf425.jpeg","chapterNumber":33},{"productId":138,"resume":"Yusuke Urameshi was a tough teen delinquent until one selfless act changed his life...by ending it. When he died saving a little kid from a speeding car, the afterlife didn't know what to do with him, so it gave him a second chance at life. Now, Yusuke is a ghost with a mission, performing good deeds at the behest of Botan, the ferrywoman of the River Styx, and Koenma, the pacifier-sucking judge of the dead.\n(Source: Viz)","productName":"Yuu☆Yuu☆Hakusho","img":"https:\/\/media.kitsu.io\/manga\/138\/poster_image\/large-6d03d7c070357ef62fb4001db54b951e.jpeg","chapterNumber":175},{"productId":140,"resume":"10th grader Yugi spent most of his time alone playing games--until he solved the Millennium Puzzle, a mysterious Egyptian artifact! Possessed by the puzzle, Yugi becomes Yu-Gi-Oh, the King of Games, and challenges evil-doers to the Shadow Games--weird games with high stakes and high risks! These graphic novels contain new stories not seen in the anime, including the origin of Yugi and his friends!\n(Source: Viz)","productName":"Yu☆Gi☆Oh!","img":"https:\/\/media.kitsu.io\/manga\/140\/poster_image\/large-958008b55ba38845c602989cd51cf601.jpeg","chapterNumber":343},{"productId":142,"resume":"Kippei Katakura is a 17-year-old playboy who spends his time chasing girls, careless of their feelings. But when his 5-year-old cousin Yuzuyu comes to live with his family after her mother's sudden disappearance, Kippei is put in charge of taking care of her. As Kippei gets to know Yuzuyu and starts to understand how she feels, he also begins to realize that all girls were like Yuzuyu once... (Source: Viz)","productName":"Aishiteruze Baby★★","img":"https:\/\/media.kitsu.io\/manga\/142\/poster_image\/large-d43a942750525bffa67644b98e6e7d98.jpeg","chapterNumber":33},{"productId":143,"resume":"Midori moves from Tokyo to start her senior year of high school in Sendai. She saved her childhood friend Aa-chan from teasing, but the class boss, Erena, stirs up a revolt and makes her the new target. Midori can’t bear the never-ending torment and personally takes her own life. Midori gets a second chance at life, choices and revenge though. This is Momochi Reiko’s first challenge at a time warp story!\n(Source: Forbidden Garden Scans)","productName":"Tomodachi Gokko","img":"https:\/\/media.kitsu.io\/manga\/143\/poster_image\/large-326ac16babbd7528f0952b9c69847a0c.jpeg","chapterNumber":13},{"productId":144,"resume":"Hana loves the school, caramel and...drawing manga! Her speciality: Drawing romance stories! In real life, her heart beats for the cool Taro, but she's too shy to tell him...unfortunately, Marie, her rival, has decided to steal him!\n(Source: M.N.M.)","productName":"Caramel Diary","img":"https:\/\/media.kitsu.io\/manga\/144\/poster_image\/large-cafe55cf9210a0c7cf2bdf078247d1b4.jpeg","chapterNumber":5},{"productId":146,"resume":"No synopsis has been added for this manga yet.Click here to update this information.","productName":"Kaitai","img":"https:\/\/media.kitsu.io\/manga\/146\/poster_image\/large-1f41b729115048ccbbc29f51cfefe20d.jpeg","chapterNumber":3},{"productId":147,"resume":"Japanese-American track-and-field star Mizuki has gotten herself to transfer to a high school in Japan...but not just any school! To be close to her idol, high jumper Izumi Sano, she's going to an all-guys' high school...and disguising herself as a boy! But as fate would have it, they're more than classmates...they're roommates! Now, Mizuki must keep her secret in the classroom, the locker room, and her own bedroom. And her classmates—and the school nurse—must cope with a new transfer student who may make them question their own orientation...\n\n(Source: VIZ Media)\n\nIncluded one-shots:\nVolume 1: Natsu no Ori (The Cage of Summer)\nVolume 4: Kawaki no Tsuki (The Thirsty Moon)","productName":"Hanazakari no Kimitachi e","img":"https:\/\/media.kitsu.io\/manga\/147\/poster_image\/large-2e276803141baaca8816555bdc3e6b5e.jpeg","chapterNumber":148},{"productId":148,"resume":"Yuika Aoi has a recurring nightmare in which she isn’t able to save a mysterious, green-eyed man called Rei. Her elderly grandmother, who was born in the Taisho era, lives very traditionally, and at times seems to have magical powers. Apart from all this, she is a normal high school girl until she falls off a roof and into the Taisho era, in the middle of a battle between Rei and a fairy. Will she be able to save him this time?\n(Source: Doko Demo Doa Manga Scanlations)","productName":"Seirei Gakusha Kidan Reikyou Kaden","img":"https:\/\/media.kitsu.io\/manga\/148\/poster_image\/large-521b64b12719d3e9bb8da76cb776fd03.jpeg","chapterNumber":9},{"productId":149,"resume":"A young lady about to make her debut into society is devastated to learn that her tutor will be dismissed at the same time.\n(Source: MU)","productName":"Koi Otome no Nandai Shitsumon","img":"https:\/\/media.kitsu.io\/manga\/149\/poster_image\/large-798cb3b4ceb5dbab2d1c945a9c4599ef.jpeg","chapterNumber":1},{"productId":150,"resume":"Makoto Amano wants to become an actor, but his stern father has decreed that the only way Makoto can pursue his dream is to spend the last two years of high school as a girl! He quickly makes friends with popular tomboy Ito Miura, another drama enthusiast at this new high school and the only student to find out his secret--but are they more than pals?\n(Source: Viz)","productName":"W-Juliet","img":"https:\/\/media.kitsu.io\/manga\/150\/poster_image\/large-179a10a139319b6cd7665a18118c5ddd.jpeg","chapterNumber":79},{"productId":152,"resume":"A world where mankind has become an endangered species.  On a planet well known as \"Flickle\" resides a single human girl, Minii, who lives among the world of robots. One day she encounters a human prince and his guardian who falls from the sky.","productName":"Ascribe to Heaven","img":"https:\/\/media.kitsu.io\/manga\/152\/poster_image\/large-22470bfb787f4776dd801ca58100d600.jpeg","chapterNumber":3},{"productId":153,"resume":"One day, as Suzuri was walking past a river, she suddenly saw a HUGE peach slowly flowing! Due to the fact she has not eaten since the start of her journey, she decided to just conclude the huge peach was a god sent and did the most logical thing anyone would have done - eat it. However, just as she had her first bite, a young male jumps out of the peach! And before Suzuri knows it, she’s the 18th master to Momo who could do anything that Suzuri commands! What kind of danger would they encounter on their journey as they face a god that goes by the name Kyuui? And what dark secret does Momo have!?\n(Source: Sakura-Crisis)","productName":"√W.P.B.","img":"https:\/\/media.kitsu.io\/manga\/153\/poster_image\/large-0eb12b24e240077cd9994a6cdcea1ed8.jpeg","chapterNumber":12},{"productId":154,"resume":"Taki Kanon and Nakamori Ryou met through a piano in their first year of high school. Nakamori played video game songs beautifully, while Taki's talent lay in piano tuning. They were in the same class, and they spent a lot of time together at a piano. But shyness and misunderstanding plagued the formation of a more serious relationship. Over the years, will they be able to find a way to make the paths of their lives finally converge? [tethysdust].\n(Source: Mangahelpers)","productName":"Zettai Donkan","img":"https:\/\/media.kitsu.io\/manga\/154\/poster_image\/large-9faa0e1b6c9f1f803d48609f0c77d43d.jpeg","chapterNumber":3},{"productId":156,"resume":"A spin-off manga with Minko Tsurugi as the main character.","productName":"Hanasaku Iroha: Green Girls Graffiti","img":"https:\/\/media.kitsu.io\/manga\/156\/poster_image\/large-724b8139858ead874e11b293a4545843.jpeg","chapterNumber":11},{"productId":157,"resume":"Jiggy and Maggy, a single soul for two bodies, when the one wakes up the other one falls asleep but they remain bound by their five senses.\nThey live then surprising experiences and disturbing emotions...\n(source : Taifu comics)","productName":"½","img":"https:\/\/media.kitsu.io\/manga\/157\/poster_image\/large-826b16efe0df58e29b4d12bc4af4d802.jpeg","chapterNumber":19},{"productId":158,"resume":"π is the ratio of a circle's circumference to the diameter of the oppai (breast) which contains the word pai, the romanized form of pi in Japanese. It's a story of a man obsessed with breasts. (Source: B-U Manga)","productName":"π","img":"https:\/\/media.kitsu.io\/manga\/158\/poster_image\/large-7dd90e307f4fdac224f972d82c8a13cd.jpeg","chapterNumber":101},{"productId":159,"resume":"1-2. Student's Request Teacher's Duty\n3, Sakase! Takae no Hana\n4. Honey Happy Baby\n5. Voice Box\n6. Scandal Kiss\n7. The View Through the Lens","productName":"Seito no Shucho Kyoushi no Honbun","img":"https:\/\/media.kitsu.io\/manga\/159\/poster_image\/large-6c47cdcae1c21b4e1f3dd4317539c887.jpeg","chapterNumber":7},{"productId":160,"resume":"A short shoujo story about a girl who wants to continue the family tradition of her family...that is, get married at 16 and have a girl child at 17. A very crazy story about a very crazy girl named Ren who falls in love with one of the most popular boys in school, Juuya, at first sight... (Source: ANN)","productName":"± Junkie","img":"https:\/\/media.kitsu.io\/manga\/160\/poster_image\/large-1ccb1533ae8578d15d3e1d0e31db1acd.jpeg","chapterNumber":4},{"productId":161,"resume":"Aruto Kashiwayama is a budding pianist. She lodges at a famous conductor's house. Aruto's relationships with the conductor's son Hokuto and her first love Masaru are revealed. (Source: MU)","productName":"\"Aruto\" no \"A\"","img":"https:\/\/media.kitsu.io\/manga\/161\/poster_image\/large-4eb276eec909ed90d489f4fdbad9edec.jpeg","chapterNumber":2},{"productId":162,"resume":"Ema is obsessed with ghosts, and is even part of her school's occult club. She'll do anything that has to do with some crazy superstition about ghosts or spirits, and make sure that she goes out of her way to do it. Ema is known for this at school, and the series follows her pursues to find ghosts. Ema, unfortunately, cannot see the things that she loves, unlike a few of her friends...\n(Source: StarryHeaven) Included one-shots:\nVolume 1: Shuugaku Ryoko no Susume\nVolume 3: Time Capsule and Happy End no Tsukurikata","productName":"13 Nichi wa Kinyoubi?","img":"https:\/\/media.kitsu.io\/manga\/162\/poster_image\/large-dfe77a89d8cab0c0f8762d6ef4ad1e93.jpeg","chapterNumber":15},{"productId":165,"resume":"A collection of short stories revolving around a girl's first time!\n1. A Boy's Suggestion, by Shinjo Mayu\n2. Virgin Beast, by Minami Kanan\n3. Become Daring, by Ayukawa Mio\n4. When I'm with You, I Won't Be Home 'til Morning!, by Kousaka Yuuka\n5. The Awakening of Love, by Sakurai Miya\n6. Smooch Smooch Smooch, by Masuzaki Yoshino\n7. Sweet Desires, by Shigano Iori","productName":"17-sai: Hajimete no H","img":"https:\/\/media.kitsu.io\/manga\/165\/poster_image\/large-82c990953dcbaf69d0f3b611d9b575cf.jpeg","chapterNumber":7},{"productId":167,"resume":"Shinobu is the only girl that goes to the secret Ninja Academy, which is presided over by a strange, yellow, ball-organism, Onsokumaru. While he knows nothing about being a ninja master, he loses no opportunity to exploit the dim but cute Shinobu. On a mission to steal all the panties from area high school girls, Shinobu meets Kaede who gets drawn into the surreal, ecchi, but fun world of Shinobu.\n(Source: ANN)","productName":"Ninin ga Shinobuden","img":"https:\/\/media.kitsu.io\/manga\/167\/poster_image\/large-6ee363d089481fc2090fe0de29ead8aa.jpeg","chapterNumber":68},{"productId":170,"resume":"A collection of short stories that look to mankind's exploration of space, and examine the possibilities that we could face when we decide to take those first fateful steps into the unknown.\n(Source: MU)","productName":"2001-ya Monogatari","img":"https:\/\/media.kitsu.io\/manga\/170\/poster_image\/large-f7d9e66eed01ff14610a3091851a7c60.jpeg","chapterNumber":20},{"productId":171,"resume":"A novel series that tells the story of a Long Arm named Carl, of what happened to Sora after he was trapped in The World by Morganna, and of Tsukasa's real life after being able to log out from The World.","productName":".hack\/\/Zero","img":"https:\/\/media.kitsu.io\/manga\/171\/poster_image\/large-3f710705f2386ff1b54cbcb3cd1cce72.jpeg","chapterNumber":2},{"productId":173,"resume":"By all the usual measures, he could be considered a pretty useless guy: a scholastic failure, an athletic disaster, and a chronic loser... But Fukuda Shinichi has one passion: cheering for others! The 18-year-old captain of North Kanto Southern High's Cheerleading squad decides to make the most of his summer by attending cram school in Tokyo, only to find out that the whole trip was a sham! Things are looking up when he and his friend meet up with two cute Tokyo girls; too bad the girls brought them to a rip-off bar and took off! Ditched by his one remaining friend and stuck with an impossibly high bar bill, Fuku-kun's life couldn't get any worse! But just then he gets saved by Ume, his role model and former cheerleading squad captain! What is he doing in Tokyo... and why does everyone around seem to know and respect him? Without anywhere else to go, Fuku-kun decides follow Ume to his job, only to discover that... he's a host?!? Fukuda's summer of cheering others on has begun... and the streets of Tokyo's red-light district will never be the same!\n\n(Source: Mangadex)","productName":"3.3.7 Byooshi!!","img":"https:\/\/media.kitsu.io\/manga\/173\/poster_image\/large-8b330c28b3414386f64c7b15faf38e87.jpeg","chapterNumber":86},{"productId":174,"resume":"Ever wonder what Yaoi-Con is like from a mangaka's point of view? In 2011, BL mangaka Fusanosuke Inariya attended Yaoi-Con as a guest of honor. Read this manga style report about her personal experiences on what she saw and how she felt. There's plenty of fun as East meets West in this fujoshi fueled article!\n(Source: DMG)","productName":"Yaoi-Con 2011 Report","img":"https:\/\/media.kitsu.io\/manga\/174\/poster_image\/large-8fbcdabf95a0b1b6a37aed73466ad18f.jpeg","chapterNumber":1},{"productId":175,"resume":"It is the 10th Century.\nthe story is laid in so many ghost spirit and supernatural being\"mononoke\" was wander a ancient capital \"Heian-kyo\".\nThere were two men in the Heian-kyo. the Great Onmyoji \"Abe Seimei\". and nobleman \"Minamoto Hiromasa\"blest by the Spirit of Music.\ntwo protagonist meets .....","productName":"Onmyouji","img":"https:\/\/media.kitsu.io\/manga\/175\/poster_image\/large-aae0359abac28a8ea93199b14549c64d.jpeg","chapterNumber":112},{"productId":176,"resume":"Shiina has 2 secrets. She loves her brother Kiri a lot, and Kiri doesn't know that they are not blood related. She doesn't know what to do, she's been hiding it for a long time, and no one knows she loves him.\n(Source: MangaFox)","productName":"\"Suki\" to Ienai.","img":"https:\/\/media.kitsu.io\/manga\/176\/poster_image\/large-09aab763249d2a0d9edeab1e520d86cf.jpeg","chapterNumber":1},{"productId":177,"resume":"No synopsis has been added for this manga yet.Click here to update this information.","productName":"Pocho Mukin","img":"https:\/\/media.kitsu.io\/manga\/177\/poster_image\/large-3a2983d32d641db58ae0c9b081df59db.jpeg","chapterNumber":28},{"productId":178,"resume":"Rumors stir throughout the land: when the wielder of the black sword draws his dark blade, all who stand in its path are torn asunder…! Köinzell, the mysterious young boy who carries the black sword, undeniably wields it with exceptional skill, but can he truly be responsible for the bloody rumors? Pursued by the Traitorous Lances, four powerful warriors who were thought to have been defeated by the Seven Heroes, the strength of the young swordsman will be tested to its limit. At battle’s end, only the shocking truth of Köinzell’s quest will stand above the corpses of his enemies…\n\nAn epic fantasy on the grandest of scales!\n\n(Source: Yen Press)","productName":"Übel Blatt","img":"https:\/\/media.kitsu.io\/manga\/178\/poster_image\/large-0269e3f843e63d652237ba695ddb5070.jpeg","chapterNumber":167},{"productId":180,"resume":"The story revolves around the main character Higasa Sachi. She's the ideal student who puts on a refined and dignified persona while excelling at sports and academics. She is respected and admired by her peers and teachers alike. \nSachi who cares about appearance can not stand Alice Toyozaki who is a hard core otaku that makes no effort in hiding her love for it. Sachi (who is secretly a budding manga artist) can not understand why Alice puts much effort into drawing manga herself when she has no talent for it, but one day after Alice is picked on by a bully...","productName":"Manken.","img":"https:\/\/media.kitsu.io\/manga\/180\/poster_image\/large-37ef55154ced33d0100a706bfd9a90d3.jpeg","chapterNumber":42},{"productId":181,"resume":"Rejected way too many times by good-looking (and unattainable) guys, shy Riiko Izawa goes online and signs up for a free trial of a mysterious Nightly Lover \"figure.\" The very next day a cute naked guy is delivered to her door, and he wants to be her boyfriend! Has Riiko died and gone to heaven? The cute guy turns out to be sweet, smart, a great cook, and lots more. And he looks like a million bucks, which is what he's going to cost Riiko if she doesn't return him in time... \n(Source: Viz) Included one-shots:\nVolume 6: I Won't Let You Become a Star! and Aromatic Boy","productName":"Zettai Kareshi.","img":"https:\/\/media.kitsu.io\/manga\/181\/poster_image\/large-7de582c6d04a1a4f0fd22824f8805b6b.jpeg","chapterNumber":35},{"productId":182,"resume":"No synopsis has been added for this manga yet.Click here to update this information.","productName":"Ame-iro no Ibasho","img":"https:\/\/media.kitsu.io\/manga\/182\/poster_image\/large-35da4897c12a19e7629f25de840e73ea.jpeg","chapterNumber":1},{"productId":183,"resume":"When Kano, a cafe owner, was attacked by some hoodlums dispatched by a land shark; a secretive, shady character, Otowa came to his rescue! Since then, Otowa frequented Kano's cafe and kept the yakuza at bay. Kano was unaware of the danger he's in and started to look forward to Otowa's visit... Until an equally dangerous man lured Kano out of Otowa's protection, and all hell broke loose...!\n(from Fantasy Shrine)","productName":"Uso to Coffee to Amai Kiss","img":"https:\/\/media.kitsu.io\/manga\/183\/poster_image\/large-febd2f5f9cbf4e74546712888d1fbc47.jpeg","chapterNumber":6},{"productId":184,"resume":"Sasshi's world is in disarray. His best gal pal, Arumi, is about to move away, and his Osaka neighborhood is being demolished in the name of urban renewal. \nHowever, this little neighborhood has some surprises under its concrete—it's actually a portal to parallel universes. And when this section of the city is leveled, the portal is cracked wide open. Sasshi and Arumi soon find themselves being hurtled from one strange world to the next! Making matters even more surreal, is the fact that these worlds seem to spoof and mock popular movies, video games, manga and anime! \n(Source: Tokyopop)","productName":"Abenobashi Mahou☆Shoutengai","img":"https:\/\/media.kitsu.io\/manga\/184\/poster_image\/large-4a1dd5a6cc5047c67e637fa3420860e9.jpeg","chapterNumber":12},{"productId":185,"resume":"Shinta loves nothing more than girls, their school uniform, and their breasts. On the other hand, Shirasu was desperately looking for more members for the Fishing Club. Shinta, as the new transfer student, becomes the target of Shirasu for the Fishing Club. She persistently requests that he join the Fishing Club, but he strongly refuses because he has no interest in fishing. However, his joining of the Fishing Club becomes inevitable when he is saved from bullies by the well known “Tsuri-Chichi” Nagisa, apparently an expert in fishing. She has superb skills in fishing to a point where she can use her fishing rod as a weapon. Strong yet kind and having huge breasts, Nagisa becomes a trigger that changes Shinta’s perspective of fishing as she guarantees that Shinta has the potential of becoming a professional fisher. \n(Source: Manga Updates)","productName":"Tsuri Chichi Nagisa","img":"https:\/\/media.kitsu.io\/manga\/185\/poster_image\/large-239a93dcfa58700a88b2fefa05c534c2.jpeg","chapterNumber":36},{"productId":187,"resume":"Yoshirou has a unique ability: The ability to read people's minds. He claims that he has noticed it recently and like tuning a radio he can listen to what others are thinking. He then realizes that using his powers, he can probably save others, like Saw, who is the new transfer student who is in the same class as Yoshirou. Meanwhile, two unknown people are driving discussing about the abnormal increase ofpeople being able to use psychic powers. Who are these people and what is going to happen to Yoshirou? [Mamo]\n(Source: Mangahelpers)","productName":"Minna! Esper da yo!","img":"https:\/\/media.kitsu.io\/manga\/187\/poster_image\/large-37665e77256a3607fca8117fb2a576d7.jpeg","chapterNumber":73},{"productId":188,"resume":"In one unusual Tokyo high school, education takes a backseat to brawling as warring clubs wreak havoc in the hallways and chaos in the classrooms, all vying to be the baddest team around! Although they often contribute their fair share, only a handful of students serve to stem the tide of violence in this untamed outpost. These are the few, the proud, the powerful: the members of the Juken Club!\n\n(Source: CMX)","productName":"Tenjou Tenge","img":"https:\/\/media.kitsu.io\/manga\/188\/poster_image\/large-56668a16acc7ab9a863bef45e67210f7.jpeg","chapterNumber":136},{"productId":189,"resume":"Itsuki Minami needs no introduction – everybody’s heard of the “Babyface” of the Eastside. He’s the toughest kid at Higashi Junior High School, easy on the eyes but dangerously tough when he needs to be. Plus, Itsuki lives with the mysterious and sexy Noyamano sisters. Life is never dull, but it becomes dangerous when Itsuki leads his school to victory over some vindictive Westside punks with gangster connections. Now he stands to lose his school, his friends, and everything he cares about. But in his darkest hour, the Noyamano girls come to Itsuki’s aid. They can teach him a powerful skill that will save their school from the gangsters’ siege–and introduce Itsuki to a thrilling and terrifying new world.\n(Source: Del Rey)","productName":"Air Gear","img":"https:\/\/media.kitsu.io\/manga\/189\/poster_image\/large-a4c82afa7bc75b0c94001cb6ee4545ef.jpeg","chapterNumber":358},{"productId":190,"resume":"No synopsis has been added for this manga yet.Click here to update this information.","productName":"Asao-san to Kurata-kun","img":"https:\/\/media.kitsu.io\/manga\/190\/poster_image\/large-0ec07d061d5eab31ddec4c0c8283a6cd.jpeg","chapterNumber":69},{"productId":191,"resume":"Despite her family's protests, Aoi Sakuraba decides that she is going to marry Kaoru Hanabishi, her love of eighteen years. Once he realizes that her intentions are genuine - and that she's not just trying to get him to reconcile with his estranged (and domineering) family - he begins to definitely warm up to the idea, too. What obstacles must the two overcome in order to be together?\n(Source: Tokyopop)","productName":"Ai yori Aoshi","img":"https:\/\/media.kitsu.io\/manga\/191\/poster_image\/large-43c0fe22d2501e2d37932f9a69516898.jpeg","chapterNumber":153},{"productId":192,"resume":"Bushido Sixteen centers around two female competitors of another Japanese tradition, kendou (sword-fighting). Kaori is an accomplished kendou practitioner, but she finds herself facing an unexpected opponent in Sanae, a superficially weaker fighter who bests Kaori in a bout.\n(Source: ANN)","productName":"Bushido Sixteen","img":"https:\/\/media.kitsu.io\/manga\/192\/poster_image\/large-2cbecee330cd57320dfa98660ea10482.jpeg","chapterNumber":18},{"productId":193,"resume":"Seiya is an acclaimed star and a genius student who is liked by everyone. Even so, Seiya has a hidden side to him that no one knows about... Lately, he can't stop thinking about Tatsumi, who's in the same year as him.\nOne night, just as they had started bonding together, Seiya confessed his feelings to Tatsumi and kissed him. But all of this occurred in front of a cemetery, which freaked out the scaredy cat, Tatsumi. And because he was scared, Tatsumi was unable to reciprocate with honesty.\nBut the next day, their relation became...?!\nThis is a series of love stories in an all boys institute!\n(Source: Girls' Generation Scanlations)","productName":"Kaminari Soda","img":"https:\/\/media.kitsu.io\/manga\/193\/poster_image\/large-99bcd6bf0a93ad4bb69079bde1ae80f5.jpeg","chapterNumber":5},{"productId":194,"resume":"Galactic Calendar year 2039, Mars. Shiraishi Ageha is sentenced to death because of her being accused of killing four people. Kisaragi Ayako is the chief of prison where she's locked up and the man who is guarding her is Kenzaki Kyousuke. A story about finding the truth.","productName":"Ageha wo Ou Monotachi","img":"https:\/\/media.kitsu.io\/manga\/194\/poster_image\/large-fae00610c61a4c1e5ab004fc0f69214a.jpeg","chapterNumber":18},{"productId":195,"resume":"Takuya is a normal Japanese elementary student whose mother died not very long ago, leaving him alone with his father and his baby brother Minoru. But his father is a busy man, and Takuya has to look after Minoru. Because of this responsibility that would normally never burden a child of his age, Takuya sometimes resents his fate and his baby brother... but his love for Minoru gives him the strength to carry on.\n(Source: ANN) Included one-shots:\nVolume 2: Time Limit\nVolume 4: Secret Boy ni Tee Dasuna!!\nVolume 6: Baka de Karukete Wagamama de\nVolume 15: Natsu to Kimi no Irradiation","productName":"Akachan to Boku","img":"https:\/\/media.kitsu.io\/manga\/195\/poster_image\/large-e3ada933d39035d353a9c41757684c0f.jpeg","chapterNumber":108},{"productId":198,"resume":"Miami Guns is an action\/parody manga about Yao Sakurakoji and Lu Amano, two teenage police officers living in Miami City.","productName":"Miami☆Guns","img":"https:\/\/media.kitsu.io\/manga\/198\/poster_image\/large-bf9fd6a9877ee6b35bca22c7d59f566f.jpeg","chapterNumber":19},{"productId":200,"resume":"No synopsis has been added for this manga yet.Click here to update this information.","productName":"Seishun Rikon","img":"https:\/\/media.kitsu.io\/manga\/200\/poster_image\/large-0b0b295a116d9996c6b79ae3af99b60a.jpeg","chapterNumber":8},{"productId":201,"resume":"Story about a tomboyish girl Subaru who's always cast in male roles for school plays and her subsequent confusion over her neighbour, Shun. \n(from M-U)","productName":"Little Star","img":"https:\/\/media.kitsu.io\/manga\/201\/poster_image\/large-27db501c51bda00870efbf96dec0c465.jpeg","chapterNumber":1},{"productId":202,"resume":"The story follows Alice Seno, a 15-year-old girl forever shadowed by her older sister Mayura, who is good at everything she does. At school she is known as \"Mayura's little sister\" and is relentlessly tormented by the older girls who know that Alice is too week to fight back.\nAlice harbors a deep affection for Kyo Wakamiya, a handsome upperclassman who is on the archery team with Mayura. On the way to school one day, Alice rescues a white rabbit from the road despite the danger to herself, but gets rescued by Kyo and receives a bracelet with a single red stone. The rabbit she saves, however, is no ordinary rabbit. She reveals her true form to Alice and introduces herself as Nyozeka. Alice is told that she is destined to become a Lotis Master. The Lotis Masters use the power of words and communication to enter the Inner Heart of others. It is a powerful ability to be used carefully as Alice soon finds out.\nUsing the power of the Lotis Words, which reveal themselves to be in the form of runes, Alice accidentally makes her older sister disappear during a dispute over Kyo, whom Mayura had begun dating. Alice then must use the Lotis Words to try and bring her sister back from the dark. She is joined by Kyo who proves to have the Lotis powers as well, and by Frey, another Lotis master who had trained with the masters and arrives with the intention to marry Alice. Unfortunately, Mayura has been taken by the power of the Maram Words, the dark reflection of the Lotis Words. Their only hope lies in Alice and Kyo becoming the legendary Neo-Masters to discover the lost word bonding both Maram and Lotis.\n(Source: Mangatraders)","productName":"Alice 19th","img":"https:\/\/media.kitsu.io\/manga\/202\/poster_image\/large-a82d46d6c604a471b11ea894e1a62cf5.jpeg","chapterNumber":40},{"productId":204,"resume":"1-3) Oh My Bitch!\nWhen Wada's friend, Tsukasa, comes begging for a favor Wada is leery, seeing as he's not receiving anything out of the deal. Yet Tsukasa promises that he'd be properly compensated for his troubles. Wada has no idea how Tsukasa plans to compensate him, that is until a strange guy happens upon his doorstep and offers to do anything he asks.\n4) Father\nOn that hill, where there is acceptance, Father is always happy and smiling, this is where Inaho, a faithful church goer, finds Father. Begging to hear Father's stories, he can't help but admit he finds Father very \"pretty\", all the same Father thanks Inaho for being \"beautiful\". Neither of them realize, the other is hiding a much darker secret than any of them could ever fathom.\n5) Welcome Back, Darling\nNoticing Shiro's lack of shame, Shino's roommate begins to wonder if their just \"fuck buddies\" or if there is more. Upon seeing his neighbors act lovey-dovey he begins to yearn for the same thing with his precious roommate, Shino.\n6) This is Bad\nWhen Akasawa unexpectedly meets an old classmate Aoki, he realizes that Aoki lives close to his job! So upon that realization he invites himself over, in hopes of \"cultivating their friendship\" yet Aoki admits not even knowing they were in the same class. That doesn't matter to Akasawa, who decides on his own that he'll visit Aoki everyday on his break to cool off and maybe get to know the strange Aoki better.\n7) Goodbye Lovers\nDespite the old and weak fence on the roof of the school, Toyama can't help but be attracted to it. His thoughts turn dark when his friend Hayano comes to meet him on the roof, wondering if it'd be okay to simply jump off. Hayano scolds him for being so dark, and tells him to talk to him before being rash, but that's not all. It's their last goodbye, how should they remember one another?","productName":"Baby Bitch!","img":"https:\/\/media.kitsu.io\/manga\/204\/poster_image\/large-44600cd355eabf702f4f6c321c35b3e2.jpeg","chapterNumber":7},{"productId":205,"resume":"Beautiful creatures called 'Alichino' grant any wish to those who find them--but at a price!\nA young lady searching for an Alichino wants to bring her brother back to life. She meets Tsugiri, a handsome young man who she thinks is an Alichino. While Tsugiri turns out to be a mere mortal, he does have a mysterious connection with these rare creatures--a connection that brings him and those around him grave danger! (Source: Tokyopop)","productName":"Alichino","img":"https:\/\/media.kitsu.io\/manga\/205\/poster_image\/large-39a7212896d5e86ba28bc43e63b0a311.jpeg","chapterNumber":17},{"productId":207,"resume":"No synopsis has been added for this manga yet.Click here to update this information.","productName":"Private Lovers","img":"https:\/\/media.kitsu.io\/manga\/207\/poster_image\/large-f1fc940b0590af942defc27d89b47a45.jpeg","chapterNumber":10},{"productId":208,"resume":"A seemingly ordinary modern day teenager, Yuri, is suddenly whisked away to the Hittite empire in ancient Anatolia, where an ambitious queen wants the girl for a blood sacrifice in order to murder all heirs but her son, thus seizing control of the throne. Luckily, the timely intervention of Prince Kail saves Yuri from the queen's grasp. Kail promises to send Yuri back to her home, but the queen's persistent schemes to kill them both, plus their growing feelings for each other, keep those plans delayed.\n(Source: Wikipedia)Included one-shot:\nVolume 28: Orontes Renka","productName":"Sora wa Akai Kawa no Hotori","img":"https:\/\/media.kitsu.io\/manga\/208\/poster_image\/large-31240149dd5323731c3e997600b338f2.jpeg","chapterNumber":96},{"productId":211,"resume":"In the future, the most popular game in the world is Angelic Layer. Contestants must raise and train their own 'Angels' (or fighting dolls) to compete in tournaments. Enter Misaki Suzuhara, sixth grade Angelic Layer prodigy. With her speed-type angel, Hikaru, many people think Misaki stands a chance at winning the championship. She'll have a lot of help along the way, but the road to victory will be not be an easy route, especially for someone as young as Misaki.\n(Source: Tokyopop)","productName":"Angelic Layer","img":"https:\/\/media.kitsu.io\/manga\/211\/poster_image\/large-f6276d2bf763f01af0a39016e858e7a4.jpeg","chapterNumber":27},{"productId":214,"resume":"Kazuaki's life is so ordinary and dull, he just can't tell the difference between one day and another. But one night, by total accident, he witnesses a rather embarrassing situation, which unexpectedly turns his life upside down...\n(Source: MU)","productName":"Calling","img":"https:\/\/media.kitsu.io\/manga\/214\/poster_image\/large-9ef36f7f0107abbdb418b185b33f856b.jpeg","chapterNumber":7},{"productId":216,"resume":"How does a girl declared by her childhood friend to be gloomy and anti-social transform into a cutie “as sweet as sugar” and every boy’s dream? And does every boy really dream of girls “as sweet as sugar”? Or is the rich and deep taste of coffee better than sugary glitter? The story of a girl who may not be sweet, but sure is as addictive as black coffee! \n(Souce: Aerandria Scans)","productName":"Black Coffee","img":"https:\/\/media.kitsu.io\/manga\/216\/poster_image\/large-18a5cb6cf1b2b244b9e351b8fa9d071e.jpeg","chapterNumber":1},{"productId":217,"resume":"In order to determine which hot spring is to be the top overall, all of the hot springs within the region enter an unofficial tournament. The tournament is simple battle of capturing the enemy's flag, but the battle itself goes beyond any human measure. It is customary for a female to enter these battles. Carrying their pride and their flag, their only objective is to defeat their opponent. Hence they are commonly called \"Fighting Spring Princesses.\" Kikko, the Fighting Spring Princess of the Aizen Hot Spring Temple, is an eccentric, hot-blooded person who is going to have her debut battle. Sit back and enjoy the story of Kikko's path to becoming queen of all hot-springs! \n(Source: MangaHelpers)","productName":"Bakunetsu Sentouki","img":"https:\/\/media.kitsu.io\/manga\/217\/poster_image\/large-90c21033c74ae3aadaa43067c543b6f5.jpeg","chapterNumber":12},{"productId":218,"resume":"Roland falls ill for several days, but wakes to a lovely surprise. Not only does he feel better, but he has a handsome new butler waiting on his every need. Roland can’t help but fall in love, and the young Eric can’t help but give in to his master. As Roland continues to recover, he begins to doubt himself and Eric’s affection. Is it genuine, or just part of his job? And when Roland’s wayward wife returns to the estate, will Eric have learn his place as a servant? Or if it is love…can it conquer class, age, and even another marriage?\n(Source: DMG)","productName":"Nichiyoubi ni Umareta Kodomo","img":"https:\/\/media.kitsu.io\/manga\/218\/poster_image\/large-ab9abbc4d77d39a31768fe2250f28be3.jpeg","chapterNumber":8},{"productId":219,"resume":"Aya and her twin brother Aki thought they were going to a celebration of their sixteenth birthday at their grandfather's home, but the funeral-like atmosphere tips them off that something's not right. Their \"birthday present\" turns out to be a mummified hand--the power of which forces an awakening within Aya, and painful wounds all over Aki's body! Grandfather Mikage announces that Aki will be heir to the Mikage fortune, and Aya must die! But Aya has allies in the athletic cook and martial artist Yûhi, and the attractive, mysterious Tôya. But can even two handsome and resourceful guys save Aya when it's her own power that's out of control?\n(Source: Viz)","productName":"Ayashi no Ceres","img":"https:\/\/media.kitsu.io\/manga\/219\/poster_image\/large-d9cece8566de1dafd9bd51aa3b943fbc.jpeg","chapterNumber":83},{"productId":220,"resume":"While visiting the National Library, junior-high students Miaka Yuuki and Yui Hongo are transported into the world of a mysterious book set in ancient China, “The Universe of The Four Gods.”  Miaka suddenly finds herself with the responsibility of being the priestess of Suzaku, and must find all of her celestial warriors for the purpose of summoning Suzaku for three wishes. However, the enemy nation of the god Seiryuu has manipulated Yui into becoming the priestess of Seiryuu. As enemies, the former best friends begin their long struggle to summon their respective gods and obtain their wishes…\n[Written by MAL Rewrite]","productName":"Fushigi Yuugi","img":"https:\/\/media.kitsu.io\/manga\/220\/poster_image\/large-e90d652b18a85c3058d9987792fe0986.jpeg","chapterNumber":106},{"productId":222,"resume":"Minamoto-kun has a face pretty enough to make people think he's a girl. Because of his face, he was bullied by the girls in middle school who were jealous of his good looks. He developed a fear of women due to the trauma, and for that reason chose to attend a high school for boys. Just as he enters college and makes a promise to himself to overcome the trauma of his past, his father remarries and asks him to move out of the house. His father arranges for him to live with his aunt (Minamoto-kun's father's younger sister) for the time being. She is an extremely beautiful woman who is also a non-tenured professor at his college. When he arrives at her apartment, she shows him her breasts and tells him that he will be her \"guinea pig\" in her reverse Hikari Genji project.\n\n(Source: MU)","productName":"Minamoto-kun Monogatari","img":"https:\/\/media.kitsu.io\/manga\/222\/poster_image\/large-fa304e0120b380d623ae74d8c5a1c68a.jpeg","chapterNumber":360},{"productId":224,"resume":"It's not manga, it's Azumanga! − smart, fun and totally addictive. Created by the iconoclastic Kiyohiko Azuma, Azumanga Daioh is strongly character driven, taking the reader through the daily tribulations of Miss Kurosawa, Miss Yukari, the wild Tomo, hair-triggered Yomi, ditzy Osaka, brash Kagura, cute Chiyo-chan and athletic (but girly) Sakaki.\n\n(Source: ADV)","productName":"Azumanga Daioh","img":"https:\/\/media.kitsu.io\/manga\/224\/poster_image\/large-0abe45de75745d3dd794d8e36c027da0.jpeg","chapterNumber":39},{"productId":225,"resume":"Kyoko Suomi is the princess of Earth in the 30th century. Kyoko lives among the commoners, unwilling to reveal her true identity and ascend the throne. The king will allow Kyoko to live as she pleases if she can revive her twin sister Ui, who has been trapped in time since birth.\n(Source: Viz)","productName":"Time Stranger Kyoko","img":"https:\/\/media.kitsu.io\/manga\/225\/poster_image\/large-bc581b977cd9b699830adcbb0ced3ae3.jpeg","chapterNumber":13},{"productId":228,"resume":"A prequel to the original series, the story centers on Chiffon Fairchild's first year at West Genetics prior to her becoming Student Council President, and also explains the origin of her title, \"The Unmatched Smiling Monster\".\n(Source: Wikipedia)","productName":"Freezing: First Chronicle","img":"https:\/\/media.kitsu.io\/manga\/228\/poster_image\/large-6a0f1a4f743b0590b27a8be6ea44f91b.jpeg","chapterNumber":4},{"productId":229,"resume":"A mysterious creature has fallen from the sky and landed right at young Yuina's feet! Branded as the master of this new angelic being, Yuina is forced into an otherworldly pact, one that will take her beyond the clouds and into battle against a new and yet hauntingly familiar evil, one that patiently waits in the shadows. (Source: ADV)","productName":"Angel\/Dust","img":"https:\/\/media.kitsu.io\/manga\/229\/poster_image\/large-3e80a91692fbeb95a759fa8f5e5eec65.jpeg","chapterNumber":9},{"productId":231,"resume":"Self-styled Kogal queen Kotobuki Ran and her friends just wanna have fun, which includes shopping, hanging out, and scamming meals off gullible guys. Unfortunately, their \"hood\"—Shibuya—is in constant danger of being despoiled by dirty old men, street gangs, nasty Kogal rivals, and other societal evils. But with a little help from her friends and a toughness born of coming from a family full of cops, Ran takes on the bad guys (and gals) with gusto!\n(Source: CMX)","productName":"Gals!","img":"https:\/\/media.kitsu.io\/manga\/231\/poster_image\/large-1796c56d31d5ed7764be254ebd099680.jpeg","chapterNumber":40},{"productId":239,"resume":"All Miki Koishikawa wanted was an ordinary family and that's exactly what she had until her parents decided to move in with another couple and turned Miki's world upside down. Now she lives in a house with four parents and her totally cute stepbrother Yuu. It's bad enough being brought into her parents' strange soap opera, but Miki will star in a soap of her own as she deals with friends having affairs, trying to survive in school and ending up torn between her long-time crush, Ginta, and her new stepbrother!\n(Source: Tokyopop)","productName":"Marmalade Boy","img":"https:\/\/media.kitsu.io\/manga\/239\/poster_image\/large-0c972f0026596fe2bcb044e6cfb2bf6d.jpeg","chapterNumber":40},{"productId":241,"resume":"Tsukino Usagi is 14 years old and in her second year of middle school. She's a bit of a crybaby and klutzy. However, she can transform into a warrior of justice, Sailormoon! An eternal classic that should be read by all.\n(Source: MU)","productName":"Bishoujo Senshi Sailor Moon","img":"https:\/\/media.kitsu.io\/manga\/241\/poster_image\/large-f2eae261d9a688554706edbe3f8c5717.jpeg","chapterNumber":61},{"productId":244,"resume":"It is the year 4088. It has been over one thousand years since the Crisis of Systems (Lost Property), which resulted in the destruction of four planetary systems, leaving only a single inhabitable planet, Zion. Mankind is forced to live in space colonies, since that one planet is constantly being invaded by alien life forms that have come to be known as Victim.\nTo stop the aliens and to allow people to land on Zion, mankind has developed the astronomical humanoid weapons, Ingrids, also known as Goddesses. G.O.A. (Goddess Operation Academy) is a school dedicated to the training of young men to pilot these Ingrids ... (Source: Tokyopop)","productName":"Megami Kouhosei","img":"https:\/\/media.kitsu.io\/manga\/244\/poster_image\/large-02530511e79a98fa92dba95fd988ecd7.jpeg","chapterNumber":27},{"productId":245,"resume":"Nobunaga was just taken out of power and there are signs of civil unrest even in the far reaches of Kyuushuu. A small precinct of Kyuushuu is ruled by the Harima family and headed by the 15 year old Harunobu who. despite everyone’s hopes, has no interest in war nor being a lord. Instead, he spends his time surveying the land to make maps or record plant and animal life. Harunobu’s dream is to create an encyclopedia that contains all the information in the world. So when the opportunity to travel the world and eventually end in Rome appears, Harunobu leaves the land in capable hands and sets sail on his journey that he has dreamed of his entire life.\n(Source: MangaHelpers)","productName":"Samurai Ragazzi: Sengoku Shounen Seihou Kenbunroku","img":"https:\/\/media.kitsu.io\/manga\/245\/poster_image\/large-aa89ae59e6b72710bef6dee7e81623dd.jpeg","chapterNumber":39},{"productId":246,"resume":"Our almighty Luu Bu meets his crisis for all life: he is taken to the future world with the appearance of an elementary schoolgirl.\n(Source: MU)","productName":"Majikaru Musou Tenshi Tsuki Irase!! Ryofuko-chan","img":"https:\/\/media.kitsu.io\/manga\/246\/poster_image\/large-90851d7536e960c7c275b063576a6b21.jpeg","chapterNumber":1},{"productId":249,"resume":"No synopsis has been added for this manga yet.Click here to update this information.","productName":"Ayakashidou no Hourai","img":"https:\/\/media.kitsu.io\/manga\/249\/poster_image\/large-fbe959a4c6767a71fa1ca910fe165fd7.jpeg","chapterNumber":1},{"productId":251,"resume":"Sakis, the Scion and Godslayer, gets entangled in a deadly incident when an unknown ship enters Lagoonarian airspace. After uncovering explosives along with the seeds of Abomination, Sakis begins a quest to uncover the mysteries surrounding the Ancient Gods! (Source: Amazon)","productName":"Lagoon Engine Einsatz","img":"https:\/\/media.kitsu.io\/manga\/251\/poster_image\/large-ed005cab860f47b1611c80116b9c6567.jpeg","chapterNumber":10},{"productId":252,"resume":"Kamoi is an upstanding secretary for his political idol in the National Diet. Takagi was supposed to be just a one-night stand – until Kamoi finds out he is a young congressman from the opposing party! Soon, both men experience big shake-ups in their careers, but could these changes possibly bring them together?\n\"Would That Not Be The Case!\" brings hot romance straight to the halls of political power. Read on as both men examine their political purposes in-between cross-party warfare and hot, steamy nights. What is Takagi’s motivation for being in the Diet? What is it that makes Kamoi’s job so painful? And when Takagi falls hard, who can him back to the top?\n(Source: DMG)","productName":"Sonna Baai ja Nai Darou!","img":"https:\/\/media.kitsu.io\/manga\/252\/poster_image\/large-99adbfc4ac29eb4d902d4f1a85795cbd.jpeg","chapterNumber":2},{"productId":253,"resume":"No synopsis has been added for this manga yet.Click here to update this information.","productName":"Kimitaka no Ateru!","img":"https:\/\/media.kitsu.io\/manga\/253\/poster_image\/large-21b8b1ec6215245563cb70bba3dc38bd.jpeg","chapterNumber":8},{"productId":254,"resume":"Aliens have landed on Earth and are now a normal part of society. These beautiful beings have been given the name \"DearS\" and are trusted and welcomed by most humans. In order for the \"DearS\" to learn Earth's customs, they are sent to random high schools to \"home-stay.\" When Takeya helps a DearS in his school, she calls him \"Master.\" Thus begins the humorous life of Takeya and his sexy alien follower, Ren, who tries to figure out the wacky customs of this place called Earth! (Source: Tokyopop)","productName":"DearS","img":"https:\/\/media.kitsu.io\/manga\/254\/poster_image\/large-7d040e8d04bb659c59f124030ed69e9d.jpeg","chapterNumber":47},{"productId":256,"resume":"Dingi, the prince of an exotic middle eastern land, has always been fascinated with the Japanese culture,due to his father's obsession. as a prince, he has a obligation to marry at the age of 20, however, the year before that is devoted to pleasure with whomever Dingi wants. thus, it seems only natural that Dingi would go to japan to find himself the perfect lover. however, when he arrives, things don't go as they planned when Dingi falls in love with Gen, his host. who is this Gen and why does he refuse the prince's advances? will Dingi ever win Gen's love?\n(Source: From SOUL.ly PASSION.ate.)","productName":"The Hinanomori","img":"https:\/\/media.kitsu.io\/manga\/256\/poster_image\/large-1270ed87ca55f5687e2914a902672749.jpeg","chapterNumber":11},{"productId":257,"resume":"In the recesses of mountain... there's a bus stop at outskirts of a village, it's called \"Hinamizawa bus stop\". Rika, a female high-school student, together with her junior, Mion visit this place. Twisted relationships that are concerned with the dam construction in Hinamizawa, and the stories of the curse of \"Oyashiro-sama\" that takes root in this area. What waiting for them is a tragedy, or else...?\nThis manga adapts Hinamizawa Teiryūjo, the unreleased stage play that Ryukishi07 wrote and eventually tranformed into the Higurashi no Naku Koro ni game\/anime\/live-action franchise.","productName":"Hinamizawa Teiryuujo: Higurashi no Naku Koro ni Genten","img":"https:\/\/media.kitsu.io\/manga\/257\/poster_image\/large-bf9d823c0cd54941aa383ac2d75a9bc1.jpeg","chapterNumber":10},{"productId":258,"resume":"After a traumatic incident, Jun Sakurada refuses to interact with the outside world and return to school--he even shuts out his sister, his closest friend. Jun spends most of his time online buying spiritual items that are obvious rip-offs. One day he finds a website that curiously enough asks him to put his order in his desk drawer. Thinking it's a joke, Jun plays along. The following day a suitcase arrives containing a doll named Shinku... that comes to life before his very eyes! Welcome to the world of Rozen Maiden, where Jun must enter an all-new reality to protect and serve a living doll...\n(Source: Tokyopop)","productName":"Rozen Maiden","img":"https:\/\/media.kitsu.io\/manga\/258\/poster_image\/large-455c7020521e4778649dd9894cd5e52b.jpeg","chapterNumber":46},{"productId":259,"resume":"Michiru Kita’s a weak-spirited girl who has a hard time saying what’s on her mind. One day, she notices mysterious, ring-like markings around the necks of two of her classmates, Chika Akatsuki and Shito Tachibana — two boys who miraculously survived a horrible accident six months before. Michiru, possessing the rare ability to see these rings, knows that they warn of impending death. Thinking that, perhaps, she can do something to save her classmates’ lives, she approaches them... but it seems the boys have already made a different kind of deal and garnered themselves a heavy debt \n(Source: Yen Press)","productName":"Zombie-Loan","img":"https:\/\/media.kitsu.io\/manga\/259\/poster_image\/large-6b42a4f444aeb9834c9bb3641ee4020f.jpeg","chapterNumber":83},{"productId":260,"resume":"A spin-off yonkoma (4-panel) comics style of Shugo Chara which focuses on Amu's guardians.","productName":"Shugo Chara-chan!","img":"https:\/\/media.kitsu.io\/manga\/260\/poster_image\/large-59d6b8d409ea961ef629650ea4902a0d.jpeg","chapterNumber":79},{"productId":262,"resume":"Miyoshi Yoshiko is working her way as a model by doing various modeling gigs for her agency. After one of those gigs causes her to lose her job as a model, she now faces a desperate situation of being broke and unemployed. Things start to look up when she gets offered another modeling job, but this time it’s modeling for Chuujou Tarou, the lecherous sculptor who got her fired in the first place! How will Yoshiko handle working for a perverted employer who can’t keep his hands off her–not because he’s attracted to her, but because he likes her bone structure?!  (Source: Aerandria Scans)\nNote: \nVolume 1 of this series includes the one-shot \"Blanc Marie\" originally published in Petit-Comic in April 2009. Blanc Marie is about a girl who gets left at the altar by her fiance, but still ends up marrying him b\/c his younger brother acts as his substitute.   \nVolume 2 of this series includes the one-shot \"Biyaku\" (Aphrodisiac \/ sometimes incorrectly written as Kobi Kusuri) originally published in Ane-Kei in May 2010.\nBiyaku is about a girl who tries to set up her best friend from pharmacy school with beautiful girls as a way of showing her appreciation for the countless times he forced her to keep working on her thesis to graduate, even though at the time, she just wanted to quit everything after a horrible break-up.","productName":"Venus ni Arazu","img":"https:\/\/media.kitsu.io\/manga\/262\/poster_image\/large-99e1e63100eb1c0b98d4530a84c21fbb.jpeg","chapterNumber":9},{"productId":263,"resume":"Sora,the son of a farmers family who lives in a small village comes to Tokyo. He visits a gay bar curious to experience sex with a man at least once before his marriage. There he meets Taiyou and the sex they have makes Sora know that he is really gay. But the coming out of a farm boy and the relationship with Taiyou may not come all that easy to achieve.\n(from Geisha_X)","productName":"Organic Sons","img":"https:\/\/media.kitsu.io\/manga\/263\/poster_image\/large-33a15b6584ac3f02a7caff59953c87b1.jpeg","chapterNumber":7},{"productId":265,"resume":"Hajime Amemiya is a bubbly high schooler who has a problem: He's in love with surly upperclassmen Saburo Ninomiya! Hajime is ready to do whatever it takes to win the love of Saburo, but that may be a bit harder then it sounds. Hajime has to contend with a co-worker that wants him, Saburo's childhood friend, and the fact that Saburo is too much of the strong silent type to ever let Hajime know if his advances are working. Will Hajime be able to win over the heart of his sempai?\n(Source: DMG)","productName":"Boku no Senpai","img":"https:\/\/media.kitsu.io\/manga\/265\/poster_image\/large-08aa85556109e61f464d5b9db425e88e.jpeg","chapterNumber":10},{"productId":266,"resume":"Everybody at Seiyo Elementary thinks that stylish and super cool Amu has it all: But nobody knows the real Amu, a shy girl who wishes she had the courage to truly be herself. Changing Amu’s life is going to take more than wishes and dreams–it’s going to take a little magic! One morning, Amu finds a surprise in her bed: three strange little eggs. Each egg contains a Guardian Character, an angel-like being who can give her the power to be someone new. With the help of her Guardian Characters, Amu is about to discover that her true self is even more amazing than she ever dreamed.\n(Source: Del Rey)\nIncluded one-shot:\nVolume 12: Shugo Chara! Encore!","productName":"Shugo Chara!","img":"https:\/\/media.kitsu.io\/manga\/266\/poster_image\/large-1522f663d33fb44c8ba19ea2fbc8d1a9.jpeg","chapterNumber":55},{"productId":267,"resume":"Tohru Honda is a high school freshman who is having a serious bout of misfortune.  Not only was she recently orphaned with the tragedy of her mother's death, but she also has no where to live and is currently residing in a tent!  However, when her luck to seems to be at its worse, she meets the Sohma family - and is invited to stay with them in exchange for taking care of the household chores.\nBut it isn't long before Tohru discovers the Sohmas have deep a secret.  The family is cursed by the spirits of the Chinese Zodiac, and some of the children born into the Sohma family are possessed by these spirits.  When possessed, they cannot be \"huggled\" by the opposite sex, or they transform into their respective Zodiac animal!\nHowever, this doesn't phase Tohru, who promises to keep their secret.  She continues living with them, and her grave humbleness and thankfulness never wanes.  As a result, they come to be very important people in her life, and the Sohmas begin to realize how very lucky they are to have her.","productName":"Fruits Basket","img":"https:\/\/media.kitsu.io\/manga\/267\/poster_image\/large-ba6ca2faa8c11627b0786cafca13e7c2.jpeg","chapterNumber":136},{"productId":269,"resume":"No synopsis has been added for this manga yet.Click here to update this information.","productName":"Chintsubu dj - Puchi","img":"https:\/\/media.kitsu.io\/manga\/269\/poster_image\/large-8190452ffc857b66f424e9c0a24ee099.jpeg","chapterNumber":1},{"productId":270,"resume":"A dad that's a professional model passed on his stunning male looks to his only child, Kiri...but unfortunately, that Kiri is a girl! So Kiri ends up becoming a male model herself somehow. Tohya Enishi is the love of her life, and enters the world of male modeling in order to protect him. But things get really complicated when others start to fall for Kiri and her male alter ego! (Source: Tokyopop)","productName":"Never Give Up!","img":"https:\/\/media.kitsu.io\/manga\/270\/poster_image\/large-5f21f0fe182204c48a51d4c7b3614e4a.jpeg","chapterNumber":76},{"productId":271,"resume":"1) Not For Sale!\nNozomi is a boring and late-blooming college student. His classmate, Ryuji, is an extremely dangerous delivery host. When Nozomi witnesses a steamy kiss between Ryuji and a male teacher, he's thunderstruck! His eyes can't seem to stop following Ryuji's movements. If Ryuji has any say (and he does!), Nozomi is just about to get a taste of paradise.\n2) Go Home, Good Boy\n3) Love Slave\n4) Hitori de Yare yo!\nComedy duo Masata and Naru aren't doing very well, but they're still together. Mainly because Masata is helpless and Naru can't leave him alone. But when Naru finds out Masata's been keeping secrets things may fall apart.\n5) Love Cocktail\nWhen unfortunately named Minami Haruo wanders into Sagawa's bar, Sagawa gives him his special aphrodisiac cocktail and has his way with him. But who is Minami really? And is he ever coming back?\n6) Air\nNobuyuki and Yugi became a family 7 years ago, when their parents remarried. A year later after that, Yugi's father got into an accident which left Yugi a scar inside himself. Yugi convinced himself that everyone around him will disappear one day, and that in the end he will end up alone, always. Nobuyuki disagree and claim that they are family, and so they will always be together. \"If you can, show it to me. Since you are not my brother, from now on... you are air\" is what Yugi said. What will happen to this pair?\n7) Be Near Me\n(from M-U)","productName":"Not For Sale!","img":"https:\/\/media.kitsu.io\/manga\/271\/poster_image\/large-45f46d95564866b2ffcbcd84396037a4.jpeg","chapterNumber":7},{"productId":274,"resume":"In the Royale School, because of his nice name, Ayamoji Kokuei was being targeted by a yakuza’s son, Shirogane Michihiko (real name: Kintarou). Ayamoji began to skip lessons and repeat grades to avoid meeting Shirogane. When they met six years later, Ayamoji drugged Shirogane and they got intimate. Ayamoji left after that and reappeared five years later. Would the two lovebirds finally be together?\n(Source: Attractive Fascinante)","productName":"Hatsujoukei Drags","img":"https:\/\/media.kitsu.io\/manga\/274\/poster_image\/large-0e33e6b7dab08e10ee6d9ddbd344c5a6.jpeg","chapterNumber":5},{"productId":275,"resume":"By night, junior high student Yoshimori Sumimura is a \"kekkaishi\"--a demon-hunter who specializes in creating magical barriers around his prey. By day, Yoshimori's got some other demons to battle: an addiction to sweets and a seriously crotchety grandfather! Yoshimori's pretty 16-year-old neighbor and childhood friend, Tokine Yukimura, is also a kekkaishi, but their families are feuding over who is the true practitioner of the art. \n(Source: Viz)","productName":"Kekkaishi","img":"https:\/\/media.kitsu.io\/manga\/275\/poster_image\/large-8b4bbeb0ce5e641c0172cdcefccea4da.jpeg","chapterNumber":345},{"productId":276,"resume":"One day, Sakura Kinomoto accidentally opened a book containing dozens of magical cards called Clow Cards, and they scattered around her hometown of Tomoeda. Sakura was chosen to be the master of these cards and has been enlisted by the sun-based guardian Kerberos to use her magic and reclaim these cards before they make any more trouble in town. She is encouraged by her best friend Tomoyo Daidouji, and she meets a rival cardcaptor, Syaoran Li, who is a direct descendant of the creator of the Clow Cards. (Source: Anime News Network)","productName":"Cardcaptor Sakura","img":"https:\/\/media.kitsu.io\/manga\/276\/poster_image\/large-9b78c3a8a8d08d952b0ec8581b0b8dae.jpeg","chapterNumber":50},{"productId":278,"resume":"Hideki's just like every other guy in the 22nd century. He just wants a good job, a good car, and a sexy robot girlfriend to call his own. Until he lands a job, he'll never be able to afford his own 'Persocom' companion. Hideki's luck changes when he discovers Chi--an adorable but seemingly stupid Persocom--tied up in a pile of trash. His first robot companion turns out to be a lot more responsibility than he expected, and she gets him into quite a few embarrassing situations. It's 'boy-meets-girl' for the cyber age. (Source: Tokyopop)","productName":"Chobits","img":"https:\/\/media.kitsu.io\/manga\/278\/poster_image\/large-0ab33368bf6af9bfe079487d4c999c58.jpeg","chapterNumber":88},{"productId":280,"resume":"A drugstore that deals in medicine ... and danger! Kazahaya Kudo has a gift. When he touches a person or an object, he sees visions. With no money and no place to stay, Kazahaya was out of luck until fate brought him to the Green Drug pharmacy. Now, in exchange for working in the store, he gets room and board. But in order to make ends meet there's a catch ... he must take on 'special' assignments from his boss that can only be handled by someone with Kazahaya's gift. With the help of his co-worker and roommate Rikuo, who has unusual powers of his own, Kazahaya finds himself on missions most surreal.\n(Source: Tokyopop)","productName":"Gohou Drug","img":"https:\/\/media.kitsu.io\/manga\/280\/poster_image\/large-1ddf5293501dc1d4639c78a0aeae8f17.jpeg","chapterNumber":16},{"productId":282,"resume":"One night, a man named Shuichiro Kudo comes across a tiny angel trapped on a tree branch. He frees her, and in return she offers to grant him a wish. However, Shuichiro is a successful doctor, with a home and everything he needed; he declined the angel's offer. The persistant angel, named Kohaku, refused to give up, stating that \"some wishes cannot be fufilled by oneself.\" After settling in at Shuichiro's home, Kohaku reveals her mission to track down the Angel Master of Wind, Hisui, who has abandoned heaven. That is, if her devil rival and his two catty servants would let her leave long enough to do so...\n(Source: ANN)","productName":"Wish","img":"https:\/\/media.kitsu.io\/manga\/282\/poster_image\/large-6fea7197962734151699f27b040e6511.jpeg","chapterNumber":23},{"productId":284,"resume":"Hitoshi Kobe is pretty dumb, not good at sports, and extremely unpopular. The only thing he IS good at really is creating artificial intelligence programs on his computer. His greatest work is number 30, one which very accurately simulates talking to an actual girl. One dark and stormy night, a freak lightning strike causes number Thirty to emerge from his computer screen as a real girl, and sends Hitoshi's life on a turn for the crazy.\n(Source: ANN)","productName":"AI ga Tomaranai!","img":"https:\/\/media.kitsu.io\/manga\/284\/poster_image\/large-97c18de5170cbb0548223fa55bc381b6.jpeg","chapterNumber":55},{"productId":288,"resume":"A cursed video that circulates on the net, inexplicable repeated massacres in a lost mountain hamlet... the police decides to return in a special element difficult to master: Amamiku Matsuri, a medium originally from Okinawa can \"see\" and communicate with lost souls, but she was taken away from these cases because of her mental instability and her tendency to violence. But in the course of an investigation, the past catches up to Matsuri: placed in a position of victim, perpetrator and judge in one case...","productName":"Mabui no Kotowari","img":"https:\/\/media.kitsu.io\/manga\/288\/poster_image\/large-61cccc51bf62512f560bdea3d06c12d2.jpeg","chapterNumber":13},{"productId":289,"resume":"Vesper is a secret agency fighting an army of alien invaders by using super-powerful battle androids. Mahoro is Vesper's most powerful battle android and has won many battles, but she has little operating time left and soon will cease to function. However, if she lays down her arms and conserves her remaining power, the time she has left can be prolonged to just over a year. Mahoro is given an opportunity to live the remaining time she has as a normal human. She chooses to live as a maid for Suguru, a phenomenally messy high school student who lives by himself after his family passed away. (Source: ANN)","productName":"Mahoromatic","img":"https:\/\/media.kitsu.io\/manga\/289\/poster_image\/large-b0c1e715f53f07b083288f1be54f345f.jpeg","chapterNumber":47},{"productId":291,"resume":"Chun Hyang is a young girl who lives in a village ruled by a tyrannical Yang Ban. When her mother Wall Mae tragically dies, Chun Hyang sets of on an adventure with Mong Ryong, a young traveller who holds the empire's most powerful office as the Am-Hang-Osa. Based on a Korean legend.\n(Source:ANN)","productName":"Shin Shunkaden","img":"https:\/\/media.kitsu.io\/manga\/291\/poster_image\/large-683f36881661cbd86a119d1b6d6abd06.jpeg","chapterNumber":3},{"productId":293,"resume":"Kazuhiko is a young, but already deeply wounded black ops agent of a baroque, retro-tech future - pulled out of retirement to escort Sue, a mysterious waif, to a destination she alone knows. Suu and Kazuhiko have never met . . . yet she knows him, having grown up since the age of four with her only human contact being two distant voices: that of her elderly \"grandma,\" General Ko, and of Kazuhiko's dead girlfriend, Oruha. And Suu has been kept in that cage all these years because of what she is, and what the Clover Leaf Project found her to be -- a military top secret, and the most dangerous person in the world.\n(Source: Dark Horse Comics)","productName":"Clover","img":"https:\/\/media.kitsu.io\/manga\/293\/poster_image\/large-2597bb6878c80d6fdd617793951e2ca7.jpeg","chapterNumber":20},{"productId":294,"resume":"Coud is a young sky pirate who discovered a girl with mysterious powers on what had seemed like a routine mission. Ren has the ability to lend Coud bizarre fighting capabilities (his arm turns into a giant blade of some sort), being part of a race of beings called Edel Reid, but being the possessor of a stone called the Elemental Gelade, she has powers even beyond the norm. \n(Source: Tokyopop)","productName":"Erementar Gerad","img":"https:\/\/media.kitsu.io\/manga\/294\/poster_image\/large-bc2f7a2483e096faf739fb4a1a9c225a.jpeg","chapterNumber":96},{"productId":297,"resume":"About a junior high school English teacher, Kurei, who falls in love at first sight with a beautiful, young doctor from the local clinic. Inexperienced and short of help, the doctor, Fuyuki, recruits Kurei to help him at the clinic. The two grow close quickly, but soon Kurei notices some mysterious patients that visit the clinic and leave a drained and exhausted Fuyuki. \n(Source: M-U)","productName":"Nishimachi Shinryoujo no Himitsu - The Secret of Fuyuki","img":"https:\/\/media.kitsu.io\/manga\/297\/poster_image\/large-a95abb09fcce3b772be363235b494f27.jpeg","chapterNumber":7},{"productId":298,"resume":"Kirio is a man with a knack for getting women to like him, even though he really doesn’t know what to do with that talent. There are several women who have been in and out of his life, and all of their stories are about to collide as a long-time friend tries to become him…\n(Souce: Natsuyume)","productName":"Zegen-Yawa","img":"https:\/\/media.kitsu.io\/manga\/298\/poster_image\/large-3fa4aea50ca28dd32158e489efa98d1f.jpeg","chapterNumber":5},{"productId":299,"resume":"It is the year 2017, and the stakes have gotten even higher in the massively multiplayer online game The World--now The World R:2, a dangerous place overrun by player killers, where lawlessness abounds. The PKK Haseo, known as \"The Terror of Death,\" is a fearsome foe who punishes those who want to slay other players. But things have gotten personal as Haseo tries to track down the killer Tri-Edge, who has threatened the real life of his friend Shino... (Source: Tokyopop)","productName":".hack\/\/G.U.+","img":"https:\/\/media.kitsu.io\/manga\/299\/poster_image\/large-b460637f462b26445d0890b0083e2741.jpeg","chapterNumber":26},{"productId":300,"resume":"Meguru is leaving her home town for Tokyo. Before the parting she and her friend Taichi are sitting on the river bank and looking at the starry sky.","productName":"Negaigoto 300000 km\/s","img":"https:\/\/media.kitsu.io\/manga\/300\/poster_image\/large-2531ce5ed808944fd51e7c5c6e1a831c.jpeg","chapterNumber":1},{"productId":301,"resume":"Welcome to The World, the most advanced online game ever created. In The World you can be anyone you want to be, act out your adventure fantasies and through teamwork and determination, you can even become a hero. 14-year-old twins Shugo and Rena just won a contest that lets them play as the legendary avatars 'Kite' and 'Black Rose.' Armed with the power of the Twilight Bracelet, the two must discover what is causing rogue monsters to infect The World and carry on the legend of the .hackers. (Source: Tokyopop)","productName":".hack\/\/Tasogare no Udewa Densetsu","img":"https:\/\/media.kitsu.io\/manga\/301\/poster_image\/large-91c997c2d7f771326f6891e07e372b22.jpeg","chapterNumber":22},{"productId":302,"resume":"A story of ending a love and starting a love.","productName":"Koi wo Owari ni Shitakereba","img":"https:\/\/media.kitsu.io\/manga\/302\/poster_image\/large-bf9f3a5afcdbc8f3c2169d4770b9119e.jpeg","chapterNumber":6},{"productId":303,"resume":"Sweet and naïve Hanato Kobato came to Earth on a mission to collect and fill a bottle with 'konpeito,' which appear after healing a person's heart that is suffering. Kobato collects these because it is her wish to go to a certain place. Despite her strangeness, Kobato turns out to be well-suited for this mission as her heartfelt sincerity in helping others earns her the love and admiration of everyone she meets. However, she is not allowed to fall in love with anyone whose heart she heals.\n[Written by MAL Rewrite]","productName":"Kobato.","img":"https:\/\/media.kitsu.io\/manga\/303\/poster_image\/large-8205996fe41f581d06f9c289b837bc73.jpeg","chapterNumber":40},{"productId":304,"resume":"Oneshot about love, religion and a big misunderstanding that leads to a weird situation... (Source: MU)","productName":"Hoshi no Kuni","img":"https:\/\/media.kitsu.io\/manga\/304\/poster_image\/large-fe42d13c64d894701577c7c29a3c86c1.jpeg","chapterNumber":1},{"productId":305,"resume":"Hikaru, Umi, and Fuu, girls from separate schools, find themselves linked together as they fall through the floor during a field trip to the Tokyo Tower. They land in a place called Cephiro, where their will controls what happens. They meet with Guru Clef and find out that they were summoned to save Princess Emeraude who has been imprisoned by High Priest Zagato. They learn magic and acquire weapons on their quest to save Cephiro from the evils of Zagato.(Source:ANN)","productName":"Magic Knight Rayearth","img":"https:\/\/media.kitsu.io\/manga\/305\/poster_image\/large-09722ab40e24de87f4c2236f7094ee84.jpeg","chapterNumber":15},{"productId":306,"resume":"His name is Kazuki Shikimori, 17 years old. He attends Aoi Academy, a school for elite magicians. Each magician has a set limit of spells, and performing more spells than the limit allows will cause the user to turn into dust. In this case, the number of magic Kazuki can use is far below the average in his school. Then one day, all of a sudden, three girls appear before him. But of all the things that they are after, it is his GENES. And for Kazuki, the girls' appearances may also spell his doom, as he soon realizes that his magic count is decreasing ever steadily.\n(Source:ANN)","productName":"Maburaho","img":"https:\/\/media.kitsu.io\/manga\/306\/poster_image\/large-a2a3ec604eead6f719f3484a60b93c0a.jpeg","chapterNumber":133},{"productId":308,"resume":"1) Rabu. Sutori Ichi Musu\n2) Wandering\n3) Tomadoi\nA mangaka falls in love at first sight with his new assistant editor. The mangaka's assistant who was a classmate of the assistant editor tries to be their cupid...\n4) Fighting Love 20 Years\n5) Fighting Love 2000\n6) Refrain\n7) Drifting and Whirling\nHero regularly dates with a younger and rich office worker for money! But soon, he can't keep such an unfaithful relationship...\n8) The Miracle of Christmas\nA homosexual college student who is working at a convenience store falls in love with his colleague, a heterosexual and gamblesome high school graduate. Hero keeps pretending to be a good friend but soon he can't anymore because the colleague finds a girlfriend. Then another colleague, a very fat boy who has a steady girlfriend tries to play cupid...\n(Source: Mangafox.com)","productName":"Yume ga Kanau Juunigatsu","img":"https:\/\/media.kitsu.io\/manga\/308\/poster_image\/large-d73693fd03a6a98abf27e997f72e5311.jpeg","chapterNumber":8},{"productId":309,"resume":"Angel Cup tackles the highs and lows of girls' soccer at Hansin High. So-jin and Shin-bee are fiercely competitive and will play against anyone, including boys, for their beloved sport. Can our heroines navigate the fakes, fouls and penalties in the games of life and love well enough to reach their goal of being champs? \n(Source: Tokyopop)","productName":"Angel Cup","img":"https:\/\/media.kitsu.io\/manga\/309\/poster_image\/large-a3435ca24d7a3e7bf929bb32469cff22.jpeg","chapterNumber":35},{"productId":310,"resume":"Pairing: Jesse x Louis\nWhat should Jesse do when Louis gets jealous? And what does \"like a face of a Cotton Rose\" mean?\n(Source: Attractive Fascinante)","productName":"Manhattan Love Story dj - Meet Me in Cotton Roses","img":"https:\/\/media.kitsu.io\/manga\/310\/poster_image\/large-2a2b93c59842572a27ada290bbb4c8d3.jpeg","chapterNumber":1},{"productId":311,"resume":"This is a remarkably well-told story about a young woman named Rin, who used to be bullied in high school; and Sayaka, her classmate who used to take half-hearted pity on her. But Sayaka turns out to be a real wolf in sheep’s skin, so when the two women meet again in university at a party, Rin swears to take revenge on Sayaka. The points of view of both Rin and Sayaka are developed equally well and their thoughts and actions make us think deeper about our own conduct towards others.\n(Source: Aerandria Scans)","productName":"Sayounara, Utsukushii Hito","img":"https:\/\/media.kitsu.io\/manga\/311\/poster_image\/large-2f8c370427d4c9f233de3656f1d2c84e.jpeg","chapterNumber":1},{"productId":313,"resume":"After 150 years of Terraforming, Aqua, the formerly planet known as Mars, now has more than 90 percent of its surface covered in water. A young girl named Akari Mizunashi arrives at the city of Neo-Venezia, an exact replica of the old Italian city of Venice, hoping to become an Undine, the most coveted job on Aqua. (Source: Tokyopop)","productName":"Aqua","img":"https:\/\/media.kitsu.io\/manga\/313\/poster_image\/large-1ee8e726cfcabc27c3122abd90907048.jpeg","chapterNumber":10},{"productId":316,"resume":"The great warrior Leon Manas, son of the legendary Nathan Manas, now carries the powerful sword Brumhart. Though this blade is coveted by many, only the heirs to the House of Manas can wield it. But that doesn’t stop the sinister from trying. Ernan, once trusted knight of the House of Manas, murders his commander, robs him Brumhart and orders the death of Leon’s only son, Zian. But the men sent to perform this infanticide come up against a mysterious figure in a dark cloak who defeats them only to disappear with child into the thick of the Tass Forest. Sixteen years later, Ernan has become a feared tyrant, but still has not been able to unsheathe Brumhart. Thus begins the tale of this desperate king and the young boy who would be one. (Source: Tokyopop)","productName":"Archlord","img":"https:\/\/media.kitsu.io\/manga\/316\/poster_image\/large-358b25842a6e6dd403b61f55095bd1c2.jpeg","chapterNumber":46},{"productId":317,"resume":"A slice of life 4-koma revolving around three 2nd year highshool students - Miri Washizu, Natsumi Mameda, and Utako Nagao.  Miri is of small stature but commonly misunderstood for being violent because of the mean expression on her face.  Natsumi's main goal is to make life hard for Miri.  Utako is class president and often looks after Miri.","productName":"Gu-pan!","img":"https:\/\/media.kitsu.io\/manga\/317\/poster_image\/large-55d7538c87ff2fc5d0c0bf1948e2e3de.jpeg","chapterNumber":54},{"productId":318,"resume":"From a small lake nestled in a secluded forest far from the edge of town something strange emerged one day: Three young girls. The three girls, Shem, Hamu and Japheth, are sisters from another world. Equipped with magical powers, they are charged with saving all the creatures of Earth from becoming extinct. However, there is someone or something sinister trying to stop them. While saving our world from destruction, these sisters live like normal human girls: They go to school, work at a flower shop, hang around with friends and even fall in love... (Source: Tokyopop)","productName":"Ark Angels","img":"https:\/\/media.kitsu.io\/manga\/318\/poster_image\/large-172a5b0f4da7488111598b8959c72c82.jpeg","chapterNumber":12},{"productId":320,"resume":"Barista is someone who prepares and serves coffee drink in coffe house or the like, basically a coffee house bartender. Thus other than having the skill to prepare then to serve the coffee and a deep knowledge about the coffee, a good barista need to be good at interacting with the costumer.\nAoi Kouki is a barista who used to travel and hopping from one coffee house to another in Italia. One day someone from a big company took interest in his skill and invited him to work as a barista in a the company's new coffee house in Japan. He accepted the invitation and then his career as a barista in Japan started.","productName":"Barista","img":"https:\/\/media.kitsu.io\/manga\/320\/poster_image\/large-320e64df71e56715d9a8256dace910d2.jpeg","chapterNumber":89},{"productId":321,"resume":"Kurokami Medaka, a first year, is elected as Student Council President, and the first thing she does is establish a suggestion box. Since she was just elected as Student Council President, she's holding all the Student Council's responsibilities, and wearing their armbands. So she asks for her childhood friend, Hitoyoshi Zenkichi, for help.\nAfter filtering through the suggestions, which were mostly ridiculous complaints or congratulations on becoming president, they find out the Judo Club needs one more member to participate. So, Medaka volunteers her and Zenkichi, who have both been practicing Judo for years, to help train the club and borrow Zenkichi for the match.\n(Source: MangaFox)","productName":"Medaka Box","img":"https:\/\/media.kitsu.io\/manga\/321\/poster_image\/large-c31bc7caa4c403f3bc895d746e75efb7.jpeg","chapterNumber":1},{"productId":322,"resume":"A smoke-filled alley in Chinatown harbors Count D's Pet Shop. The pets sold here aren't your everyday variety and the Count prides himself on selling Love and Dreams in the form of magical creatures that come with an exclusive contract. But buyers beware. If the contract is broken the Count cannot be held accountable for whatever may happen. A fascinating and macabre look into the very soul of human nature.\n(Source: Tokyopop)","productName":"Petshop of Horrors","img":"https:\/\/media.kitsu.io\/manga\/322\/poster_image\/large-6a8bdc6e25eb62c90fbe83442d1a719b.jpeg","chapterNumber":41},{"productId":323,"resume":"Deep within the mountains of Tibet, secluded from the mortal world, sits The Arm of Kannon, an instrument of inconceivably wicked power, resting safely outside the grasp of humanity ... until now.\nAn archeologist, Juzo Mikami, dizzied with tales of The Arm's power and determined to unlock the mystery behind this Buddhist secret, sets out on a journey to find this ancient artifact and is never heard from again, leaving behind his wife and children. Three years later, he returns to his family, however he isn't the man he was, and his family will never be the same. (Source: Tokyopop)","productName":"Birth","img":"https:\/\/media.kitsu.io\/manga\/323\/poster_image\/large-04b5a980089f34ee51782ec02eb23d0b.jpeg","chapterNumber":17},{"productId":324,"resume":"A young girl is sacrificed to appease a hungry and arrogant demon, all for the sake of saving the villagers… She was only supposed to fill his empty belly, not worm her way into his heart…\n(Source: Aerandria)","productName":"Sara no Ue no Kanojo","img":"https:\/\/media.kitsu.io\/manga\/324\/poster_image\/large-d199be2bc2c5bf5921b9afd15f91c9bc.jpeg","chapterNumber":1},{"productId":325,"resume":"Akira, Nokoru, and Suoh are the student council heads in the Elementary department of the CLAMP university. After one encounter with a damsel in distress, Nokoru turns the group into a group of sleuths out to make the world safe for everyone of the female sex. \n(Source: ANN)","productName":"Clamp Gakuen Tanteidan","img":"https:\/\/media.kitsu.io\/manga\/325\/poster_image\/large-0b5aa3e6a5d5789025ab40538c0b1bdb.jpeg","chapterNumber":12},{"productId":326,"resume":"When two gal pals go on road trip, anything can happen! Sayumi and Hide are two friends cursed with the same fate: They're both stuck in dead-end relationships, and neither can find her way out. When they decide to hit the road and go to Hide's country home for the summer, they learn loads about love, life, and each other. 'The Aromatic Bitters' follows the lives of two women with nothing left to lose but their inhibitions. (Source: Tokyopop)","productName":"Aromatic Bitters","img":"https:\/\/media.kitsu.io\/manga\/326\/poster_image\/large-16c79a53a5f0dc4edadc32ed435a01bb.jpeg","chapterNumber":11},{"productId":327,"resume":"Takamiya Teppei is a young man who reunites with his brother, Takamiya Kotaro, an important scientist in robotics engineering, to protect him. In the middle of a great conference, Kotaro is taken prisoner by the Machines Empire. While trying to rescue him, Teppei accidentally wakes up a B't (Pronounced Beat) -a combat robot used as a flying vehicle in the shape of a legendary beast- with the name of X. Now, they join forces in order to fight against the evil Machines Empire, which tries to take over the world. (Source: ANN)","productName":"B'T X","img":"https:\/\/media.kitsu.io\/manga\/327\/poster_image\/large-8173b2bec699bf06442803ba02cfb21f.jpeg","chapterNumber":63},{"productId":328,"resume":"In order to pay for the debt that his parents left behind, Gin accepts an escort job from the bill collectors of the Tokugawa Group conglomerate. The client is a girl named Hikari who goes to Tokugawa Private Academy. Using the experience he gained from his previous part-time jobs, Gin protects Hikari along with the other escorts, Suke and Kaku. However, Hikari seems to have a hidden secret...!?\n(Source: MU)","productName":"Yellow Gate!","img":"https:\/\/media.kitsu.io\/manga\/328\/poster_image\/large-d497ba9e3d6be0555aca05205b049505.jpeg","chapterNumber":12},{"productId":329,"resume":"Subaru Sumeragi is a 16 year old, cheerful and extremely caring Onmyou medium (the head of his family, the Sumeragi clan) who confronts and helps take care of ghosts and spirits with the help of his twin sister, Hokuto, and his gentleman friend, Seishiro. Subaru does his best to help anyone he meets, but the entire atmosphere of the polluted city of Tokyo in the 90s, brings about a feeling of desperation that threatens to drag Subaru's spirit down. (Source:ANN)","productName":"Tokyo Babylon","img":"https:\/\/media.kitsu.io\/manga\/329\/poster_image\/large-686f2c4335c15aabaef5c63fd26f459b.jpeg","chapterNumber":18},{"productId":330,"resume":"Ginta Toramizu is a 14-year-old kid who doesn't have a lot going for him: he's near-sighted, doesn't do well in school, sucks at sports, and to top it off--he's short! But Ginta is a dreamer and has had the same dream 102 times, always in the same fantasy world, where he is a hero blessed with all the abilities he lacks in real life.\nThen one day a supernatural figure appears at Ginta's school and summons him to a mysterious and exciting new world! In this strange universe filled with magic and wonder, he is strong, tough, agile--and he can see without his glasses! Thus, Ginta begins a mystical quest in search of the magical items known as \"ÄRMS,\" one of which may have the power to send him home. Joining him on this epic journey are his companion Jack and the valuable living, talking, mustachioed iron-ball weapon known as \"Babbo,\" which everyone wants but, it seems, only Ginta can possess! \n(Source: Viz)","productName":"MÄR","img":"https:\/\/media.kitsu.io\/manga\/330\/poster_image\/large-631516cd725aff55632ecc461f38e5f6.jpeg","chapterNumber":161},{"productId":331,"resume":"No synopsis has been added for this manga yet.Click here to update this information.","productName":"The Shanglad Shinki","img":"https:\/\/media.kitsu.io\/manga\/331\/poster_image\/large-d095199e852c92245e4dcd1d362e22d3.jpeg","chapterNumber":5},{"productId":332,"resume":"As children, Lee Haru and Yun Dong-Ha made a promise, one to become a famous baseball player, the other a ballerina. When Lee Haru departs for Russia, they both decide that when they meet again they'll become a couple.\nFast-foward several years, and Dong-Ha, now a feared deliquent, is excited to find out Lee-Haru is returning to his school. Expecting to meet a gorgeous, skinny ballerina, he is rather dismayed to find out Haru hasn't exactly turned out the way he expected. \nFrom Baka-Updates","productName":"Pretty Haru","img":"https:\/\/media.kitsu.io\/manga\/332\/poster_image\/large-3361fa8945470c2474300f425521da01.jpeg","chapterNumber":12},{"productId":333,"resume":"Young Kai has been passionately idolizing Ginta ever since his heroic battle in the War Games of six years ago. Since then, ARMs have become a common thing, Guardians especially! Kai himself doesn't have one though, and dreams big of being able to get an ARM like Ginta's! When his caretaker, the old ARM-smith that took him in after his parents' deaths, sends him out on an errand, he is attacked by a bandit from \"chess\"! In his escape attempt, he finds more than he bargained for when he comes across Babbo! But, now with Babbo's awakening, the fake ARMs are going out of control! Is it Kai's turn to save MAR Heaven following in his hero's footsteps?\n(Source: Project Kurai Ryu)","productName":"MÄR Omega","img":"https:\/\/media.kitsu.io\/manga\/333\/poster_image\/large-d978c0346f56ff53e6e8e8582da53cb6.jpeg","chapterNumber":39},{"productId":334,"resume":"If you read this, you'll be able to get a 3-D girlfriend!? A \"how to\" comic!","productName":"Boku to Kanojo no Koi Log","img":"https:\/\/media.kitsu.io\/manga\/334\/poster_image\/large-83cdf0fad580d59b50e25fd3efe1e219.jpeg","chapterNumber":19},{"productId":335,"resume":"A Gundam 00 side story. Planned to replace 00F in Gundam Ace. The story focuses on Innovades and Innovators.","productName":"Mobile Suit Gundam 00I","img":"https:\/\/media.kitsu.io\/manga\/335\/poster_image\/large-9d44639458675436665f09d62a6f6aea.jpeg","chapterNumber":14},{"productId":336,"resume":"Becoming a ninja is just a childhood dream for sixteen-year-old Recca, until a fateful encounter reveals he has inherited ninja powers, including the ability to wield fire! As Recca learns to master the ancient ways of his ancestors, he is drawn to protect a mysterious girl named Yanagi... \n(Source: Viz)","productName":"Rekka no Honoo","img":"https:\/\/media.kitsu.io\/manga\/336\/poster_image\/large-feebe472656925343ebe5dbf45140a83.jpeg","chapterNumber":329},{"productId":337,"resume":"When her parents went overseas, Nagamori Konoka moved in with her aunt and her cousin, Itsuki. Konoka is excited to transfer into this new school and start her new school life, but she starts off her first day by being late to class! She's eager to jump into student life, and when she learns that her cousin is in the tennis club, she decides to join the girls tennis club. Konoka has never played tennis before, and she is taken aback to see how highly skilled the other girls are. When she tries hitting a few balls, though, Konoka surprises everyone with her amazing natural talent! Konoka begins to make friends with the girls on the tennis team, especially the captain, Kyoka. The one teammate who doesn't seem to want to be her friend is her classmate Mizuki, who is skilled at tennis but very standoffish. Will Konoka be able to make friends with everyone and enjoy her tennis-filled life to the fullest?\n(Source: MangaHelpers)","productName":"Rising Hearts","img":"https:\/\/media.kitsu.io\/manga\/337\/poster_image\/large-5a8a7430b492ad7d5bf2768879faaaaf.jpeg","chapterNumber":10},{"productId":338,"resume":"Yomiko Readman's love for literature goes far beyond any run-of-the-mill bookworm's! In fact, she has a supernatural ability to manipulate paper in the most amazing ways. From turning a tiny scrap into a lethal throwing dagger to making a single sheet hard enough to block bullets, she's only limited by her imagination. She uses her phenomenal power to seek out legendary books containing secret information that, in the wrong hands, could be dangerous. Backed by a Special Operations Division in England, Yomiko has her hands full battling evildoers, saving the world, and trying to find time to curl up with a good book. (Source: Viz)","productName":"R.O.D: Read or Die","img":"https:\/\/media.kitsu.io\/manga\/338\/poster_image\/large-e8ed43ad191d1980ae01ac8db4575b7d.jpeg","chapterNumber":30},{"productId":340,"resume":"An ancient seal has been broken, sending a flood of demons into the mortal realm. Hizuru Oborozuki and Takuya Hijou, descendants of the great savior who banished the demons in the past, must fight the evil spirits using their mystical powers. In order to give the world a fighting chance, Takuya uses his music to transform Hizuru into a beautiful warrior. Some things are worth fighting for, but is the Earth one of them? (Source: Tokyopop)","productName":"Baby Birth","img":"https:\/\/media.kitsu.io\/manga\/340\/poster_image\/large-4cc04a2696f05401a9ab06a165aa3d49.jpeg","chapterNumber":21},{"productId":341,"resume":"Chp 1-3: Baku\nNear death, Takeshi meets a snow woman named Yukiko who claims he is the reincarnation of a \"baku\" - a monster that eats nightmares... What does fate have in store for Takeshi? (Source: Shoujomagic)\nChp 4-5: Mephisto\nMephisto is a 15 year old boy, who liev with his sisters, and a little girl, hamster, and her farthers evil friends son... Mephisto work as a ghost buster, and helps ghost to the other world.","productName":"Ba_ku","img":"https:\/\/media.kitsu.io\/manga\/341\/poster_image\/large-b49566d13930eb938655e837322a93e6.jpeg","chapterNumber":5},{"productId":342,"resume":"Haizuka just wants to live a normal life, a peaceful life far away from all the trouble he's faced. But as soon as he starts highschool, an encounter with a girl and a strange creature destroys any hope of a peaceful life. \n(Source: MU)","productName":"Adashi Mono","img":"https:\/\/media.kitsu.io\/manga\/342\/poster_image\/large-e41051a93f0235ae27137e112b3848cd.jpeg","chapterNumber":15},{"productId":343,"resume":"In an age of magic and sorcery, the world is divided between those who have supernatural powers and those who don't. Fighting for justice and against black magic and evildoers everywhere are the Sorcerer Hunters: Gateau, Carrot, Chocolat, Mocha, and the rest of the gang. Their quest is to destroy each of the Platina stones- the objects the evil sorcerers use for creating their black magic - in an entertaining mix of farce and adventure. (Source: Tokyopop)","productName":"Bakuretsu Hunters","img":"https:\/\/media.kitsu.io\/manga\/343\/poster_image\/large-08584f453426fd1c3d9044c86c6a8db8.jpeg","chapterNumber":72},{"productId":344,"resume":"No synopsis has been added for this manga yet.Click here to update this information.","productName":"Mousoukei Danshi!","img":"https:\/\/media.kitsu.io\/manga\/344\/poster_image\/large-b454bf34ba77caac3410fa603cc68185.jpeg","chapterNumber":4},{"productId":345,"resume":"When freshman transfer Mokichi arrives at Swan Academy High, he's got a chance to start over with a clean slate. He's got a plan, too. Kick the butts of the toughest guys in school, prove himself to be the baddest dude around, and run the whole shebang. Problem is, it's his butt that gets kicked that first day. Completely humiliated, Mokichi joins the Wrestling Club in hopes of learning to fight. There he meets unlikely allies, Tamako and Higuchi, two of the hottest battle babes to ever roll their sweaty bods over Swan Academy's gym mats. And Mokichi's gonna need all the friends he can get, what with the likes of the Karate Club looking to \"break in\" the new kid in the worst way possible. (Source: Tokyopop)","productName":"Battle Club","img":"https:\/\/media.kitsu.io\/manga\/345\/poster_image\/large-513354c1ecdffea3b13efffb3a79eee8.jpeg","chapterNumber":47},{"productId":346,"resume":"A collection of short stories telling the tales of peasant farmers in rural pre-modern Japan, and the lives they live.\n(Source: MU)","productName":"Akai Yuki","img":"https:\/\/media.kitsu.io\/manga\/346\/poster_image\/large-9fdcd3539d86a0a8cbc8671848a5f116.jpeg","chapterNumber":10},{"productId":347,"resume":"No synopsis has been added for this manga yet.Click here to update this information.","productName":"Dark Act","img":"https:\/\/media.kitsu.io\/manga\/347\/poster_image\/large-3e4cb40cc81b6976d3d560d67e0e2fcc.jpeg","chapterNumber":6},{"productId":348,"resume":"Under the guise of a \"study trip,\" a group of students from Shiroiwa Junior High School in the fictional town of Shiroiwa (Kagawa Prefecture) are gassed on a bus. They awaken in the Okishima Island School on Okishima, an isolated, evacuated island. They learn that they have been placed in an event called the Program.\n\nAccording to the rules, every year since 1947, 42 third-year high school students are isolated, and each student is required to fight to the death until one student remains. Their movements are tracked by metal collars around their necks, which contain tracking and listening devices; if any student should attempt to escape the Program, or enter declared forbidden zones, a bomb will be detonated in the collar, killing the wearer. If no one dies in a 24 hour time period, there will be no winner and all collars will be detonated simultaneously.\n\n(Source: Wikipedia)","productName":"Battle Royale","img":"https:\/\/media.kitsu.io\/manga\/348\/poster_image\/large-3af110defc0bce3305803ceda073c867.jpeg","chapterNumber":119},{"productId":349,"resume":"She read Yukiko’s Spinach for the hundredth time. Was that really her looking so young? In the four years since then she had been the mangaka’s only model and love. This trip to the beautiful island of Enoshima was typical. They would find the best shooting locations, of course, but also enjoy each other.\nIt’s the rainy season and the hydrangeas are in full bloom. He knew she would leave soon...\nA poignant, often droll tale from two of the most exciting creators in the medium today. \n(Source: Ponent Mon)","productName":"Mariko Parade","img":"https:\/\/media.kitsu.io\/manga\/349\/poster_image\/large-d95db1920ed52de21407ddfd4e1a92ae.jpeg","chapterNumber":1},{"productId":350,"resume":"Beautiful People is a manga comprised of six profound and thought-provoking short stories. It includes a tale of a vampire who raises a child as her own, a story of a young man who copes with an alcoholic father amongst other problems with the help of an online friend and four others short stories. (Source: ANN)","productName":"Beautiful People","img":"https:\/\/media.kitsu.io\/manga\/350\/poster_image\/large-80c6ffddd0d01f3d7db108eebc04ffe9.jpeg","chapterNumber":6},{"productId":351,"resume":"Thoughts on growing up from the Kindergarten of Evil students. (Source: Psycho Pandas)","productName":"Akachan no Oshigoto","img":"https:\/\/media.kitsu.io\/manga\/351\/poster_image\/large-0328566e51ad12738f8feabc013c0557.jpeg","chapterNumber":1},{"productId":352,"resume":"Goddess Pandora was sent to Earth to collect \"gifts\" that were spread among humans. She has a nice body that can temp anyone who looks at her, but when she uses her powers, she shrinks to a young girl's body. The only way to gain her power back is to kiss her reluctant peon, Aoi.\n(Source: Tokyopop)","productName":"Kamisama Damono♥","img":"https:\/\/media.kitsu.io\/manga\/352\/poster_image\/large-0905babb2f7ca693c720a895a7369be2.jpeg","chapterNumber":19},{"productId":354,"resume":"For the first 14 years of his life, Yukio Tanaka has been one heck of a boring guy. He has no hobbies, a weak taste in music, and only a small vestige of a personality. He yearns for an exciting life, but his shy, and somewhat neurotic personality make him his own worst enemy. Little does he know that his life will be forever changed when he meets Ryusuke Minami, a wild and unpredictable 16 year-old fresh from America, who happens to be in a rock-and-roll band named after his Frankenstein-like patched dog—Beck.\n\n(Source: Tokyopop)","productName":"Beck","img":"https:\/\/media.kitsu.io\/manga\/354\/poster_image\/large-d51b96da5413fe6a8d794e7df52eaad3.jpeg","chapterNumber":103},{"productId":355,"resume":"\"Everytime he teases me, my body aches for him.\nWhy am I reacting to his touch?\nDon't tell me that I...\nWe realized our feelings when our bodies were one.\nI came to know what 'climax' is or the first time.\nWhen I had figured out that I'm falling for you, you had already joined the Renai Club.\"\n(Source: Covenant of Darkness &amp; Fate)","productName":"Renai Club","img":"https:\/\/media.kitsu.io\/manga\/355\/poster_image\/large-ea15009428448c24f21b449549ffd0f2.jpeg","chapterNumber":2},{"productId":356,"resume":"\"My boyfriend's a little on the sadistic side, and he takes pictures of me while he's taking me from behind... I know it's wrong, but it gets me going so much that I shiver and cry. These are five stories about lovers' licentious experiences.\" (DMG)","productName":"Koibito-tachi no Midara na Koi","img":"https:\/\/media.kitsu.io\/manga\/356\/poster_image\/large-4ae3d0559f8d16c2f2035c402a9babf6.jpeg","chapterNumber":1},{"productId":357,"resume":"Between the Sheets features the unusual friendship from the nearly inseparable Saki and Minako. Minako carries a fervent torch for the other girl - a passion of which Saki is initially ignorant. But when Minako sleeps with Saki's boyfriend Ken (just to see what Saki sees in him), the true nature of Minako's obsession begins to reveal itself ... provoking an understandably strong reaction from Saki. (Source: Tokyopop)","productName":"Sheets no Sukima","img":"https:\/\/media.kitsu.io\/manga\/357\/poster_image\/large-8133738b0760865bf88e42c38625433f.jpeg","chapterNumber":6},{"productId":358,"resume":"Futaba, a boy that has grown up in an overprotected family, suddenly finds himself on the other side of the world, where he meets Kiara, the Amaranthine. They journey to find Kiara's true master, and along the way they meet a curious cast of characters, including the wizard Belbel and the prince Virid.\n(Source: Tokyopop)","productName":"Sono Mukou no Mukougawa","img":"https:\/\/media.kitsu.io\/manga\/358\/poster_image\/large-a59a0559bc1969c3b692591a57c68e1a.jpeg","chapterNumber":38},{"productId":359,"resume":"Kazuma, a yakuza, is shot and saved by the heir of a tea ceremony family, Shibata Yukihiro. Yukihiro,the illegitimate son, never allowed himself to ask for anything. Kazuma is the only one that Yukihiro wants to protect even though the burden that Kazuma carries is too dangerous. What should they do?\n(Source: Blu)","productName":"Ake Nure Goyou ni Furu Yuki wa","img":"https:\/\/media.kitsu.io\/manga\/359\/poster_image\/large-2a7fed6b624aa3d89f9ee35dcf076103.jpeg","chapterNumber":6},{"productId":360,"resume":"No synopsis has been added for this manga yet.Click here to update this information.","productName":"Senpai no Mizugi","img":"https:\/\/media.kitsu.io\/manga\/360\/poster_image\/large-729589fbe6bc91bb9aa8d638d7bbbebf.jpeg","chapterNumber":8},{"productId":362,"resume":"Killy is a man of few words. He wanders, seemingly endlessly, through a lonely, gargantuan labyrinth of concrete and steel, fighting off cyborgs and other futuristic nightmares, searching only for something called Net Terminal Genes. And he has a very powerful gun, which he uses without hesitation whenever anything resembling danger rears its ugly head.\n\nWho is this quiet, violent, determined man and what are these Genes he seeks? The small communities he finds tucked into the crevices of this towering, dystopic ruin hardly give him leads on his treasure, driving him to find larger enclaves of civilization where people can reveal more about the world he lives in and the quarry he seeks.\n\n(Source: Tokyopop)","productName":"Blame!","img":"https:\/\/media.kitsu.io\/manga\/362\/poster_image\/large-c425fdf3650e28c7f7818fcb7f9a06c2.jpeg","chapterNumber":66},{"productId":365,"resume":"Three centuries ago, a vampire by the name of Migiri was running a reign of terror across Japan when a hero named Naonosuke Kobayashi cut off his head and sent him to eternal rest... until now. (Source: Tokyopop)","productName":"Blood Sucker","img":"https:\/\/media.kitsu.io\/manga\/365\/poster_image\/large-6c38419b21a01b01071a856d7b44011c.jpeg","chapterNumber":40},{"productId":366,"resume":"No synopsis has been added for this manga yet.Click here to update this information.","productName":"Colorful","img":"https:\/\/media.kitsu.io\/manga\/366\/poster_image\/large-a61efe43e5efa2bd2cd7b124f8a04df1.jpeg","chapterNumber":0},{"productId":368,"resume":"An anthology of stories about ordinary high school guys and their relationships...or lack thereof. Boys Be...takes a look at the trials of love and loss from a refreshing point of view and often adds interesting insight into what a relationship is like from an average guys point of view! (Source: Tokyopop)","productName":"Boys Be...","img":"https:\/\/media.kitsu.io\/manga\/368\/poster_image\/large-1c6dfaa9b855d0101597141f3dfc3fe3.jpeg","chapterNumber":0},{"productId":371,"resume":"371","productName":"ATest","img":"wxfdgwxdfg","chapterNumber":0},{"productId":372,"resume":"dfsgds","productName":"AAA","img":"sdfg","chapterNumber":5}]