[{"productId":2,"resume":"When Kousei Matsumoto finds a a man apparently suffering from heatstroke alone out on the street, he takes him despite his better judgement. The young man is a mystery with a scar he won't explain, and the only clue to his past is the whispered name “Mori.” Despite this, Kousei finds his heart becoming entangled, and the pair forge a fragile relationship. When the past literally comes knocking at his door and the truth of the young man's true identity comes out, Kousei comes to a decision that literally tears the pair apart. But is it the right choice, and can the lonely, waif-like stray face his past and forge a future that includes Kousei?\n(Source Digital Manga)","productName":"Boku no Mune ga Itakutemo - Glass","img":"https:\/\/media.kitsu.io\/manga\/2\/poster_image\/large-d3fd8ae93e6621deb2f46dc66aaec749.jpeg","chapterNumber":4},{"productId":4,"resume":"Dr. Kenzo Tenma is a renowned young brain surgeon of Japanese descent working in Europe. Highly lauded by his peers as one of the great young minds that will revolutionize the field, he is blessed with a beautiful fiancé and is on the cusp of a high promotion in the hospital he works at. However, all of that is about to change with one critical decision that Dr. Tenma faces one night – whether to save the life of a young child or that of the town's mayor. Despite being pressured by his superiors to perform surgery on the mayor, his morals force him to perform the surgery on the young child, saving his life and forfeiting the mayor’s. All of a sudden, Dr. Tenma’s world is turned upside down by his decision leading to the loss of everything he previously had. A doctor is taught to believe that all life is equal; however, when a series of murders occur in the vicinity of Dr. Tenma, all of the evidence pointing to the young child who he saved, Tenma’s beliefs are shaken.\nNaoki Urasawa’s Monster is a tale full of mystery, suspense and intrigue as Dr. Tenma journeys to find out the true identity of the young child. In turn, the fate of the world may depend on it.\n\n(Source: MAL Rewrite)","productName":"Monster","img":"https:\/\/media.kitsu.io\/manga\/4\/poster_image\/large-3f0e9ec4311eaee738694f741d40730b.jpeg","chapterNumber":162},{"productId":6,"resume":"Collection of oneshots:\n1) Pink Sweets\n2) Story of Bishounen Love\n3) Cats &amp; Aprons\n5) Strawberry on the Shortcake","productName":"Renai Soukanzu","img":"https:\/\/media.kitsu.io\/manga\/6\/poster_image\/large-136b19305c8f19dc64d9c9213f5b0943.jpeg","chapterNumber":7},{"productId":9,"resume":"Collection of 5 one shots:\n- Anata e no Tsuki (Moon for You)\n- Kataomoi no Sono Saki (Beyond A One-Sided Love)\n- 7-ho-me no Mirai\n- Kare ga Kanojo ni Nozomu Mono (What He Expects of Her)\n- Spring.","productName":"Anata e no Tsuki","img":"https:\/\/media.kitsu.io\/manga\/9\/poster_image\/large-e4865bfdec71cd3a0db5c26bc8329e0b.jpeg","chapterNumber":5},{"productId":12,"resume":"Humanity, having faced extinction at the end of the 20th century, would not have entered the new millennium if it weren't for them. In 1969, during their youth, they created a symbol. In 1997, as the coming disaster slowly starts to unfold, that symbol returns. This is the story of a group of boys who try to save the world.\n\nFor Kenji, a simple convenience store manager who once dreamed of becoming a rock 'n' roll musician, a host of memories from his past come rushing back when one of his childhood friends mysteriously commits suicide. Could this new death be related to the rise of a bizarre new cult that's been implicated in several other murders and disappearances? Determined to dig deeper, Kenji reunites with some of his old buddies in the hope of learning the truth behind it all.\n\n(Source: Viz)","productName":"20th Century Boys","img":"pas d'image","chapterNumber":249}]